[
  {
    "cve_id": "CVE-2025-2637",
    "description": "A vulnerability, which was classified as problematic, has been found in JIZHICMS up to 1.7.0. Affected by this issue is some unknown functionality of the file /user/userinfo.html of the component Account Profile Page. The manipulation of the argument jifen leads to improper authorization. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The JIZHICMS software version up to 1.7.0 has a vulnerability in the Account Profile Page component, specifically in the /user/userinfo.html file. This vulnerability allows for improper authorization through manipulation of the jifen argument, which could potentially be exploited remotely. Users of JIZHICMS are advised to update to a secure version and be cautious of any suspicious activity on their accounts.",
    "software": [
      "JIZHICMS",
      "Account Profile Page"
    ]
  },
  {
    "cve_id": "CVE-2025-2638",
    "description": "A vulnerability, which was classified as problematic, was found in JIZHICMS up to 1.7.0. This affects an unknown part of the file /user/release.html of the component Article Handler. The manipulation of the argument ishot with the input 1 leads to improper authorization. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in JIZHICMS up to version 1.7.0 allows unauthorized users to gain access to sensitive information through manipulation of the ishot argument in the Article Handler component. This could potentially affect any users of the software who have not updated to a secure version. To protect against this threat, users should update their JIZHICMS software to a version beyond 1.7.0.",
    "software": [
      "JIZHICMS",
      "Article Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2639",
    "description": "A vulnerability has been found in JIZHICMS up to 1.7.0 and classified as problematic. This vulnerability affects unknown code of the file /user/release.html of the component Article Handler. The manipulation leads to improper authorization. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "A security flaw has been discovered in JIZHICMS up to 1.7.0 that allows for unauthorized access to certain files through the Article Handler component. This vulnerability can be exploited remotely by attackers. Users of JIZHICMS should update to the latest version or implement security measures to protect against potential unauthorized access.",
    "software": [
      "JIZHICMS",
      "Article Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2640",
    "description": "A vulnerability was found in PHPGurukul Doctor Appointment Management System 1.0 and classified as critical. This issue affects some unknown processing of the file /doctor/appointment-bwdates-reports-details.php. The manipulation of the argument fromdate/todate leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul Doctor Appointment Management System allows for SQL injection through a specific file. This could potentially be exploited by attackers remotely. Users of this system should update to a patched version to prevent any attacks.",
    "software": [
      "PHPGurukul Doctor Appointment Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2641",
    "description": "A vulnerability, which was classified as critical, has been found in PHPGurukul Art Gallery Management System 1.0. Affected by this issue is some unknown functionality of the file /admin/edit-artist-detail.php?editid=1. The manipulation of the argument Name leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul Art Gallery Management System allows attackers to manipulate the system through SQL injection, potentially compromising sensitive data. Users of this system should update to a patched version to protect against this threat.",
    "software": [
      "PHPGurukul Art Gallery Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-0718",
    "description": "The Nested Pages WordPress plugin before 3.2.13 does not sanitise and escape some of its settings, which could allow high privilege users such as contributors to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Nested Pages WordPress plugin before version 3.2.13 is vulnerable to Stored Cross-Site Scripting attacks, which could allow higher privilege users to inject malicious code into the website, even if certain security measures are in place. This could affect websites using this plugin, especially in a multisite setup. Users should update the plugin to version 3.2.13 or later to prevent potential security risks.",
    "software": [
      "Nested Pages WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1446",
    "description": "The Pods  WordPress plugin before 3.2.8.2 does not sanitize and escape a parameter before using it in a SQL statement, allowing admins to perform SQL injection attacks",
    "summary": "A vulnerability has been found in the Pods WordPress plugin that allows attackers to perform SQL injection attacks. This affects users of the plugin who have not updated to version 3.2.8.2. Users should update to the latest version of the plugin to fix this issue and prevent potential attacks.",
    "software": [
      "Pods",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2642",
    "description": "A vulnerability, which was classified as critical, was found in PHPGurukul Art Gallery Management System 1.0. This affects an unknown part of the file /admin/edit-art-product-detail.php?editid=2. The manipulation of the argument editide/sprice/description leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Art Gallery Management System 1.0 has a critical vulnerability that allows for a SQL injection attack through the editid parameter in the file /admin/edit-art-product-detail.php. This vulnerability can be exploited remotely, and the exploit has been made public. Users of this system should update to a patched version as soon as possible to protect against potential attacks.",
    "software": [
      "PHPGurukul Art Gallery Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2643",
    "description": "A vulnerability has been found in PHPGurukul Art Gallery Management System 1.0 and classified as critical. This vulnerability affects unknown code of the file /admin/edit-art-type-detail.php?editid=1. The manipulation of the argument arttype leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This security vulnerability in PHPGurukul Art Gallery Management System allows attackers to manipulate code through a specific file and conduct a SQL injection attack. This could affect anyone using this system. Users should update to a patched version as soon as possible to protect against potential attacks.",
    "software": [
      "PHPGurukul Art Gallery Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2644",
    "description": "A vulnerability was found in PHPGurukul Art Gallery Management System 1.0 and classified as critical. This issue affects some unknown processing of the file /admin/add-art-product.php. The manipulation of the argument arttype leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in the PHPGurukul Art Gallery Management System allows attackers to manipulate certain files and perform SQL injections, which could lead to unauthorized access to data. Anyone using this system should update it to the latest version or apply patches to protect against this security issue.",
    "software": [
      "PHPGurukul Art Gallery Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2645",
    "description": "A vulnerability was found in PHPGurukul Art Gallery Management System 1.0. It has been classified as problematic. Affected is an unknown function of the file /product.php. The manipulation of the argument artname leads to cross site scripting. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul Art Gallery Management System 1.0 allows for a cross-site scripting attack through manipulation of the argument artname in the file /product.php. This can be exploited remotely and has been publicly disclosed. Users of this system should update to a patched version or take necessary precautions to prevent this vulnerability from being exploited.",
    "software": [
      "PHPGurukul Art Gallery Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2646",
    "description": "A vulnerability was found in PHPGurukul Art Gallery Management System 1.0. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file /admin/admin-profile.php. The manipulation of the argument contactnumber leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. Other parameters might be affected as well.",
    "summary": "The PHPGurukul Art Gallery Management System 1.0 has a critical vulnerability in the admin-profile.php file, which can be exploited through SQL injection via the contactnumber argument. This vulnerability can be exploited remotely, making it a serious threat. Users of this system should apply the patch provided by the vendor or update to a secure version to protect against potential attacks.",
    "software": [
      "PHPGurukul Art Gallery Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2647",
    "description": "A vulnerability was found in PHPGurukul Art Gallery Management System 1.0. It has been rated as critical. Affected by this issue is some unknown functionality of the file /search.php. The manipulation of the argument Search leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This is a critical vulnerability in the PHPGurukul Art Gallery Management System 1.0 that allows for SQL injection through the search functionality. This can be exploited remotely and may lead to unauthorized access to the system. Users of this system should update to a patched version or take other measures to secure their data.",
    "software": [
      "PHPGurukul Art Gallery Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2648",
    "description": "A vulnerability classified as critical has been found in PHPGurukul Art Gallery Management System 1.0. This affects an unknown part of the file /admin/view-enquiry-detail.php. The manipulation of the argument viewid leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Art Gallery Management System 1.0 has a critical vulnerability that allows for SQL injection through manipulation of a specific file. This exploit can be initiated remotely and has been disclosed publicly. It is important for users to update to a patched version of the software to protect against potential attacks.",
    "software": [
      "PHPGurukul Art Gallery Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2649",
    "description": "A vulnerability classified as critical was found in PHPGurukul Doctor Appointment Management System 1.0. This vulnerability affects unknown code of the file /check-appointment.php. The manipulation of the argument searchdata leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Doctor Appointment Management System 1.0 has a critical vulnerability that allows for a remote SQL injection attack through the /check-appointment.php file. This can be exploited by manipulating the searchdata argument. It is important for users of this system to update to a patched version to prevent potential attacks.",
    "software": [
      "PHPGurukul Doctor Appointment Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2650",
    "description": "A vulnerability, which was classified as problematic, has been found in PHPGurukul Medical Card Generation System 1.0. This issue affects some unknown processing of the file /download-medical-cards.php. The manipulation of the argument searchdata leads to cross site scripting. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "A security flaw has been discovered in PHPGurukul Medical Card Generation System 1.0 that allows for cross site scripting through manipulation of a specific file. This vulnerability can be exploited remotely, putting users at risk of attacks. To protect against this threat, users should update to a patched version of the software as soon as possible.",
    "software": [
      "PHPGurukul Medical Card Generation System 1.0"
    ]
  },
  {
    "cve_id": "CVE-2025-0927",
    "description": "Attila Szász discovered that the HFS+ file system implementation in the Linux Kernel contained a heap overflow vulnerability. An attacker could use a specially crafted file system image that, when mounted, could cause a denial of service (system crash) or possibly execute arbitrary code.",
    "summary": "This vulnerability in the Linux Kernel's HFS+ file system could allow attackers to crash a system or execute malicious code by using a specially crafted file system image. Users of Linux systems utilizing the HFS+ file system should update their software to the latest version to protect against this threat.",
    "software": [
      "HFS+ file system",
      "Linux Kernel"
    ]
  },
  {
    "cve_id": "CVE-2025-27553",
    "description": "Relative Path Traversal vulnerability in Apache Commons VFS before 2.10.0.\n\nThe FileObject API in Commons VFS has a 'resolveFile' method that\ntakes a 'scope' parameter. Specifying 'NameScope.DESCENDENT' promises that \"an exception is thrown if the resolved file is not a descendent of\nthe base file\". However, when the path contains encoded \"..\"\ncharacters (for example, \"%2E%2E/bar.txt\"), it might return file objects that are not\na descendent of the base file, without throwing an exception.\nThis issue affects Apache Commons VFS: before 2.10.0.\n\nUsers are recommended to upgrade to version 2.10.0, which fixes the issue.",
    "summary": "There is a security vulnerability in Apache Commons VFS versions prior to 2.10.0 related to relative path traversal. This vulnerability allows attackers to access files outside of the intended directory. Users should upgrade to version 2.10.0 to fix this issue.",
    "software": [
      "Apache Commons VFS"
    ]
  },
  {
    "cve_id": "CVE-2025-2651",
    "description": "A vulnerability, which was classified as problematic, was found in SourceCodester Online Eyewear Shop 1.0. Affected is an unknown function of the file /oews/admin/. The manipulation leads to exposure of information through directory listing. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. It is recommended to change the configuration settings. Multiple sub-directories are affected.",
    "summary": "This vulnerability in the SourceCodester Online Eyewear Shop 1.0 allows attackers to access sensitive information through directory listing. This could be exploited remotely and poses a risk to those using the system. To mitigate the threat, users are advised to change their configuration settings to prevent unauthorized access to their data in the affected directories.",
    "software": [
      "SourceCodester Online Eyewear Shop 1.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2652",
    "description": "A vulnerability has been found in SourceCodester Employee and Visitor Gate Pass Logging System 1.0 and classified as problematic. Affected by this vulnerability is an unknown functionality. The manipulation leads to exposure of information through directory listing. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. It is recommended to change the configuration settings. Multiple sub-directories are affected.",
    "summary": "The SourceCodester Employee and Visitor Gate Pass Logging System 1.0 has a vulnerability that allows for the exposure of information through directory listing. This vulnerability can be exploited remotely, and the exploit has been made public. To protect against potential attacks, it is recommended to change the configuration settings of the system. Multiple sub-directories are affected by this vulnerability.",
    "software": [
      "SourceCodester Employee and Visitor Gate Pass Logging System 1.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2691",
    "description": "Versions of the package nossrf before 1.0.4 are vulnerable to Server-Side Request Forgery (SSRF) where an attacker can provide a hostname that resolves to a local or reserved IP address space and bypass the SSRF protection mechanism.",
    "summary": "This vulnerability in the package nossrf allows an attacker to send malicious requests from the server, potentially accessing sensitive data or services within the local network. Users of versions before 1.0.4 are affected. To mitigate this threat, users should update to version 1.0.4 or newer to prevent SSRF attacks.",
    "software": [
      "nossrf"
    ]
  },
  {
    "cve_id": "CVE-2025-30474",
    "description": "Exposure of Sensitive Information to an Unauthorized Actor vulnerability in Apache Commons VFS.\n\nThe FtpFileObject class can throw an exception when a file is not found, revealing the original URI in its message, which may include a password. The fix is to mask the password in the exception message\nThis issue affects Apache Commons VFS: before 2.10.0.\n\nUsers are recommended to upgrade to version 2.10.0, which fixes the issue.",
    "summary": "The vulnerability in Apache Commons VFS allows an unauthorized actor to access sensitive information, such as passwords, through an exception message when a file is not found. This affects versions of Apache Commons VFS before 2.10.0. Users should upgrade to version 2.10.0 to fix this issue and protect their sensitive information.",
    "software": [
      "Apache Commons VFS"
    ]
  },
  {
    "cve_id": "CVE-2025-2653",
    "description": "A vulnerability was found in FoxCMS 1.25 and classified as problematic. Affected by this issue is some unknown functionality. The manipulation leads to improper authorization. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The FoxCMS 1.25 software has a security flaw that allows for improper authorization, which could be exploited remotely. Users of this software should take immediate action to update to a secure version to prevent potential unauthorized access to their systems.",
    "software": [
      "FoxCMS 1.25"
    ]
  },
  {
    "cve_id": "CVE-2025-2654",
    "description": "A vulnerability was found in SourceCodester AC Repair and Services System 1.0. It has been classified as critical. This affects an unknown part of the file /admin/services/manage_service.php. The manipulation of the argument ID leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The SourceCodester AC Repair and Services System 1.0 has a critical vulnerability that allows for SQL injection through manipulation of the argument ID in the file manage_service.php. This can be exploited remotely, putting users at risk of unauthorized access to the system. Users should update their software to the latest version to protect against this threat.",
    "software": [
      "SourceCodester AC Repair and Services System 1.0"
    ]
  },
  {
    "cve_id": "CVE-2025-29795",
    "description": "Improper link resolution before file access ('link following') in Microsoft Edge (Chromium-based) allows an authorized attacker to elevate privileges locally.",
    "summary": "This vulnerability in Microsoft Edge allows a hacker with authorized access to gain higher levels of access on a device. This could affect users of Microsoft Edge who are targeted by attackers. To protect against this, users should ensure they have the latest security updates installed on their devices.",
    "software": [
      "Microsoft Edge"
    ]
  },
  {
    "cve_id": "CVE-2025-29806",
    "description": "No cwe for this issue in Microsoft Edge (Chromium-based) allows an unauthorized attacker to execute code over a network.",
    "summary": "This vulnerability in Microsoft Edge (Chromium-based) allows attackers to execute code over a network without authorization. This issue can affect users of Microsoft Edge, putting their data and systems at risk. Users should update their browser to the latest version to ensure they are protected from this threat.",
    "software": [
      "Microsoft Edge (Chromium-based)"
    ]
  },
  {
    "cve_id": "CVE-2025-2655",
    "description": "A vulnerability was found in SourceCodester AC Repair and Services System 1.0. It has been declared as critical. This vulnerability affects the function save_users of the file /classes/Users.php. The manipulation of the argument ID leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. Other parameters might be affected as well.",
    "summary": "This CVE describes a critical vulnerability found in the AC Repair and Services System software. This vulnerability can be exploited using SQL injection, allowing attackers to remotely take control of the system. Users of this software should update to the latest version to patch this vulnerability and protect their systems from potential attacks.",
    "software": [
      "SourceCodester AC Repair and Services System"
    ]
  },
  {
    "cve_id": "CVE-2025-2656",
    "description": "A vulnerability classified as critical has been found in PHPGurukul Zoo Management System 2.1. Affected is an unknown function of the file /admin/login.php. The manipulation of the argument Username leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This CVE is about a critical vulnerability found in PHPGurukul Zoo Management System 2.1. The vulnerability allows attackers to perform SQL injection by manipulating the username argument in the login page. This can be done remotely and the exploit has been disclosed publicly. Users of this system should update to a patched version or take measures to mitigate the risk of SQL injection attacks.",
    "software": [
      "PHPGurukul Zoo Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2657",
    "description": "A vulnerability classified as critical was found in projectworlds Apartment Visitors Management System 1.0. Affected by this vulnerability is an unknown functionality of the file /front.php. The manipulation of the argument rid leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in projectworlds Apartment Visitors Management System 1.0 allows for a remote attacker to perform a SQL injection attack by manipulating a specific file. This can potentially affect anyone using this system. Users should take immediate action to update to a patched version or implement other security measures to protect against this exploit.",
    "software": [
      "projectworlds Apartment Visitors Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2658",
    "description": "A vulnerability, which was classified as critical, has been found in PHPGurukul Online Security Guards Hiring System 1.0. Affected by this issue is some unknown functionality of the file /search-request.php. The manipulation of the argument searchdata leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This security vulnerability in PHPGurukul Online Security Guards Hiring System 1.0 allows for a remote attacker to launch a SQL injection attack by manipulating the searchdata argument in the /search-request.php file. Users of this system should take immediate action to mitigate this threat by applying the necessary patches or updates provided by the vendor.",
    "software": [
      "PHPGurukul Online Security Guards Hiring System"
    ]
  },
  {
    "cve_id": "CVE-2025-2659",
    "description": "A vulnerability, which was classified as critical, was found in Project Worlds Online Time Table Generator 1.0. This affects an unknown part of the file /student/index.php. The manipulation of the argument e leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This is a critical vulnerability in an online time table generator software that allows for SQL injection through a specific file. It can be exploited remotely, but the affected part of the software is unknown. Users of this software should update to a patched version to protect against potential attacks.",
    "software": [
      "Project Worlds Online Time Table Generator 1.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2660",
    "description": "A vulnerability has been found in Project Worlds Online Time Table Generator 1.0 and classified as critical. This vulnerability affects unknown code of the file /admin/index.php. The manipulation of the argument e leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in Project Worlds Online Time Table Generator 1.0 allows hackers to manipulate code in a way that could lead to a SQL injection attack. It can be done remotely and affects anyone using the software. To protect against this threat, users should update the software to a secure version as soon as possible.",
    "software": [
      "Project Worlds Online Time Table Generator 1.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2661",
    "description": "A vulnerability was found in Project Worlds Online Time Table Generator 1.0 and classified as critical. This issue affects some unknown processing of the file /staff/index.php. The manipulation of the argument e leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in Project Worlds Online Time Table Generator 1.0 allows hackers to inject malicious SQL commands through the file /staff/index.php, potentially gaining unauthorized access to sensitive data. It can be exploited remotely, and the details for carrying out the attack are publicly available. Users should update the software to the latest version or apply patches to protect against this threat.",
    "software": [
      "Project Worlds Online Time Table Generator 1.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2662",
    "description": "A vulnerability was found in Project Worlds Online Time Table Generator 1.0. It has been classified as critical. Affected is an unknown function of the file student/studentdashboard.php. The manipulation of the argument course leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in Project Worlds Online Time Table Generator 1.0 allows for a critical SQL injection attack through manipulation of the argument course in the file student/studentdashboard.php. This can be exploited remotely and poses a threat to users of this software. To mitigate this risk, users should update the software to a patched version and be cautious of potential attacks targeting this vulnerability.",
    "software": [
      "Project Worlds Online Time Table Generator"
    ]
  },
  {
    "cve_id": "CVE-2025-2663",
    "description": "A vulnerability has been found in PHPGurukul Bank Locker Management System 1.0 and classified as critical. Affected by this vulnerability is an unknown functionality of the file /search-locker-details.php. The manipulation of the argument searchinput leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "A critical vulnerability has been found in the PHPGurukul Bank Locker Management System. Hackers can exploit this vulnerability through a SQL injection attack by manipulating the searchinput argument in the /search-locker-details.php file. This can be done remotely, putting users at risk. Users of this system should take action immediately to update and secure their software to prevent potential attacks.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2664",
    "description": "A vulnerability was found in CodeZips Hospital Management System 1.0 and classified as critical. Affected by this issue is some unknown functionality of the file /suadpeted.php. The manipulation of the argument ID leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "There is a critical vulnerability in CodeZips Hospital Management System 1.0 that allows for SQL injection through the file /suadpeted.php. This can be exploited remotely, and the details of the exploit are public. Users of this system should take immediate action to patch this vulnerability to prevent unauthorized access to sensitive information.",
    "software": [
      "CodeZips Hospital Management System 1.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2665",
    "description": "A vulnerability was found in PHPGurukul Online Security Guards Hiring System 1.0. It has been classified as critical. This affects an unknown part of the file /admin/bwdates-reports-details.php. The manipulation of the argument fromdate/todate leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in a specific online security guard hiring system allows malicious hackers to manipulate a certain file and inject harmful code, potentially leading to a remote attack. It is classified as critical and affects users of the system. To protect against this threat, users should ensure their systems are updated with the latest security patches and monitor for any unusual activity.",
    "software": [
      "PHPGurukul Online Security Guards Hiring System"
    ]
  },
  {
    "cve_id": "CVE-2025-2671",
    "description": "A vulnerability was found in Yue Lao Blind Box 月老盲盒 up to 4.0. It has been declared as critical. This vulnerability affects the function base64image of the file /app/controller/Upload.php. The manipulation of the argument data leads to unrestricted upload. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The Yue Lao Blind Box 月老盲盒 app up to version 4.0 has a critical vulnerability that allows for unrestricted file uploads through manipulation of certain data. This vulnerability can be exploited remotely by attackers. Users of the app should update to a patched version as soon as possible to protect themselves from potential abuse of this vulnerability.",
    "software": [
      "Yue Lao Blind Box"
    ]
  },
  {
    "cve_id": "CVE-2018-25109",
    "description": "A vulnerability has been found in Nintendo Animal Crossing, Doubutsu no Mori+ and Doubutsu no Mori e+ 1.00/1.01 on GameCube and classified as critical. Affected by this vulnerability is an unknown functionality of the component Letter Trigram Handler. The manipulation leads to memory corruption. It is possible to launch the attack on the physical device. The complexity of an attack is rather high. The exploitation appears to be difficult. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in Nintendo Animal Crossing for GameCube can allow attackers to corrupt memory on the system, potentially leading to unauthorized access or other malicious activities. It is difficult to exploit, but the risk is still present. Users should be cautious and ensure their system is up to date with the latest security patches.",
    "software": [
      "Nintendo Animal Crossing",
      "Doubutsu no Mori+",
      "Doubutsu no Mori e+"
    ]
  },
  {
    "cve_id": "CVE-2025-2672",
    "description": "A vulnerability was found in code-projects Payroll Management System 1.0. It has been rated as critical. This issue affects some unknown processing of the file /add_deductions.php. The manipulation of the argument bir leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. Other parameters might be affected as well.",
    "summary": "This vulnerability in the Payroll Management System 1.0 software could allow attackers to remotely inject malicious code through the file /add_deductions.php, potentially leading to a SQL injection attack. This vulnerability is rated as critical and could affect users of the system. Users should update their software to the latest version or apply any patches provided by the vendor to mitigate the risk of exploitation.",
    "software": [
      "Payroll Management System 1.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2673",
    "description": "A vulnerability classified as problematic has been found in code-projects Payroll Management System 1.0. Affected is an unknown function of the file /home_employee.php. The manipulation of the argument division leads to cross site scripting. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. Other parameters might be affected as well.",
    "summary": "This vulnerability in the Payroll Management System 1.0 allows attackers to remotely launch a cross-site scripting attack by manipulating certain arguments in the /home_employee.php file. This could potentially impact anyone using this system. It is recommended to take immediate action to update the code and patch this vulnerability to mitigate the risk of exploitation.",
    "software": [
      "code-projects Payroll Management System 1.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2674",
    "description": "A vulnerability classified as critical was found in PHPGurukul Bank Locker Management System 1.0. Affected by this vulnerability is an unknown functionality of the file /aboutus.php. The manipulation of the argument pagetitle leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul Bank Locker Management System allows hackers to remotely launch a SQL injection attack by manipulating a specific file. This could affect any organization using this system. To protect against this threat, it is recommended to update the system to a secure version and implement proper security measures.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2675",
    "description": "A vulnerability, which was classified as critical, has been found in PHPGurukul Bank Locker Management System 1.0. Affected by this issue is some unknown functionality of the file /add-lockertype.php. The manipulation of the argument lockerprice leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability found in PHPGurukul Bank Locker Management System 1.0 allows hackers to execute a remote SQL injection attack by manipulating a specific file. This could potentially affect anyone using this system. It is important to take immediate action to patch or update the system to prevent unauthorized access to sensitive information.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2676",
    "description": "A vulnerability, which was classified as critical, was found in PHPGurukul Bank Locker Management System 1.0. This affects an unknown part of the file /add-subadmin.php. The manipulation of the argument sadminusername leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Bank Locker Management System version 1.0 has a critical vulnerability that allows for SQL injection through the /add-subadmin.php file. This vulnerability can be exploited remotely by manipulating the sadminusername argument. This could affect anyone using this system. It is important to update the system to a secure version or patch to prevent attacks.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2677",
    "description": "A vulnerability has been found in PHPGurukul Bank Locker Management System 1.0 and classified as critical. This vulnerability affects unknown code of the file /changeidproof.php. The manipulation of the argument editid leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in the PHPGurukul Bank Locker Management System allows remote attackers to inject SQL commands through a specific file, potentially gaining unauthorized access to sensitive information. Users of this system should update to a secure version to protect against this threat.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2678",
    "description": "A vulnerability was found in PHPGurukul Bank Locker Management System 1.0 and classified as critical. This issue affects some unknown processing of the file /changeimage1.php. The manipulation of the argument editid leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in the PHPGurukul Bank Locker Management System allows for remote attackers to execute a SQL injection attack by manipulating a specific file. This security flaw could affect anyone using version 1.0 of the system. Users should update to a patched version to protect against potential attacks.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2679",
    "description": "A vulnerability was found in PHPGurukul Bank Locker Management System 1.0. It has been classified as critical. Affected is an unknown function of the file /contact-us.php. The manipulation of the argument pagetitle leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability found in PHPGurukul Bank Locker Management System 1.0 allows attackers to carry out SQL injection attacks remotely through the /contact-us.php file. This can impact anyone using this system. To mitigate the risk, users should immediately update to a patched version of the software.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2680",
    "description": "A vulnerability was found in PHPGurukul Bank Locker Management System 1.0. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file /edit-assign-locker.php?ltid=1. The manipulation of the argument mobilenumber leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Bank Locker Management System 1.0 has a critical vulnerability that could allow attackers to inject SQL code through manipulation of the mobilenumber argument in the file /edit-assign-locker.php?ltid=1. This could be exploited remotely by an attacker. Users of this system should update to a patched version as soon as possible to prevent exploitation of this vulnerability.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2681",
    "description": "A vulnerability was found in PHPGurukul Bank Locker Management System 1.0. It has been rated as critical. Affected by this issue is some unknown functionality of the file /edit-locker.php?ltid=6. The manipulation of the argument lockersize leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul Bank Locker Management System 1.0 allows for a remote attacker to launch a SQL injection attack through manipulation of the lockersize argument in the URL. This could potentially affect users of the system and their data. To mitigate this threat, it is recommended to update the software to a patched version if available, or to implement other security measures to prevent unauthorized access.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2682",
    "description": "A vulnerability classified as critical has been found in PHPGurukul Bank Locker Management System 1.0. This affects an unknown part of the file /edit-subadmin.php?said=3. The manipulation of the argument mobilenumber leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "There is a critical vulnerability in PHPGurukul Bank Locker Management System 1.0 that allows for remote attackers to conduct SQL injection attacks by manipulating the \"mobilenumber\" argument in the file /edit-subadmin.php?said=3. This vulnerability has been disclosed publicly and can affect users of this system. Users should take immediate action to update the software or apply any available patches to mitigate this risk.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2683",
    "description": "A vulnerability classified as critical was found in PHPGurukul Bank Locker Management System 1.0. This vulnerability affects unknown code of the file /profile.php. The manipulation of the argument mobilenumber leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in the PHPGurukul Bank Locker Management System could allow an attacker to conduct a SQL injection attack by manipulating a specific argument. This threat can be initiated from a remote location and has been made public. Users of this system should take immediate action to update their software to protect against potential attacks.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2684",
    "description": "A vulnerability, which was classified as critical, has been found in PHPGurukul Bank Locker Management System 1.0. This issue affects some unknown processing of the file /search-report-details.php. The manipulation of the argument searchinput leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "A critical vulnerability has been discovered in PHPGurukul Bank Locker Management System 1.0, which could allow attackers to conduct SQL injection attacks by manipulating a specific file. This vulnerability may be exploited remotely and has been publicly disclosed. Users of this system should take immediate action to update or patch the software to prevent potential attacks.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2024-10558",
    "description": "The Form Maker by 10Web  WordPress plugin before 1.15.30 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "A vulnerability in the Form Maker by 10Web WordPress plugin allows high privilege users to perform Stored Cross-Site Scripting attacks, even when certain permissions are restricted. This affects users of the plugin, particularly in multisite setups. Users should update to version 1.15.30 to patch this vulnerability.",
    "software": [
      "Form Maker by 10Web"
    ]
  },
  {
    "cve_id": "CVE-2024-13124",
    "description": "The Photo Gallery by 10Web  WordPress plugin before 1.8.33 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Photo Gallery by 10Web WordPress plugin allows high privilege users, like admins, to execute harmful scripts on the website. This could affect any website using the plugin, particularly in a multisite setup. Users should update to version 1.8.33 or later to protect against this threat.",
    "software": [
      "Photo Gallery by 10Web"
    ]
  },
  {
    "cve_id": "CVE-2025-1062",
    "description": "The Slider, Gallery, and Carousel by MetaSlider  WordPress plugin before 3.95.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Slider, Gallery, and Carousel by MetaSlider WordPress plugin before version 3.95.0 is vulnerable to Stored Cross-Site Scripting attacks. This could allow high privilege users, like admins, to insert malicious code into the plugin settings, potentially impacting websites even when some security measures are in place. Users should update to version 3.95.0 or higher to protect against this vulnerability.",
    "software": [
      "Slider, Gallery, and Carousel by MetaSlider"
    ]
  },
  {
    "cve_id": "CVE-2025-1203",
    "description": "The Slider, Gallery, and Carousel by MetaSlider  WordPress plugin before 3.95.0 does not sanitise and escape some of its settings, which could allow high privilege users such as editor to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This CVE affects the Slider, Gallery, and Carousel by MetaSlider WordPress plugin prior to version 3.95.0. It allows high privilege users, like editors, to execute Stored Cross-Site Scripting attacks even if they do not have permission to use unfiltered_html capability. To mitigate this threat, users should update the plugin to version 3.95.0 or later.",
    "software": [
      "MetaSlider WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-2686",
    "description": "A vulnerability has been found in mingyuefusu 明月复苏 tushuguanlixitong 图书管理系统 up to d4836f6b49cd0ac79a4021b15ce99ff7229d4694 and classified as critical. Affected by this vulnerability is the function doFilter of the file /admin/ of the component Backend. The manipulation of the argument Request leads to improper access controls. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability, found in the mingyuefusu library management system, allows remote attackers to access unauthorized information through manipulation of a specific function. It is classified as critical and affects versions up to d4836f6b49cd0ac79a4021b15ce99ff7229d4694. Users of this system should update to a secure version to protect against potential attacks.",
    "software": [
      "mingyuefusu 明月复苏",
      "tushuguanlixitong 图书管理系统"
    ]
  },
  {
    "cve_id": "CVE-2025-2687",
    "description": "A vulnerability classified as critical has been found in PHPGurukul eLearning System 1.0. Affected is an unknown function of the file /user/index.php of the component Image Handler. The manipulation leads to unrestricted upload. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul eLearning System allows for unrestricted file uploads through the Image Handler component, which can be exploited remotely. This affects users of the system and could lead to unauthorized access or other malicious activities. Users should update to a patched version of the software to prevent exploitation.",
    "software": [
      "PHPGurukul eLearning System",
      "Image Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2688",
    "description": "A vulnerability classified as problematic was found in TOTOLINK A3000RU up to 5.9c.5185. Affected by this vulnerability is an unknown functionality of the file /cgi-bin/ExportSyslog.sh of the component Syslog Configuration File Handler. The manipulation leads to improper access controls. The attack needs to be done within the local network. The exploit has been disclosed to the public and may be used.",
    "summary": "This is a vulnerability found in TOTOLINK A3000RU routers that allows for improper access controls through the manipulation of a specific file. The threat affects users within the local network. To protect against this vulnerability, users should update their router firmware to the latest version provided by TOTOLINK.",
    "software": [
      "TOTOLINK A3000RU",
      "Syslog Configuration File Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2689",
    "description": "A vulnerability, which was classified as critical, has been found in yiisoft Yii2 up to 2.0.45. Affected by this issue is the function getIterator of the file symfony\\finder\\Iterator\\SortableIterator.php. The manipulation leads to deserialization. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This is a critical vulnerability found in the yiisoft Yii2 software up to version 2.0.45. It affects the getIterator function in the file SortableIterator.php, allowing for remote attackers to launch a deserialization attack. This exploit has been made public and can be used by malicious actors. Users of this software should update to a patched version to protect against this threat.",
    "software": [
      "yiisoft Yii2",
      "symfony\finder\\Iterator\\SortableIterator.php"
    ]
  },
  {
    "cve_id": "CVE-2025-2690",
    "description": "A vulnerability, which was classified as critical, was found in yiisoft Yii2 up to 2.0.39. This affects the function Generate of the file phpunit\\src\\Framework\\MockObject\\MockClass.php. The manipulation leads to deserialization. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability found in Yii2 up to version 2.0.39 allows attackers to execute code remotely through manipulation of the Yii2 framework's MockClass.php file. This poses a critical threat to users of Yii2. It is recommended that users update to a patched version of Yii2 to protect against this vulnerability.",
    "software": [
      "yiisoft Yii2",
      "phpunit"
    ]
  },
  {
    "cve_id": "CVE-2025-2699",
    "description": "A vulnerability was found in GetmeUK ContentTools up to 1.6.16. It has been rated as problematic. Affected by this issue is some unknown functionality of the component Image Handler. The manipulation of the argument onload leads to cross site scripting. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in GetmeUK ContentTools up to version 1.6.16 allows for cross-site scripting attacks through manipulation of the Image Handler component. This could be exploited remotely by attackers. Users of this software should update to a patched version or consider alternative solutions to protect against potential attacks. The vendor has been made aware of the issue but has not responded to address it.",
    "software": [
      "GetmeUK ContentTools",
      "Image Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2700",
    "description": "A vulnerability classified as problematic has been found in michelson Dante Editor up to 0.4.4. This affects an unknown part of the component Insert Link Handler. The manipulation leads to cross site scripting. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in michelson Dante Editor allows for cross site scripting attacks, which could be initiated remotely. It affects users of the software up to version 0.4.4. To stay safe, users should update to the latest version or consider alternative software until a patch is released. It is concerning that the vendor has not responded to this issue, so users should be cautious and proactive in protecting their systems.",
    "software": [
      "michelson Dante Editor"
    ]
  },
  {
    "cve_id": "CVE-2025-2701",
    "description": "A vulnerability classified as critical was found in AMTT Hotel Broadband Operation System 1.0. This vulnerability affects the function popen of the file /manager/network/port_setup.php. The manipulation of the argument SwitchVersion/SwitchWrite/SwitchIP/SwitchIndex/SwitchState leads to os command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in the AMTT Hotel Broadband Operation System allows attackers to remotely execute commands on the system by manipulating certain arguments. It is critical and affects users of this system. Users should take immediate action to mitigate this threat, as the vendor has not responded to the disclosure.",
    "software": [
      "AMTT Hotel Broadband Operation System"
    ]
  },
  {
    "cve_id": "CVE-2025-2702",
    "description": "A vulnerability, which was classified as critical, has been found in Softwin WMX3 3.1. This issue affects the function ImageAdd of the file /ImageAdd.ashx. The manipulation of the argument File leads to unrestricted upload. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The Softwin WMX3 3.1 software has a critical vulnerability that allows for unrestricted upload and remote attacks. This affects anyone using this software. Users should be aware of this threat and take precautions to protect their systems, such as updating to a secure version of the software or implementing other security measures.",
    "software": [
      "Softwin WMX3 3.1"
    ]
  }
]