[
  {
    "cve_id": "CVE-2025-2673",
    "description": "A vulnerability classified as problematic has been found in code-projects Payroll Management System 1.0. Affected is an unknown function of the file /home_employee.php. The manipulation of the argument division leads to cross site scripting. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. Other parameters might be affected as well.",
    "summary": "This vulnerability in the Payroll Management System 1.0 allows for a cross-site scripting attack to be launched remotely through the /home_employee.php file. This could affect various parameters in the system. Users of this code-project should take immediate action to update their system to patch this vulnerability and protect against potential attacks.",
    "software": [
      "Payroll Management System 1.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2674",
    "description": "A vulnerability classified as critical was found in PHPGurukul Bank Locker Management System 1.0. Affected by this vulnerability is an unknown functionality of the file /aboutus.php. The manipulation of the argument pagetitle leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul Bank Locker Management System 1.0 allows attackers to remotely launch a SQL injection attack by manipulating the argument pagetitle in the /aboutus.php file. This vulnerability can affect anyone using this system. To mitigate this threat, users should apply the latest security patches and updates provided by the system developers.",
    "software": [
      "PHPGurukul Bank Locker Management System 1.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2675",
    "description": "A vulnerability, which was classified as critical, has been found in PHPGurukul Bank Locker Management System 1.0. Affected by this issue is some unknown functionality of the file /add-lockertype.php. The manipulation of the argument lockerprice leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Bank Locker Management System 1.0 has a critical vulnerability that could allow attackers to remotely launch a SQL injection attack by manipulating a specific file. Users of this system should immediately update to a patched version to protect their data and prevent unauthorized access.",
    "software": [
      "PHPGurukul Bank Locker Management System 1.0",
      "/add-lockertype.php"
    ]
  },
  {
    "cve_id": "CVE-2025-2676",
    "description": "A vulnerability, which was classified as critical, was found in PHPGurukul Bank Locker Management System 1.0. This affects an unknown part of the file /add-subadmin.php. The manipulation of the argument sadminusername leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Bank Locker Management System 1.0 has a critical vulnerability that allows for SQL injection through the argument sadminusername in the file /add-subadmin.php. This vulnerability can be exploited remotely, so users of this system should take immediate action to patch or update their software to prevent potential attacks.",
    "software": [
      "PHPGurukul Bank Locker Management System 1.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2677",
    "description": "A vulnerability has been found in PHPGurukul Bank Locker Management System 1.0 and classified as critical. This vulnerability affects unknown code of the file /changeidproof.php. The manipulation of the argument editid leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This CVE is about a critical vulnerability in PHPGurukul Bank Locker Management System 1.0 that can be exploited by manipulating the editid argument in the /changeidproof.php file to perform a SQL injection attack. Anyone using this system is at risk, as the attack can be done remotely. To mitigate this threat, users should update the software to a version that has patched this vulnerability.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2678",
    "description": "A vulnerability was found in PHPGurukul Bank Locker Management System 1.0 and classified as critical. This issue affects some unknown processing of the file /changeimage1.php. The manipulation of the argument editid leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul Bank Locker Management System 1.0 allows for a potential attack known as SQL injection, which can be initiated remotely. It is important for users of this system to take immediate action to patch or update the software to protect against potential exploits.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2679",
    "description": "A vulnerability was found in PHPGurukul Bank Locker Management System 1.0. It has been classified as critical. Affected is an unknown function of the file /contact-us.php. The manipulation of the argument pagetitle leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This CVE is a critical vulnerability in the PHPGurukul Bank Locker Management System 1.0, which allows for SQL injection through manipulation of a certain function in the contact-us.php file. This vulnerability can be exploited remotely and could potentially be used by attackers. Users should take immediate action to update or patch their systems to prevent exploitation.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2680",
    "description": "A vulnerability was found in PHPGurukul Bank Locker Management System 1.0. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file /edit-assign-locker.php?ltid=1. The manipulation of the argument mobilenumber leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This CVE is about a critical vulnerability in the PHPGurukul Bank Locker Management System 1.0, where an attacker can manipulate a specific file to perform a SQL injection attack using the argument mobilenumber. This vulnerability can be exploited remotely. Users of this system should apply the necessary security patches provided by the vendor to prevent exploitation.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2681",
    "description": "A vulnerability was found in PHPGurukul Bank Locker Management System 1.0. It has been rated as critical. Affected by this issue is some unknown functionality of the file /edit-locker.php?ltid=6. The manipulation of the argument lockersize leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Bank Locker Management System 1.0 has a critical vulnerability that allows for SQL injection through the /edit-locker.php file. This vulnerability can be exploited remotely, but the specific impact and affected users are unknown. Users should update their software or implement security patches to protect against potential attacks.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2682",
    "description": "A vulnerability classified as critical has been found in PHPGurukul Bank Locker Management System 1.0. This affects an unknown part of the file /edit-subadmin.php?said=3. The manipulation of the argument mobilenumber leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul Bank Locker Management System 1.0 allows for a SQL injection attack by manipulating a specific argument in the system. This could be exploited remotely, and the attack has been disclosed publicly. Users should update their system to the latest version or apply any patches released by the software provider to protect against this threat.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2683",
    "description": "A vulnerability classified as critical was found in PHPGurukul Bank Locker Management System 1.0. This vulnerability affects unknown code of the file /profile.php. The manipulation of the argument mobilenumber leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Bank Locker Management System 1.0 has a critical vulnerability in its profile.php file that allows attackers to perform SQL injection through manipulation of the mobilenumber argument. This vulnerability can be exploited remotely, and the details of the exploit are now public. Users of this system should immediately update to a patched version to protect against potential attacks.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2684",
    "description": "A vulnerability, which was classified as critical, has been found in PHPGurukul Bank Locker Management System 1.0. This issue affects some unknown processing of the file /search-report-details.php. The manipulation of the argument searchinput leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Bank Locker Management System 1.0 has a critical vulnerability that allows attackers to inject SQL code through the search-input argument in the search-report-details.php file. This could potentially be exploited remotely. Users of this system should take immediate action to patch or update the software to prevent any potential security breaches.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2024-10558",
    "description": "The Form Maker by 10Web  WordPress plugin before 1.15.30 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Form Maker by 10Web WordPress plugin has a vulnerability that allows high privilege users, like admin, to perform Stored Cross-Site Scripting attacks. This affects users of the plugin, particularly in multisite setups. To protect against this threat, users should update to version 1.15.30 or higher of the plugin.",
    "software": [
      "Form Maker by 10Web"
    ]
  },
  {
    "cve_id": "CVE-2024-13124",
    "description": "The Photo Gallery by 10Web  WordPress plugin before 1.8.33 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Photo Gallery by 10Web WordPress plugin allows high privilege users to perform Stored Cross-Site Scripting attacks, even if certain security measures are in place. This could affect users of the plugin, particularly in multisite setups. To mitigate this risk, users should update the plugin to version 1.8.33 or newer.",
    "software": [
      "Photo Gallery by 10Web"
    ]
  },
  {
    "cve_id": "CVE-2025-1062",
    "description": "The Slider, Gallery, and Carousel by MetaSlider  WordPress plugin before 3.95.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Slider, Gallery, and Carousel by MetaSlider WordPress plugin before version 3.95.0 is vulnerable to Stored Cross-Site Scripting attacks. This could potentially allow high privilege users, like admins, to inject malicious code into the plugin settings, putting the website at risk. Users of this plugin should update to version 3.95.0 or newer to protect against this threat.",
    "software": [
      "MetaSlider WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1203",
    "description": "The Slider, Gallery, and Carousel by MetaSlider  WordPress plugin before 3.95.0 does not sanitise and escape some of its settings, which could allow high privilege users such as editor to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Slider, Gallery, and Carousel by MetaSlider WordPress plugin has a vulnerability that could allow high privilege users, like editors, to execute malicious code on a website, even if certain security measures are in place. This could impact websites using the plugin before version 3.95.0. Users should update to the latest version of the plugin to protect against this threat.",
    "software": [
      "Slider, Gallery, and Carousel by MetaSlider WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-2686",
    "description": "A vulnerability has been found in mingyuefusu 明月复苏 tushuguanlixitong 图书管理系统 up to d4836f6b49cd0ac79a4021b15ce99ff7229d4694 and classified as critical. Affected by this vulnerability is the function doFilter of the file /admin/ of the component Backend. The manipulation of the argument Request leads to improper access controls. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in mingyuefusu library management system allows remote attackers to improperly access controls through the manipulation of the argument request in the backend component. Users of this system are advised to update to the latest version to patch this critical vulnerability and prevent exploitation.",
    "software": [
      "mingyuefusu 明月复苏 tushuguanlixitong 图书管理系统"
    ]
  },
  {
    "cve_id": "CVE-2025-2687",
    "description": "A vulnerability classified as critical has been found in PHPGurukul eLearning System 1.0. Affected is an unknown function of the file /user/index.php of the component Image Handler. The manipulation leads to unrestricted upload. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul eLearning System allows for unrestricted file uploads through the Image Handler component, potentially granting remote attackers unauthorized access. Users of this software should take immediate action to mitigate this risk, such as applying a security patch or updating to a version without this flaw.",
    "software": [
      "PHPGurukul eLearning System",
      "Image Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2688",
    "description": "A vulnerability classified as problematic was found in TOTOLINK A3000RU up to 5.9c.5185. Affected by this vulnerability is an unknown functionality of the file /cgi-bin/ExportSyslog.sh of the component Syslog Configuration File Handler. The manipulation leads to improper access controls. The attack needs to be done within the local network. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in TOTOLINK A3000RU routers allows for unauthorized access to system files through manipulation of the Syslog Configuration File Handler. This can only be exploited by someone within the local network. Users should update their router's firmware to the latest version to protect against this vulnerability.",
    "software": [
      "TOTOLINK A3000RU",
      "Syslog Configuration File Handler",
      "/cgi-bin/ExportSyslog.sh"
    ]
  },
  {
    "cve_id": "CVE-2025-2689",
    "description": "A vulnerability, which was classified as critical, has been found in yiisoft Yii2 up to 2.0.45. Affected by this issue is the function getIterator of the file symfony\\finder\\Iterator\\SortableIterator.php. The manipulation leads to deserialization. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This is a critical vulnerability found in the Yii2 framework, which can be exploited remotely by manipulating a specific function in the code. This could lead to deserialization of data and potential attacks. Users of Yii2 up to version 2.0.45 should take action to update their software to a secure version to prevent any potential attacks.",
    "software": [
      "yiisoft Yii2"
    ]
  },
  {
    "cve_id": "CVE-2025-2690",
    "description": "A vulnerability, which was classified as critical, was found in yiisoft Yii2 up to 2.0.39. This affects the function Generate of the file phpunit\\src\\Framework\\MockObject\\MockClass.php. The manipulation leads to deserialization. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "There is a critical vulnerability found in yiisoft Yii2 up to version 2.0.39 that allows for remote attacks through deserialization. This vulnerability affects anyone using this specific version of Yii2. Users should update to the latest version to protect against potential attacks exploiting this vulnerability.",
    "software": [
      "yiisoft Yii2",
      "phpunit"
    ]
  },
  {
    "cve_id": "CVE-2025-2699",
    "description": "A vulnerability was found in GetmeUK ContentTools up to 1.6.16. It has been rated as problematic. Affected by this issue is some unknown functionality of the component Image Handler. The manipulation of the argument onload leads to cross site scripting. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This CVE describes a vulnerability in the GetmeUK ContentTools up to version 1.6.16 that allows for a cross-site scripting attack. This vulnerability affects users of the Image Handler component. The exploit can be launched remotely and has been disclosed to the public. It is recommended to update to the latest version of GetmeUK ContentTools to protect against this vulnerability.",
    "software": [
      "GetmeUK ContentTools",
      "Image Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2700",
    "description": "A vulnerability classified as problematic has been found in michelson Dante Editor up to 0.4.4. This affects an unknown part of the component Insert Link Handler. The manipulation leads to cross site scripting. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The michelson Dante Editor up to version 0.4.4 has a vulnerability in the Insert Link Handler component that can be exploited for cross-site scripting attacks. This vulnerability can be exploited remotely, and the disclosure has been made public. Users of this editor should update to a secure version and be cautious of any suspicious links or content. The vendor has not responded to the disclosure, so users should take action to protect themselves.",
    "software": [
      "michelson Dante Editor"
    ]
  },
  {
    "cve_id": "CVE-2025-2701",
    "description": "A vulnerability classified as critical was found in AMTT Hotel Broadband Operation System 1.0. This vulnerability affects the function popen of the file /manager/network/port_setup.php. The manipulation of the argument SwitchVersion/SwitchWrite/SwitchIP/SwitchIndex/SwitchState leads to os command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This critical vulnerability in the AMTT Hotel Broadband Operation System 1.0 allows remote attackers to inject and execute malicious operating system commands. It affects anyone using the system and could be exploited by hackers. It's important for users to take action by updating their systems immediately to protect against potential attacks. The vendor has been unresponsive to reports of this vulnerability.",
    "software": [
      "AMTT Hotel Broadband Operation System"
    ]
  },
  {
    "cve_id": "CVE-2025-2702",
    "description": "A vulnerability, which was classified as critical, has been found in Softwin WMX3 3.1. This issue affects the function ImageAdd of the file /ImageAdd.ashx. The manipulation of the argument File leads to unrestricted upload. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The critical vulnerability found in Softwin WMX3 3.1 allows for unrestricted upload of files through manipulation of the File argument in the ImageAdd function. This vulnerability can be exploited remotely. Users of Softwin WMX3 3.1 should take immediate action to mitigate the risk, such as implementing security patches or updates if available, and contacting the vendor for further information on resolving the issue.",
    "software": [
      "Softwin WMX3 3.1"
    ]
  },
  {
    "cve_id": "CVE-2025-0478",
    "description": "Software installed and run as a non-privileged user may conduct improper GPU system calls to issue reads and writes to arbitrary physical memory pages.\n\nUnder certain circumstances this exploit could be used to corrupt data pages not allocated by the GPU driver but memory pages in use by the kernel and drivers running on the platform, altering their behaviour.",
    "summary": "This vulnerability allows malicious software running as a regular user to access and modify data in the computer's memory, potentially causing the system to behave unexpectedly. It affects users who run software with GPU capabilities. To protect against this, users should update their software and operating systems to patch the vulnerability.",
    "software": [
      "GPU driver"
    ]
  },
  {
    "cve_id": "CVE-2025-0835",
    "description": "Software installed and run as a non-privileged user may conduct improper GPU system calls to corrupt kernel heap memory.",
    "summary": "This vulnerability allows software run by a non-privileged user to corrupt kernel heap memory through improper GPU system calls. This could potentially affect any system with a GPU. To mitigate the risk, users should ensure they are running the latest updates and patches for their operating system and GPU drivers.",
    "software": [
      "GPU system calls"
    ]
  },
  {
    "cve_id": "CVE-2024-8773",
    "description": "SIMPLE.ERP client is vulnerable to MS SQL protocol downgrade request from a server side, what could lead to an unencrypted communication vulnerable to data interception and modification.\n\nThis issue affect SIMPLE.ERP from 6.20 to 6.30. Only the 6.30 version received a patch 6.30@a03.9, which make it possible for an administrator to enforce encrypted communication. Versions 6.20 and 6.25 remain unpatched.",
    "summary": "The vulnerability in SIMPLE.ERP client allows for unencrypted communication that is susceptible to data interception and modification. This affects versions 6.20 to 6.30, with only version 6.30 receiving a patch to enforce encrypted communication. Users of versions 6.20 and 6.25 should take action to update to the patched version to protect their data.",
    "software": [
      "SIMPLE.ERP"
    ]
  },
  {
    "cve_id": "CVE-2024-8774",
    "description": "The SIMPLE.ERP client stores superuser password in a recoverable format, allowing any authenticated SIMPLE.ERP user to escalate privileges to a database administrator.\n\nThis issue affect SIMPLE.ERP from 6.20 through 6.30. Only the 6.30 version received a patch 6.30@a03.9, which removed the vulnerability. Versions 6.20 and 6.25 remain unpatched.",
    "summary": "A vulnerability in SIMPLE.ERP allows any authenticated user to access the superuser password and escalate their privileges to a database administrator. This affects versions 6.20 through 6.30, but only version 6.30 has a patch available to fix the issue. Users of versions 6.20 and 6.25 should take action to secure their systems and consider upgrading to the patched version.",
    "software": [
      "SIMPLE.ERP"
    ]
  },
  {
    "cve_id": "CVE-2025-30521",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in giangmd93 GP Back To Top allows Cross Site Request Forgery. This issue affects GP Back To Top: from n/a through 3.0.",
    "summary": "This vulnerability in GP Back To Top could allow attackers to perform unauthorized actions on behalf of a user. It affects versions up to 3.0. Users should update to the latest version of GP Back To Top to protect against this threat.",
    "software": [
      "GP Back To Top"
    ]
  },
  {
    "cve_id": "CVE-2025-30522",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Damian Orzol Contact Form 7 Material Design allows Stored XSS. This issue affects Contact Form 7 Material Design: from n/a through 1.0.0.",
    "summary": "This vulnerability in Damian Orzol Contact Form 7 Material Design allows attackers to execute malicious scripts through a forged request, potentially leading to unauthorized actions being taken on behalf of the user. Users of Contact Form 7 Material Design version n/a through 1.0.0 are affected. To mitigate this threat, users should update to the latest version of the plugin as soon as possible.",
    "software": [
      "Damian Orzol Contact Form 7 Material Design"
    ]
  },
  {
    "cve_id": "CVE-2025-30523",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Marcel-NL Super Simple Subscriptions allows SQL Injection. This issue affects Super Simple Subscriptions: from n/a through 1.1.0.",
    "summary": "A vulnerability in Marcel-NL Super Simple Subscriptions allows attackers to inject malicious code into the database through SQL commands. This affects all versions of Super Simple Subscriptions up to 1.1.0. Users should update to the latest version to protect against this threat.",
    "software": [
      "Marcel-NL Super Simple Subscriptions"
    ]
  },
  {
    "cve_id": "CVE-2025-30525",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in ProfitShare.ro WP Profitshare allows SQL Injection. This issue affects WP Profitshare: from n/a through 1.4.9.",
    "summary": "This vulnerability in ProfitShare.ro WP Profitshare allows attackers to use SQL Injection to access and manipulate a website's database. It affects WP Profitshare versions from n/a through 1.4.9. Website owners should update to the latest version of WP Profitshare to protect against this threat.",
    "software": [
      "ProfitShare.ro WP Profitshare"
    ]
  },
  {
    "cve_id": "CVE-2025-30526",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in lucksy Typekit plugin for WordPress allows Cross Site Request Forgery. This issue affects Typekit plugin for WordPress: from n/a through 1.2.3.",
    "summary": "This vulnerability in the lucksy Typekit plugin for WordPress allows attackers to perform Cross-Site Request Forgery attacks. This could potentially affect users of the Typekit plugin for WordPress versions n/a through 1.2.3. Users should update the plugin to the latest version to protect against this threat.",
    "software": [
      "lucksy Typekit plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-30527",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in codetoolbox My Bootstrap Menu allows Stored XSS. This issue affects My Bootstrap Menu: from n/a through 1.2.1.",
    "summary": "This vulnerability in the codetoolbox My Bootstrap Menu software allows for a form of cyber attack called 'Cross-site Scripting', where malicious code can be injected into web pages. It affects versions of My Bootstrap Menu from n/a through 1.2.1. Users should update to a patched version of the software to mitigate the risk of exploitation.",
    "software": [
      "My Bootstrap Menu"
    ]
  },
  {
    "cve_id": "CVE-2025-30528",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in wpshopee Awesome Logos allows SQL Injection. This issue affects Awesome Logos: from n/a through 1.2.",
    "summary": "This vulnerability in wpshopee Awesome Logos allows attackers to execute SQL Injection attacks using Cross-Site Request Forgery. It affects users of Awesome Logos versions from n/a through 1.2. To stay safe, users should update the plugin to the latest version as soon as possible.",
    "software": [
      "wpshopee Awesome Logos"
    ]
  },
  {
    "cve_id": "CVE-2025-30529",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Sébastien Dumont Auto Load Next Post allows Cross Site Request Forgery. This issue affects Auto Load Next Post: from n/a through 1.5.14.",
    "summary": "A Cross-Site Request Forgery (CSRF) vulnerability in Sébastien Dumont Auto Load Next Post allows attackers to execute unauthorized actions on behalf of a user. This vulnerability affects Auto Load Next Post versions from n/a through 1.5.14. Users should update to the latest version of the plugin to protect against this security threat.",
    "software": [
      "Auto Load Next Post"
    ]
  },
  {
    "cve_id": "CVE-2025-30530",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Atikul AI Preloader allows Stored XSS. This issue affects AI Preloader: from n/a through 1.0.2.",
    "summary": "This vulnerability in Atikul AI Preloader allows attackers to inject harmful scripts into web pages, potentially compromising the security of users who visit those pages. This affects AI Preloader versions from n/a through 1.0.2. Users should update to the latest version of AI Preloader to mitigate the risk of attack.",
    "software": [
      "Atikul AI Preloader"
    ]
  },
  {
    "cve_id": "CVE-2025-30531",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in GBS Developer WP Ride Booking allows Cross Site Request Forgery. This issue affects WP Ride Booking: from n/a through 2.4.",
    "summary": "This vulnerability in GBS Developer WP Ride Booking allows attackers to conduct Cross-Site Request Forgery attacks. This issue affects WP Ride Booking versions from n/a through 2.4. Users of this plugin should update to the latest version to protect against potential attacks.",
    "software": [
      "GBS Developer WP Ride Booking",
      "WP Ride Booking"
    ]
  },
  {
    "cve_id": "CVE-2025-30532",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in MorganF Weather Layer allows Stored XSS. This issue affects Weather Layer: from n/a through 4.2.1.",
    "summary": "This vulnerability in MorganF Weather Layer allows attackers to inject malicious scripts into web pages, potentially compromising the security and privacy of users who visit the affected pages. Specifically, this affects Weather Layer versions from n/a through 4.2.1. Users should update to the latest version of Weather Layer to protect against this vulnerability.",
    "software": [
      "MorganF Weather Layer"
    ]
  },
  {
    "cve_id": "CVE-2025-30533",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in gopiplus Message ticker allows Stored XSS. This issue affects Message ticker: from n/a through 9.3.",
    "summary": "This vulnerability in gopiplus Message ticker allows attackers to insert harmful code into web pages, potentially affecting users who visit those pages. To mitigate this threat, users should update Message ticker to version 9.4 or higher to prevent stored cross-site scripting attacks.",
    "software": [
      "gopiplus Message ticker"
    ]
  },
  {
    "cve_id": "CVE-2025-30534",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in captcha.soft Image Captcha allows Cross Site Request Forgery. This issue affects Image Captcha: from n/a through 1.2.",
    "summary": "This vulnerability in Image Captcha allows for Cross-Site Request Forgery attacks, where a malicious website can perform actions on a different website on behalf of the user. This vulnerability affects Image Captcha versions from n/a through 1.2. Users should update to the latest version of Image Captcha to protect against this threat.",
    "software": [
      "captcha.soft Image Captcha"
    ]
  },
  {
    "cve_id": "CVE-2025-30535",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in muro External image replace allows Cross Site Request Forgery. This issue affects External image replace: from n/a through 1.0.8.",
    "summary": "This vulnerability in muro External image replace allows cyber attackers to perform Cross-Site Request Forgery (CSRF) attacks. It affects versions of External image replace from n/a through 1.0.8. Users of this software should update to a patched version to protect against this threat.",
    "software": [
      "muro External image replace"
    ]
  },
  {
    "cve_id": "CVE-2025-30536",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in zeitwesentech Beautiful Link Preview allows Stored XSS. This issue affects Beautiful Link Preview: from n/a through 1.5.0.",
    "summary": "This vulnerability in Beautiful Link Preview software allows for Stored Cross-site Scripting attacks to occur. This could affect anyone using Beautiful Link Preview version n/a through 1.5.0. Users should update their software to a version that has fixed this vulnerability to avoid potential security risks.",
    "software": [
      "Beautiful Link Preview"
    ]
  },
  {
    "cve_id": "CVE-2025-30537",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Cristian Sarov Upload Quota per User allows Stored XSS. This issue affects Upload Quota per User: from n/a through 1.3.",
    "summary": "This vulnerability in the Cristian Sarov Upload Quota per User software allows for a type of cyber attack called Cross-site Scripting (XSS). This vulnerability affects versions of the software from n/a through 1.3. Users should update their software to the latest version to mitigate the risk of exploitation.",
    "software": [
      "Cristian Sarov Upload Quota per User"
    ]
  },
  {
    "cve_id": "CVE-2025-30538",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in ChrisHurst Simple Optimizer allows Cross Site Request Forgery. This issue affects Simple Optimizer: from n/a through 1.2.7.",
    "summary": "This vulnerability in Simple Optimizer allows attackers to trick users into unknowingly performing actions on a website that they did not intend to. This can lead to unauthorized actions being carried out by the attacker. Users of Simple Optimizer versions from n/a through 1.2.7 are affected. To protect against this threat, users should update to the latest version of Simple Optimizer as soon as possible.",
    "software": [
      "ChrisHurst Simple Optimizer"
    ]
  },
  {
    "cve_id": "CVE-2025-30539",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Benedikt Mo BMo Expo allows Stored XSS. This issue affects BMo Expo: from n/a through 1.0.15.",
    "summary": "This vulnerability in BMo Expo allows attackers to input harmful scripts into web pages, which can then affect users who visit the site. The threat is known as Stored Cross-Site Scripting (XSS). Users of BMo Expo versions n/a through 1.0.15 are affected. To protect against this vulnerability, users should update their BMo Expo software to the latest version available and be cautious when interacting with any suspicious websites.",
    "software": [
      "BMo Expo"
    ]
  },
  {
    "cve_id": "CVE-2025-30540",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in avaibook AvaiBook allows Stored XSS. This issue affects AvaiBook: from n/a through 1.2.",
    "summary": "This vulnerability in AvaiBook allows attackers to execute malicious scripts on a website, leading to potential data theft or manipulation. It affects AvaiBook versions from n/a through 1.2. Users should update to the latest version of AvaiBook to prevent exploitation of this vulnerability.",
    "software": [
      "avaibook AvaiBook"
    ]
  },
  {
    "cve_id": "CVE-2025-30541",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in OTWthemes Info Boxes Shortcode and Widget allows Cross Site Request Forgery. This issue affects Info Boxes Shortcode and Widget: from n/a through 1.15.",
    "summary": "This vulnerability in OTWthemes Info Boxes Shortcode and Widget allows for a Cross-Site Request Forgery (CSRF) attack. It affects versions from n/a through 1.15. This can potentially allow an attacker to make unauthorized actions on behalf of the user. Users should update to the latest version or apply a patch to protect against this vulnerability.",
    "software": [
      "OTWthemes Info Boxes Shortcode",
      "Info Boxes Shortcode and Widget"
    ]
  },
  {
    "cve_id": "CVE-2025-30542",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in wpsolutions SoundCloud Ultimate allows Cross Site Request Forgery. This issue affects SoundCloud Ultimate: from n/a through 1.5.",
    "summary": "This vulnerability in SoundCloud Ultimate allows attackers to perform Cross-Site Request Forgery, which can result in unauthorized actions being taken on the affected website. This issue affects all versions of SoundCloud Ultimate up to version 1.5. To protect against this threat, users should update to the latest version of the plugin as soon as possible.",
    "software": [
      "SoundCloud Ultimate"
    ]
  },
  {
    "cve_id": "CVE-2025-30543",
    "description": "Missing Authorization vulnerability in swayam.tejwani Menu Duplicator allows Exploiting Incorrectly Configured Access Control Security Levels. This issue affects Menu Duplicator: from n/a through 1.0.",
    "summary": "The Menu Duplicator plugin for the swayam.tejwani website has a vulnerability that could allow unauthorized users to access and manipulate sensitive information due to incorrectly configured security levels. This vulnerability affects Menu Duplicator versions from n/a through 1.0. Users should update to the latest version of the plugin or remove it entirely to mitigate the risk of unauthorized access.",
    "software": [
      "swayam.tejwani Menu Duplicator"
    ]
  },
  {
    "cve_id": "CVE-2025-30545",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in pixeline issuuPress allows Stored XSS. This issue affects issuuPress: from n/a through 1.3.2.",
    "summary": "This vulnerability in pixeline issuuPress allows attackers to inject malicious code into web pages, potentially leading to unauthorized access or manipulation of user data. It affects all versions of issuuPress up to 1.3.2. Users should update to the latest version of issuuPress to patch this vulnerability and protect against potential attacks.",
    "software": [
      "pixeline issuuPress"
    ]
  },
  {
    "cve_id": "CVE-2025-30546",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in boroV Cackle allows Cross Site Request Forgery. This issue affects Cackle: from n/a through 4.33.",
    "summary": "A Cross-Site Request Forgery (CSRF) vulnerability has been found in boroV Cackle, allowing unauthorized requests to be made on behalf of a user. This vulnerability affects Cackle versions from n/a through 4.33. Users of Cackle are advised to update to the latest version to protect against potential attacks exploiting this vulnerability.",
    "software": [
      "boroV Cackle"
    ]
  },
  {
    "cve_id": "CVE-2025-30549",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Yummly Yummly Rich Recipes allows Cross Site Request Forgery. This issue affects Yummly Rich Recipes: from n/a through 4.2.",
    "summary": "This vulnerability in Yummly Yummly Rich Recipes allows attackers to make unauthorized requests on behalf of a user. It affects all versions from n/a through 4.2. Users should update to the latest version of Yummly Rich Recipes to protect against this threat.",
    "software": [
      "Yummly Yummly Rich Recipes"
    ]
  },
  {
    "cve_id": "CVE-2025-30550",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in WPShop.ru CallPhone'r allows Stored XSS. This issue affects CallPhone'r: from n/a through 1.1.1.",
    "summary": "This vulnerability in WPShop.ru CallPhone'r allows attackers to forge requests, potentially leading to stored cross-site scripting attacks. This vulnerability affects CallPhone'r versions from n/a through 1.1.1. Users of this plugin should update to the latest version to protect against potential attacks.",
    "software": [
      "WPShop.ru CallPhone'r"
    ]
  },
  {
    "cve_id": "CVE-2025-30551",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in smartredfox Pretty file links allows Stored XSS. This issue affects Pretty file links: from n/a through 0.9.",
    "summary": "This vulnerability in smartredfox Pretty file links allows attackers to insert malicious code into web pages, leading to a form of cyber attack known as Cross-site Scripting (XSS). This vulnerability affects users of Pretty file links version n/a through 0.9. Users should update to the latest version to protect against this threat.",
    "software": [
      "smartredfox Pretty file links"
    ]
  },
  {
    "cve_id": "CVE-2025-30552",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Donald Gilbert WordPress Admin Bar Improved allows Stored XSS. This issue affects WordPress Admin Bar Improved: from n/a through 3.3.5.",
    "summary": "This vulnerability in the Donald Gilbert WordPress Admin Bar Improved plugin allows attackers to execute malicious code on a website through a Cross-Site Request Forgery (CSRF) attack. This affects users of the plugin version n/a through 3.3.5. Users should update to the latest version of the plugin to protect against potential attacks.",
    "software": [
      "WordPress Admin Bar Improved"
    ]
  },
  {
    "cve_id": "CVE-2025-30553",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Z.com byGMO GMO Font Agent allows Stored XSS. This issue affects GMO Font Agent: from n/a through 1.6.",
    "summary": "This vulnerability in Z.com byGMO allows attackers to inject malicious code into web pages, which can lead to unauthorized actions being taken on behalf of users. The issue affects versions from 1.6 and earlier of GMO Font Agent. Users should update to a patched version of the software to mitigate the risk of a successful attack.",
    "software": [
      "Z.com byGMO GMO Font Agent"
    ]
  },
  {
    "cve_id": "CVE-2025-30555",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in iiiryan WordPres 同步微博 allows Stored XSS. This issue affects WordPres 同步微博: from n/a through 1.1.0.",
    "summary": "This CVE identifies a vulnerability in the WordPres 同步微博 plugin that could allow for a cross-site request forgery attack, leading to stored cross-site scripting. This vulnerability affects versions of WordPres 同步微博 up to 1.1.0. Users of this plugin should update to the latest version to protect their website from potential attacks.",
    "software": [
      "WordPres 同步微博"
    ]
  },
  {
    "cve_id": "CVE-2025-30556",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in flyaga Fix Rss Feeds allows Cross Site Request Forgery. This issue affects Fix Rss Feeds: from n/a through 3.1.",
    "summary": "This vulnerability in the Fix Rss Feeds plugin allows for Cross-Site Request Forgery, which can be exploited by attackers to perform malicious actions on behalf of users. It affects users of Fix Rss Feeds versions from n/a through 3.1. To protect against this threat, users should update to the latest version of the plugin as soon as possible.",
    "software": [
      "flyaga Fix Rss Feeds"
    ]
  },
  {
    "cve_id": "CVE-2025-30557",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in odihost Easy 301 Redirects allows Cross Site Request Forgery. This issue affects Easy 301 Redirects: from n/a through 1.33.",
    "summary": "This vulnerability in Easy 301 Redirects allows attackers to make unauthorized requests on behalf of a user, potentially leading to actions being carried out without their consent. It affects Easy 301 Redirects versions n/a through 1.33. Users should update to the latest version of Easy 301 Redirects to mitigate this threat.",
    "software": [
      "odihost Easy 301 Redirects"
    ]
  },
  {
    "cve_id": "CVE-2025-30558",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in EnzoCostantini55 ANAC XML Render allows Stored XSS. This issue affects ANAC XML Render: from n/a through 1.5.7.",
    "summary": "This vulnerability in ANAC XML Render allows hackers to conduct a Cross-Site Request Forgery attack, potentially leading to Stored XSS attacks. It affects versions of ANAC XML Render from n/a through 1.5.7. Users of the software should apply the latest security patches and updates to protect against this vulnerability.",
    "software": [
      "ANAC XML Render"
    ]
  },
  {
    "cve_id": "CVE-2025-30560",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Sana Ullah jQuery Dropdown Menu allows Stored XSS. This issue affects jQuery Dropdown Menu: from n/a through 3.0.",
    "summary": "This vulnerability in Sana Ullah jQuery Dropdown Menu allows for a Cross-Site Request Forgery (CSRF) attack and Stored XSS. It affects versions of jQuery Dropdown Menu up to 3.0. Users should update to a patched version as soon as possible to protect against potential attacks.",
    "software": [
      "Sana Ullah jQuery Dropdown Menu"
    ]
  },
  {
    "cve_id": "CVE-2025-30561",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Henrique Mouta CAS Maestro allows Stored XSS. This issue affects CAS Maestro: from n/a through 1.1.3.",
    "summary": "This vulnerability in Henrique Mouta CAS Maestro allows attackers to perform Cross-Site Request Forgery attacks, potentially leading to Stored Cross-Site Scripting (XSS) attacks. It affects versions of CAS Maestro ranging from n/a to 1.1.3. To protect against this threat, users should update to the latest version of CAS Maestro as soon as possible.",
    "software": [
      "Henrique Mouta CAS Maestro"
    ]
  },
  {
    "cve_id": "CVE-2025-30564",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in wpwox Custom Script Integration allows Stored XSS. This issue affects Custom Script Integration: from n/a through 2.1.",
    "summary": "This vulnerability in wpwox Custom Script Integration allows attackers to execute malicious scripts on a website. It affects versions of Custom Script Integration from n/a through 2.1. Website administrators should update to the latest version of Custom Script Integration to protect against this threat.",
    "software": [
      "wpwox Custom Script Integration"
    ]
  },
  {
    "cve_id": "CVE-2025-30565",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in karrikas banner-manager allows Stored XSS. This issue affects banner-manager: from n/a through 16.04.19.",
    "summary": "This vulnerability in karrikas banner-manager can allow attackers to execute malicious scripts on a website, potentially leading to theft of sensitive information or other malicious activities. Users of banner-manager versions up to 16.04.19 are affected. To protect against this threat, users should update to the latest version of banner-manager as soon as possible.",
    "software": [
      "karrikas banner-manager"
    ]
  },
  {
    "cve_id": "CVE-2025-30566",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Aryan Themes Clink allows DOM-Based XSS. This issue affects Clink: from n/a through 1.2.2.",
    "summary": "This security vulnerability in Aryan Themes Clink allows attackers to execute malicious code on a user's web browser, leading to potential data theft or website manipulation. All versions of Clink up to 1.2.2 are affected. To protect against this threat, users should update to the latest version of Clink as soon as possible.",
    "software": [
      "Aryan Themes Clink"
    ]
  },
  {
    "cve_id": "CVE-2025-30568",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in hitoy Super Static Cache allows Cross Site Request Forgery. This issue affects Super Static Cache: from n/a through 3.3.5.",
    "summary": "This vulnerability in hitoy Super Static Cache allows attackers to perform unauthorized actions on behalf of a user without their knowledge. It affects Super Static Cache versions from n/a through 3.3.5. To mitigate this threat, users should update to the latest version of Super Static Cache or disable the plugin until a patch is available.",
    "software": [
      "hitoy Super Static Cache"
    ]
  },
  {
    "cve_id": "CVE-2025-30569",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Jahertor WP Featured Entries allows SQL Injection. This issue affects WP Featured Entries: from n/a through 1.0.",
    "summary": "This security vulnerability in Jahertor WP Featured Entries allows hackers to inject malicious code into the website's database through SQL commands. This could potentially lead to unauthorized access to sensitive information or website functions. The vulnerability affects WP Featured Entries versions from n/a to 1.0. To protect against this threat, users should update the plugin to the latest version available.",
    "software": [
      "Jahertor WP Featured Entries",
      "WP Featured Entries"
    ]
  },
  {
    "cve_id": "CVE-2025-30570",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in AliRezaMohammadi دکمه، شبکه اجتماعی خرید allows SQL Injection. This issue affects دکمه، شبکه اجتماعی خرید: from n/a through 2.0.6.",
    "summary": "This vulnerability in AliRezaMohammadi دکمه، شبکه اجتماعی خرید allows for SQL Injection, which could potentially allow attackers to access or manipulate the database. This vulnerability affects versions of دکمه، شبکه اجتماعی خرید from n/a through 2.0.6. Users should update to a patched version as soon as possible to protect against this threat.",
    "software": [
      "AliRezaMohammadi دکمه",
      "شبکه اجتماعی خرید"
    ]
  },
  {
    "cve_id": "CVE-2025-30571",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in STEdb Corp. STEdb Forms allows SQL Injection. This issue affects STEdb Forms: from n/a through 1.0.4.",
    "summary": "This vulnerability in STEdb Corp. STEdb Forms allows attackers to inject malicious code into the software, potentially leading to unauthorized access to databases or manipulation of data. The issue affects versions of STEdb Forms from n/a through 1.0.4. Users of this software should update to the latest version to protect against SQL Injection attacks.",
    "software": [
      "STEdb Forms"
    ]
  },
  {
    "cve_id": "CVE-2025-30572",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Igor Yavych Simple Rating allows Stored XSS. This issue affects Simple Rating: from n/a through 1.4.",
    "summary": "This vulnerability in Simple Rating allows for Cross-Site Request Forgery (CSRF) attacks and Stored XSS. It affects Simple Rating versions from n/a through 1.4. Users should update to the latest version of Simple Rating to protect against this threat.",
    "software": [
      "Simple Rating"
    ]
  },
  {
    "cve_id": "CVE-2025-30573",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in mrdenny My Default Post Content allows Stored XSS. This issue affects My Default Post Content: from n/a through 0.7.3.",
    "summary": "This vulnerability in the mrdenny My Default Post Content plugin allows attackers to insert malicious code into web pages, which can then be executed by unsuspecting users. This affects users with the plugin version 0.7.3 and earlier. Users should update to the latest version of the plugin to prevent this vulnerability from being exploited.",
    "software": [
      "My Default Post Content"
    ]
  },
  {
    "cve_id": "CVE-2025-30574",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Jenst Mobile Navigation allows Stored XSS. This issue affects Mobile Navigation: from n/a through 1.5.",
    "summary": "This vulnerability in Jenst Mobile Navigation allows attackers to inject malicious code into the website, putting users at risk of having their sensitive information stolen. It affects users of Mobile Navigation versions from n/a through 1.5. To protect against attacks, users should update to the latest version of Mobile Navigation.",
    "software": [
      "Jenst Mobile Navigation"
    ]
  },
  {
    "cve_id": "CVE-2025-30575",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Arefly Login Redirect allows Stored XSS. This issue affects Login Redirect: from n/a through 1.0.5.",
    "summary": "This vulnerability in Arefly Login Redirect allows attackers to inject malicious code into a web page, leading to potential security risks. It affects versions up to 1.0.5 of Login Redirect. To mitigate this threat, users should update their software to the latest version provided by the vendor.",
    "software": [
      "Arefly Login Redirect"
    ]
  },
  {
    "cve_id": "CVE-2025-30576",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in HuangYe WuDeng Hacklog Remote Image Autosave allows Cross Site Request Forgery. This issue affects Hacklog Remote Image Autosave: from n/a through 2.1.0.",
    "summary": "This vulnerability in HuangYe WuDeng Hacklog Remote Image Autosave allows attackers to forge requests from a user who is already authenticated on a website. This affects versions of Hacklog Remote Image Autosave from n/a through 2.1.0. Users should update to the latest version of the software to protect against this threat.",
    "software": [
      "Hacklog Remote Image Autosave"
    ]
  },
  {
    "cve_id": "CVE-2025-30577",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in mendibass Browser Address Bar Color allows Stored XSS. This issue affects Browser Address Bar Color: from n/a through 3.3.",
    "summary": "This vulnerability in the Browser Address Bar Color software allows for Cross-Site Request Forgery attacks and Stored Cross-Site Scripting. It affects versions up to 3.3 of the software. Users of this software should update to the latest version to fix the vulnerability and prevent potential security breaches.",
    "software": [
      "mendibass Browser Address Bar Color"
    ]
  },
  {
    "cve_id": "CVE-2025-30578",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in hotvanrod AdSense Privacy Policy allows Stored XSS. This issue affects AdSense Privacy Policy: from n/a through 1.1.1.",
    "summary": "This vulnerability in AdSense Privacy Policy allows attackers to conduct Cross-Site Request Forgery attacks and inject malicious code. It affects users of AdSense Privacy Policy versions from n/a through 1.1.1. Users should update to the latest version of AdSense Privacy Policy to protect against this threat.",
    "software": [
      "AdSense Privacy Policy"
    ]
  },
  {
    "cve_id": "CVE-2025-30581",
    "description": "Missing Authorization vulnerability in PluginOps Top Bar allows Exploiting Incorrectly Configured Access Control Security Levels. This issue affects Top Bar: from n/a through 3.3.",
    "summary": "This vulnerability in PluginOps Top Bar allows attackers to exploit incorrectly configured access control security levels. It affects users of Top Bar versions n/a through 3.3. Users should update to the latest version of Top Bar to mitigate the risk of unauthorized access.",
    "software": [
      "PluginOps Top Bar"
    ]
  },
  {
    "cve_id": "CVE-2025-30583",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in ProRankTracker Pro Rank Tracker allows Stored XSS. This issue affects Pro Rank Tracker: from n/a through 1.0.0.",
    "summary": "This vulnerability in ProRankTracker allows for Cross-Site Request Forgery (CSRF) attacks and Stored Cross-Site Scripting (XSS) attacks. This can affect users of Pro Rank Tracker versions from n/a through 1.0.0. To mitigate the risk, users should update to a patched version of Pro Rank Tracker as soon as possible.",
    "software": [
      "ProRankTracker Pro Rank Tracker"
    ]
  },
  {
    "cve_id": "CVE-2025-30584",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in alphaomegaplugins AlphaOmega Captcha &amp; Anti-Spam Filter allows Stored XSS. This issue affects AlphaOmega Captcha &amp; Anti-Spam Filter: from n/a through 3.3.",
    "summary": "This vulnerability in AlphaOmega Captcha & Anti-Spam Filter allows for Cross-Site Request Forgery (CSRF) attacks, potentially leading to Stored Cross-Site Scripting (XSS). This can affect users of the plugin version from n/a through 3.3. Users should update to the latest version of the plugin to protect against this threat.",
    "software": [
      "alphaomegaplugins",
      "AlphaOmega Captcha & Anti-Spam Filter"
    ]
  },
  {
    "cve_id": "CVE-2025-30585",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in marynixie Generate Post Thumbnails allows Cross Site Request Forgery. This issue affects Generate Post Thumbnails: from n/a through 0.8.",
    "summary": "This vulnerability in the Generate Post Thumbnails plugin allows attackers to perform Cross-Site Request Forgery (CSRF) attacks. This can affect users of the plugin version n/a through 0.8. To mitigate this threat, users should update to the latest version of the plugin or implement security measures to prevent CSRF attacks.",
    "software": [
      "marynixie Generate Post Thumbnails"
    ]
  },
  {
    "cve_id": "CVE-2025-30586",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in bbodine1 cTabs allows Stored XSS. This issue affects cTabs: from n/a through 1.3.",
    "summary": "A Cross-Site Request Forgery vulnerability in bbodine1 cTabs allows for Stored Cross-Site Scripting (XSS) attacks. This vulnerability affects cTabs versions from n/a through 1.3. Users of cTabs should update to the latest version to protect against this threat.",
    "software": [
      "cTabs"
    ]
  },
  {
    "cve_id": "CVE-2025-30587",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in shawfactor LH OGP Meta allows Stored XSS. This issue affects LH OGP Meta: from n/a through 1.73.",
    "summary": "This vulnerability in Shawfactor LH OGP Meta allows attackers to execute malicious scripts on a user's web browser without their knowledge, potentially leading to account compromise or data theft. This vulnerability affects versions of LH OGP Meta up to 1.73. Users should update to the latest version of the software to prevent exploitation of this vulnerability.",
    "software": [
      "shawfactor LH OGP Meta"
    ]
  },
  {
    "cve_id": "CVE-2025-30588",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in ryan_xantoo Map Contact allows Stored XSS. This issue affects Map Contact: from n/a through 3.0.4.",
    "summary": "This vulnerability in Map Contact allows hackers to send unauthorized requests from a user's browser without their knowledge, potentially leading to a security breach. The vulnerability affects Map Contact versions from n/a through 3.0.4. Users should update to the latest version of Map Contact to protect against this threat.",
    "software": [
      "ryan_xantoo Map Contact"
    ]
  },
  {
    "cve_id": "CVE-2025-30590",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Dourou Flickr set slideshows allows SQL Injection. This issue affects Flickr set slideshows: from n/a through 0.9.",
    "summary": "This vulnerability allows attackers to inject malicious code into Flickr set slideshows, potentially giving them unauthorized access to data. It affects versions n/a through 0.9. Users should update to the latest version of the software to prevent exploitation of this vulnerability.",
    "software": [
      "Dourou Flickr set slideshows"
    ]
  },
  {
    "cve_id": "CVE-2025-30591",
    "description": "Missing Authorization vulnerability in tuyennv Music Press Pro allows Exploiting Incorrectly Configured Access Control Security Levels. This issue affects Music Press Pro: from n/a through 1.4.6.",
    "summary": "This vulnerability in Tuyennv Music Press Pro allows unauthorized users to access the system if the access control levels are not configured correctly. It affects versions from n/a through 1.4.6 of Music Press Pro. To mitigate this threat, users should update to a patched version of the software and ensure proper access control configurations are in place.",
    "software": [
      "Music Press Pro"
    ]
  },
  {
    "cve_id": "CVE-2025-30592",
    "description": "Missing Authorization vulnerability in westerndeal Advanced Dewplayer allows Exploiting Incorrectly Configured Access Control Security Levels. This issue affects Advanced Dewplayer: from n/a through 1.6.",
    "summary": "This vulnerability in the Advanced Dewplayer plugin allows attackers to exploit incorrectly configured access control security levels, potentially gaining unauthorized access to sensitive information or causing harm. This affects users of Advanced Dewplayer versions from n/a through 1.6. Users should update to the latest version of the plugin and ensure proper access controls are in place to mitigate the threat.",
    "software": [
      "Advanced Dewplayer"
    ]
  },
  {
    "cve_id": "CVE-2025-30593",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in samsk Include URL allows Stored XSS. This issue affects Include URL: from n/a through 0.3.5.",
    "summary": "This vulnerability in the samsk Include URL allows for Stored Cross-site Scripting, which can be used by attackers to inject malicious code into web pages. It affects versions of Include URL from n/a to 0.3.5. Users should update to the latest version of Include URL to mitigate this vulnerability and protect against potential attacks.",
    "software": [
      "samsk Include URL"
    ]
  },
  {
    "cve_id": "CVE-2025-30595",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in tstafford include-file allows Stored XSS. This issue affects include-file: from n/a through 1.",
    "summary": "This vulnerability in tstafford's include-file allows for a Stored Cross-site Scripting (XSS) attack, which could potentially allow an attacker to execute malicious code on the affected web page. This vulnerability affects include-file versions from n/a through 1. To mitigate this threat, it is recommended to update the include-file to a secure version that addresses this vulnerability.",
    "software": [
      "tstafford include-file"
    ]
  },
  {
    "cve_id": "CVE-2025-30597",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in iografica IG Shortcodes allows DOM-Based XSS. This issue affects IG Shortcodes: from n/a through 3.1.",
    "summary": "This vulnerability in iografica IG Shortcodes allows for a type of cyber attack known as Cross-site Scripting (XSS). It affects all versions of IG Shortcodes up to 3.1. Users should update to the latest version to protect against this threat.",
    "software": [
      "iografica IG Shortcodes"
    ]
  },
  {
    "cve_id": "CVE-2025-30598",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Link OSS Upload allows Cross Site Request Forgery. This issue affects OSS Upload: from n/a through 4.8.9.",
    "summary": "This vulnerability in Link OSS Upload allows attackers to manipulate a user into making unauthorized actions on a website. It affects OSS Upload versions from n/a through 4.8.9. To mitigate this threat, users should update their OSS Upload software to the latest version.",
    "software": [
      "Link OSS Upload"
    ]
  },
  {
    "cve_id": "CVE-2025-30599",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in wp-maverick WP Parallax Content Slider allows Stored XSS. This issue affects WP Parallax Content Slider: from n/a through 0.9.8.",
    "summary": "This vulnerability in the wp-maverick WP Parallax Content Slider plugin allows attackers to inject malicious code into a website, potentially leading to unauthorized access or data theft. This issue affects versions of WP Parallax Content Slider from n/a through 0.9.8. To protect against this, users should update the plugin to the latest version as soon as possible.",
    "software": [
      "wp-maverick WP Parallax Content Slider"
    ]
  },
  {
    "cve_id": "CVE-2025-30600",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in thiagogsrwp WP Hotjar allows Stored XSS. This issue affects WP Hotjar: from n/a through 0.0.3.",
    "summary": "This vulnerability in the WP Hotjar plugin allows attackers to execute malicious scripts on a website, potentially leading to sensitive information being accessed or modified. This affects all versions of WP Hotjar up to 0.0.3. Users should update to the latest version of the plugin to protect against this threat.",
    "software": [
      "WP Hotjar"
    ]
  },
  {
    "cve_id": "CVE-2025-30601",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in flipdish Flipdish Ordering System allows Cross Site Request Forgery. This issue affects Flipdish Ordering System: from n/a through 1.4.16.",
    "summary": "This vulnerability in the Flipdish Ordering System allows for Cross-Site Request Forgery (CSRF) attacks. This can affect anyone using the Flipdish Ordering System version n/a through 1.4.16. Users should update to the latest version of the system to protect against this vulnerability.",
    "software": [
      "flipdish Flipdish Ordering System"
    ]
  },
  {
    "cve_id": "CVE-2025-30602",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in alphasis Related Posts via Categories allows Stored XSS. This issue affects Related Posts via Categories: from n/a through 2.1.2.",
    "summary": "The CVE involves a vulnerability in the alphasis Related Posts via Categories plugin that allows for stored cross-site scripting attacks. This vulnerability affects versions of the plugin from n/a through 2.1.2. Users of this plugin should update to the latest version to protect against this threat.",
    "software": [
      "Related Posts via Categories"
    ]
  },
  {
    "cve_id": "CVE-2025-30603",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in DEJAN CopyLink allows Stored XSS. This issue affects CopyLink: from n/a through 1.1.",
    "summary": "The CSRF vulnerability in DEJAN CopyLink allows an attacker to execute malicious scripts by tricking a user into clicking on a specially crafted link. This vulnerability affects CopyLink versions from n/a through 1.1. Users should update to the latest version of CopyLink to protect against this threat.",
    "software": [
      "DEJAN CopyLink"
    ]
  },
  {
    "cve_id": "CVE-2025-30604",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in jiangqie JiangQie Official Website Mini Program allows Blind SQL Injection. This issue affects JiangQie Official Website Mini Program: from n/a through 1.8.2.",
    "summary": "This vulnerability in the JiangQie Official Website Mini Program allows attackers to carry out Blind SQL Injection, which can lead to unauthorized access to data or manipulation of the database. Users of the JiangQie Official Website Mini Program versions from n/a through 1.8.2 are affected. To mitigate this threat, users should update their program to the latest version as soon as possible.",
    "software": [
      "jiangqie JiangQie Official Website Mini Program"
    ]
  },
  {
    "cve_id": "CVE-2025-30605",
    "description": "Missing Authorization vulnerability in ldwin79 sourceplay-navermap allows Exploiting Incorrectly Configured Access Control Security Levels. This issue affects sourceplay-navermap: from n/a through 0.0.2.",
    "summary": "This vulnerability in ldwin79 sourceplay-navermap allows attackers to exploit incorrectly configured access control security levels. It affects versions from n/a through 0.0.2. Users should update to the latest version to mitigate this threat.",
    "software": [
      "ldwin79 sourceplay-navermap"
    ]
  },
  {
    "cve_id": "CVE-2025-30606",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Logan Carlile Easy Page Transition allows Stored XSS. This issue affects Easy Page Transition: from n/a through 1.0.1.",
    "summary": "This vulnerability in Logan Carlile Easy Page Transition allows attackers to inject malicious code into web pages, which can then be executed in the browsers of users who visit the affected pages. It affects Easy Page Transition versions from n/a through 1.0.1. Users should update to a fixed version of the software to mitigate this threat.",
    "software": [
      "Logan Carlile Easy Page Transition"
    ]
  },
  {
    "cve_id": "CVE-2025-30608",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Anthony WordPress SQL Backup allows Stored XSS. This issue affects WordPress SQL Backup: from n/a through 3.5.2.",
    "summary": "This vulnerability in Anthony WordPress SQL Backup allows attackers to perform Cross-Site Request Forgery (CSRF) attacks and Stored XSS attacks. It affects versions of WordPress SQL Backup up to 3.5.2. Users should update to the latest version of the plugin as soon as possible to protect against potential attacks.",
    "software": [
      "Anthony WordPress SQL Backup"
    ]
  },
  {
    "cve_id": "CVE-2025-30609",
    "description": "Insertion of Sensitive Information Into Sent Data vulnerability in AppExperts AppExperts – WordPress to Mobile App – WooCommerce to iOs and Android Apps allows Retrieve Embedded Sensitive Data. This issue affects AppExperts – WordPress to Mobile App – WooCommerce to iOs and Android Apps: from n/a through 1.4.3.",
    "summary": "This vulnerability in the AppExperts WordPress to Mobile App plugin allows hackers to access sensitive information that is embedded in the data being sent. It affects versions of the plugin up to 1.4.3. Users of this plugin should update to the latest version to protect their sensitive information from being retrieved by unauthorized parties.",
    "software": [
      "AppExperts",
      "WordPress",
      "WooCommerce",
      "iOs",
      "Android"
    ]
  },
  {
    "cve_id": "CVE-2025-30610",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in catchsquare WP Social Widget allows Stored XSS. This issue affects WP Social Widget: from n/a through 2.2.6.",
    "summary": "This vulnerability in the catchsquare WP Social Widget allows attackers to insert malicious code into web pages, potentially leading to unauthorized access or data theft. It affects versions of WP Social Widget up to 2.2.6. Users should update to the latest version of the plugin to protect against this threat.",
    "software": [
      "catchsquare WP Social Widget"
    ]
  },
  {
    "cve_id": "CVE-2025-30612",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in mandegarweb Replace Default Words allows Stored XSS. This issue affects Replace Default Words: from n/a through 1.3.",
    "summary": "This vulnerability in mandegarweb Replace Default Words allows hackers to execute Cross-Site Request Forgery attacks and stored Cross-Site Scripting. It affects users of Replace Default Words versions from n/a through 1.3. To protect against this threat, users should update to a version that has patched this vulnerability.",
    "software": [
      "mandegarweb Replace Default Words"
    ]
  },
  {
    "cve_id": "CVE-2025-30615",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Jacob Schwartz WP e-Commerce Style Email allows Code Injection. This issue affects WP e-Commerce Style Email: from n/a through 0.6.2.",
    "summary": "A Cross-Site Request Forgery (CSRF) vulnerability in WP e-Commerce Style Email plugin allows an attacker to inject malicious code. This vulnerability affects versions from n/a through 0.6.2. Users should update their plugin to the latest version to protect against this threat.",
    "software": [
      "WP e-Commerce Style Email"
    ]
  },
  {
    "cve_id": "CVE-2025-30617",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in takien Rewrite allows Cross Site Request Forgery. This issue affects Rewrite: from n/a through 0.2.1.",
    "summary": "This vulnerability in takien Rewrite allows attackers to manipulate requests on a user's behalf without their knowledge. It affects Rewrite versions from n/a through 0.2.1. Users should update to the latest version of Rewrite to protect against this threat.",
    "software": [
      "takien Rewrite"
    ]
  },
  {
    "cve_id": "CVE-2025-30619",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in SpeakPipe SpeakPipe allows Cross Site Request Forgery. This issue affects SpeakPipe: from n/a through 0.2.",
    "summary": "A Cross-Site Request Forgery (CSRF) vulnerability has been found in SpeakPipe, a service that allows users to leave voice messages on websites. This vulnerability could be exploited by attackers to perform actions on behalf of the victim without their consent. Users of SpeakPipe version n/a through 0.2 are affected by this issue. To protect against CSRF attacks, users should update SpeakPipe to the latest version and be cautious while clicking on links from unknown sources.",
    "software": [
      "SpeakPipe"
    ]
  },
  {
    "cve_id": "CVE-2025-30620",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in coderscom WP Odoo Form Integrator allows Stored XSS. This issue affects WP Odoo Form Integrator: from n/a through 1.1.0.",
    "summary": "This vulnerability in the coderscom WP Odoo Form Integrator plugin allows attackers to execute malicious scripts on a website, potentially leading to unauthorized actions being taken by users. This issue affects all versions of the WP Odoo Form Integrator plugin up to version 1.1.0. Users should update to the latest version of the plugin to protect against this vulnerability.",
    "software": [
      "WP Odoo Form Integrator"
    ]
  },
  {
    "cve_id": "CVE-2025-30621",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in kornelly Translator allows Stored XSS. This issue affects Translator: from n/a through 0.3.",
    "summary": "This vulnerability in kornelly Translator allows attackers to perform unauthorized actions on behalf of a logged-in user. It could affect anyone using Translator versions from n/a through 0.3. Users should update to the latest version of the software to patch this vulnerability and protect their data.",
    "software": [
      "kornelly Translator"
    ]
  },
  {
    "cve_id": "CVE-2025-30623",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Rachel Cherry wA11y – The Web Accessibility Toolbox allows Stored XSS. This issue affects wA11y – The Web Accessibility Toolbox: from n/a through 1.0.3.",
    "summary": "This vulnerability in the wA11y Web Accessibility Toolbox allows attackers to inject malicious code into web pages, potentially leading to attacks on users who visit those pages. This affects all versions of the toolbox up to 1.0.3. Users should update to the latest version of the toolbox to mitigate the risk of exploitation.",
    "software": [
      "wA11y - The Web Accessibility Toolbox"
    ]
  },
  {
    "cve_id": "CVE-2024-55279",
    "description": "Uguu through 1.8.9 allows Cross Site Scripting (XSS) via JavaScript in XML files.",
    "summary": "This Common Vulnerabilities and Exposures (CVE) affects Uguu versions up to 1.8.9 and allows attackers to execute Cross Site Scripting (XSS) attacks by embedding JavaScript code in XML files. This could affect users of Uguu software who open or download these files. To mitigate this issue, users should update their Uguu software to the latest version and be cautious when accessing XML files from unknown or untrusted sources.",
    "software": [
      "Uguu"
    ]
  },
  {
    "cve_id": "CVE-2025-1558",
    "description": "Mattermost Mobile Apps versions <=2.25.0 fail to properly validate GIF images prior to rendering which allows a malicious user to cause the Android application to crash via message containing a maliciously crafted GIF.",
    "summary": "A vulnerability in Mattermost Mobile Apps versions <=2.25.0 allows a malicious user to crash the Android application by sending a message containing a harmful GIF image. This affects users of Mattermost Mobile Apps on Android devices. Users should update to the latest version of the app to prevent this vulnerability from being exploited.",
    "software": [
      "Mattermost Mobile Apps"
    ]
  },
  {
    "cve_id": "CVE-2025-2326",
    "description": "Rejected reason: ** REJECT ** DO NOT USE THIS CANDIDATE NUMBER. Reason: This candidate was issued in error. Notes: All references and descriptions in this candidate have been removed to prevent accidental usage.",
    "summary": "There is no specific information provided for this CVE.",
    "software": [
      "None"
    ]
  },
  {
    "cve_id": "CVE-2021-26091",
    "description": "A use of a cryptographically weak pseudo-random number generator vulnerability in the authenticator of the Identity Based Encryption service of FortiMail 6.4.0 through 6.4.4, and 6.2.0 through 6.2.7 may allow an unauthenticated attacker to infer parts of users authentication tokens and reset their credentials.",
    "summary": "FortiMail, versions 6.4.0 through 6.4.4 and 6.2.0 through 6.2.7, has a vulnerability in its Identity Based Encryption service that allows an attacker to guess parts of users' authentication tokens and reset their credentials. This could potentially lead to unauthorized access to sensitive information. To mitigate this threat, users should update their FortiMail software to a version that has addressed this vulnerability.",
    "software": [
      "FortiMail"
    ]
  },
  {
    "cve_id": "CVE-2021-26105",
    "description": "A stack-based buffer overflow vulnerability (CWE-121) in the profile parser of FortiSandbox version 3.2.2 and below, version 3.1.4 and below may allow an authenticated attacker to potentially execute unauthorized code or commands via specifically crafted HTTP requests.",
    "summary": "This vulnerability in FortiSandbox software allows an attacker who is logged in to potentially execute unauthorized code or commands by sending specially crafted HTTP requests. Users of FortiSandbox version 3.2.2 and below, version 3.1.4 and below are affected. Users should update their software to a patched version to protect against this threat.",
    "software": [
      "FortiSandbox"
    ]
  },
  {
    "cve_id": "CVE-2023-25610",
    "description": "A buffer underwrite ('buffer underflow') vulnerability in the administrative interface of Fortinet FortiOS version 7.2.0 through 7.2.3, version 7.0.0 through 7.0.6, version 6.4.0 through 6.4.11 and version 6.2.12 and below, FortiProxy version 7.2.0 through 7.2.2, version 7.0.0 through 7.0.8, version 2.0.12 and below and FortiOS-6K7K version 7.0.5, version 6.4.0 through 6.4.10 and version 6.2.0 through 6.2.10 and below allows a remote unauthenticated attacker to execute arbitrary code or commands via specifically crafted requests.",
    "summary": "The CVE refers to a vulnerability in Fortinet FortiOS, FortiProxy, and FortiOS-6K7K that could be exploited by a remote attacker to execute arbitrary code or commands through the administrative interface. This vulnerability affects multiple versions of the software. Users should update their software to the latest patched version to mitigate the risk of a potential attack.",
    "software": [
      "Fortinet FortiOS",
      "FortiProxy",
      "FortiOS-6K7K"
    ]
  },
  {
    "cve_id": "CVE-2024-9103",
    "description": "Improper Neutralization of Script in Attributes in a Web Page vulnerability in Forcepoint Email Security (Blocked Messages module) allows Stored XSS.\nThis issue affects Email Security through 8.5.5.",
    "summary": "This vulnerability in Forcepoint Email Security allows attackers to execute malicious scripts on a web page, potentially leading to unauthorized access to sensitive information. It affects Email Security up to version 8.5.5. Users should update to the latest version of Email Security to protect against this threat.",
    "software": [
      "Forcepoint Email Security"
    ]
  },
  {
    "cve_id": "CVE-2025-0256",
    "description": "HCL DevOps Deploy / HCL Launch could allow an authenticated user to obtain sensitive information about other users on the system due to missing authorization for a function.",
    "summary": "There is a vulnerability in HCL DevOps Deploy / HCL Launch that could allow a user to access sensitive information of other users on the system without proper authorization. This affects users of the DevOps Deploy and Launch platforms. To mitigate this threat, users should update their systems with the latest security patches and review their authorization settings to ensure proper access controls are in place.",
    "software": [
      "HCL DevOps Deploy",
      "HCL Launch"
    ]
  },
  {
    "cve_id": "CVE-2025-23204",
    "description": "API Platform Core is a system to create hypermedia-driven REST and GraphQL APIs. Starting in version 3.3.8, a security check that gets called after GraphQl resolvers is always replaced by another one as there's no break in a clause. As this falls back to `security`, the impact is there only when there's only a security after resolver and none inside security. Version 3.3.15 contains a patch for the issue.",
    "summary": "The vulnerability in API Platform Core version 3.3.8 allows for a security check to be replaced, potentially impacting the security of GraphQL APIs. Users are advised to update to version 3.3.15 which contains a patch for this issue.",
    "software": [
      "API Platform Core"
    ]
  },
  {
    "cve_id": "CVE-2025-29294",
    "description": "Rejected reason: DO NOT USE THIS CVE RECORD. ConsultIDs: none. Reason: This record was withdrawn by its CNA. Further investigation showed that it was not a security issue. Notes: none.",
    "summary": "This CVE record has been rejected because further investigation revealed that it was not actually a security issue. No action needs to be taken as it does not pose a threat to anyone.",
    "software": [
      "none"
    ]
  },
  {
    "cve_id": "CVE-2025-2705",
    "description": "A vulnerability classified as critical has been found in Digiwin ERP 5.1. Affected is the function DoUpload/DoWebUpload of the file /Api/FileUploadApi.ashx. The manipulation of the argument File leads to unrestricted upload. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A critical vulnerability has been found in Digiwin ERP 5.1 that allows for unrestricted file uploads through a specific function. This vulnerability can be exploited remotely and has been disclosed publicly. Users of Digiwin ERP 5.1 should be aware of this threat and take immediate action to secure their systems, such as applying patches or updates if available or implementing additional security measures to prevent unauthorized access. The vendor has not responded to the disclosure, so users should proactively protect their systems.",
    "software": [
      "Digiwin ERP 5.1",
      "FileUploadApi.ashx"
    ]
  },
  {
    "cve_id": "CVE-2025-0255",
    "description": "HCL DevOps Deploy / HCL Launch could allow a remote privileged authenticated attacker to execute arbitrary commands on the system by sending specially crafted input containing special elements.",
    "summary": "This vulnerability in HCL DevOps Deploy / HCL Launch could allow an attacker with authorization to execute commands on the system remotely. This could potentially affect anyone using these software products. To mitigate this threat, users should apply the necessary security updates provided by HCL.",
    "software": [
      "HCL DevOps Deploy",
      "HCL Launch"
    ]
  },
  {
    "cve_id": "CVE-2025-29778",
    "description": "Kyverno is a policy engine designed for cloud native platform engineering teams. Prior to version 1.14.0-alpha.1, Kyverno ignores subjectRegExp and IssuerRegExp while verifying artifact's sign with keyless mode. It allows the attacker to deploy kubernetes resources with the artifacts that were signed by unexpected certificate. Deploying these unauthorized kubernetes resources can lead to full compromise of kubernetes cluster. Version 1.14.0-alpha.1 contains a patch for the issue.",
    "summary": "A vulnerability in Kyverno, a policy engine used by cloud native platform engineering teams, allows attackers to deploy unauthorized Kubernetes resources that can compromise the entire cluster. Users should update to version 1.14.0-alpha.1 to patch this issue.",
    "software": [
      "Kyverno"
    ]
  },
  {
    "cve_id": "CVE-2025-30112",
    "description": "On 70mai Dash Cam 1S devices, by connecting directly to the dashcam's network and accessing the API on port 80 and RTSP on port 554, an attacker can bypass the device authorization mechanism from the official mobile app that requires a user to physically press on the power button during a connection.",
    "summary": "The CVE involves a security vulnerability in 70mai Dash Cam 1S devices, which allows attackers to bypass the device authorization mechanism by connecting directly to the dashcam's network. This vulnerability can potentially affect users of the 70mai Dash Cam 1S device. To mitigate this threat, users should ensure their devices are updated with the latest security patches and consider limiting network access to the device to prevent unauthorized connections.",
    "software": [
      "70mai Dash Cam 1S"
    ]
  },
  {
    "cve_id": "CVE-2025-30205",
    "description": "kanidim-provision is a helper utility that uses kanidm's API to provision users, groups and oauth2 systems. Prior to version 1.2.0, a faulty function intrumentation in the (optional) kanidm patches provided by kandim-provision will cause the provisioned admin credentials to be leaked to the system log. This only impacts users which both use the provided patches and provision their `admin` or `idm_admin` account credentials this way. No other credentials are affected. Users should recompile kanidm with the newest patchset from tag `v1.2.0` or higher. As a workaround, the user can set the log level `KANIDM_LOG_LEVEL` to any level higher than `info`, for example `warn`.",
    "summary": "A vulnerability in kanidm-provision prior to version 1.2.0 can cause admin credentials to be leaked to the system log. This only affects users who use the provided patches and provision their admin or idm_admin account credentials this way. To mitigate this issue, users should recompile kanidm with the newest patchset from tag v1.2.0 or higher. A workaround is to set the log level KANIDM_LOG_LEVEL to a level higher than info, such as warn.",
    "software": [
      "kanidim-provision",
      "kanidm"
    ]
  },
  {
    "cve_id": "CVE-2025-30208",
    "description": "Vite, a provider of frontend development tooling, has a vulnerability in versions prior to 6.2.3, 6.1.2, 6.0.12, 5.4.15, and 4.5.10. `@fs` denies access to files outside of Vite serving allow list. Adding `?raw??` or `?import&raw??` to the URL bypasses this limitation and returns the file content if it exists. This bypass exists because trailing separators such as `?` are removed in several places, but are not accounted for in query string regexes. The contents of arbitrary files can be returned to the browser. Only apps explicitly exposing the Vite dev server to the network (using `--host` or `server.host` config option) are affected. Versions 6.2.3, 6.1.2, 6.0.12, 5.4.15, and 4.5.10 fix the issue.",
    "summary": "This CVE affects Vite, a provider of frontend development tooling, in versions prior to 6.2.3, 6.1.2, 6.0.12, 5.4.15, and 4.5.10. The vulnerability allows attackers to bypass file access restrictions and view the content of files outside of the allowed list by adding specific strings to the URL. Only apps that expose the Vite dev server to the network are affected. Users should update to versions 6.2.3, 6.1.2, 6.0.12, 5.4.15, or 4.5.10 to fix this issue and prevent potential unauthorized access to files.",
    "software": [
      "Vite"
    ]
  },
  {
    "cve_id": "CVE-2025-22223",
    "description": "Spring Security 6.4.0 - 6.4.3 may not correctly locate method security annotations on parameterized types or methods. This may cause an authorization bypass. \n\nYou are not affected if you are not using @EnableMethodSecurity, or\nyou do not have method security annotations on parameterized types or methods, or all method security annotations are attached to target methods",
    "summary": "A vulnerability in Spring Security versions 6.4.0 to 6.4.3 may allow unauthorized access due to a flaw in locating method security annotations. This could affect users who use @EnableMethodSecurity or have method security annotations on parameterized types or methods. To prevent this, users should ensure method security annotations are only attached to target methods or consider not using @EnableMethodSecurity.",
    "software": [
      "Spring Security"
    ]
  },
  {
    "cve_id": "CVE-2025-2706",
    "description": "A vulnerability classified as critical was found in Digiwin ERP 5.0.1. Affected by this vulnerability is an unknown functionality of the file /Api/TinyMce/UploadAjaxAPI.ashx. The manipulation of the argument File leads to unrestricted upload. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This critical vulnerability found in Digiwin ERP 5.0.1 allows for unrestricted file uploads through the /Api/TinyMce/UploadAjaxAPI.ashx file, which can be exploited remotely. The vendor has not responded to the disclosure, so users should take immediate action to mitigate the threat by implementing necessary security measures or patches provided by the vendor, if available.",
    "software": [
      "Digiwin ERP 5.0.1",
      "/Api/TinyMce/UploadAjaxAPI.ashx"
    ]
  },
  {
    "cve_id": "CVE-2025-2707",
    "description": "A vulnerability, which was classified as critical, has been found in zhijiantianya ruoyi-vue-pro 2.4.1. Affected by this issue is some unknown functionality of the file /app-api/infra/file/upload of the component Front-End Store Interface. The manipulation of the argument path leads to path traversal. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This critical vulnerability in zhijiantianya ruoyi-vue-pro 2.4.1 allows for remote attackers to perform a path traversal attack through the /app-api/infra/file/upload file of the Front-End Store Interface component. The exploit has been made public and can affect users of this software. Users should take immediate action to update to a patched version or implement any available security measures to protect against this attack. It is concerning that the vendor has not responded to this disclosure.",
    "software": [
      "zhijiantianya ruoyi-vue-pro"
    ]
  },
  {
    "cve_id": "CVE-2025-2746",
    "description": "An authentication bypass vulnerability in Kentico Xperience allows authentication bypass via the Staging Sync Server password handling of empty SHA1 usernames in digest authentication. Authentication bypass allows an attacker to control administrative objects.This issue affects Xperience through 13.0.172.",
    "summary": "This vulnerability in Kentico Xperience allows attackers to bypass authentication and take control of administrative objects. It affects versions up to 13.0.172. Users should update to a patched version to protect against this threat.",
    "software": [
      "Kentico Xperience"
    ]
  },
  {
    "cve_id": "CVE-2025-2747",
    "description": "An authentication bypass vulnerability in Kentico Xperience allows authentication bypass via the Staging Sync Server component password handling for the server defined None type. Authentication bypass allows an attacker to control administrative objects.This issue affects Xperience through 13.0.178.",
    "summary": "This vulnerability in Kentico Xperience allows attackers to bypass authentication and gain control of administrative objects. It affects versions up to 13.0.178. Users should update to the latest version of Kentico Xperience to fix this issue and prevent unauthorized access.",
    "software": [
      "Kentico Xperience"
    ]
  },
  {
    "cve_id": "CVE-2025-2748",
    "description": "The Kentico Xperience application does not fully validate or filter files uploaded via the multiple-file upload functionality, which allows for stored XSS.This issue affects Kentico Xperience through 13.0.178.",
    "summary": "This vulnerability in Kentico Xperience allows attackers to upload malicious files through the multiple-file upload feature, leading to stored cross-site scripting attacks. This affects users of Kentico Xperience up to version 13.0.178. To protect against this threat, users should update to the latest version of Kentico Xperience and avoid uploading files from untrusted sources.",
    "software": [
      "Kentico Xperience"
    ]
  },
  {
    "cve_id": "CVE-2025-2749",
    "description": "An authenticated remote code execution in Kentico Xperience allows authenticated users Staging Sync Server to upload arbitrary data to path relative locations. This results in path traversal and arbitrary file upload, including content that can be executed server side leading to remote code execution.This issue affects Kentico Xperience through 13.0.178.",
    "summary": "This vulnerability in Kentico Xperience allows authenticated users to upload malicious files to the server, potentially leading to remote code execution. Users of Kentico Xperience through version 13.0.178 are affected. Users should update to a patched version of the software to prevent exploitation of this issue.",
    "software": [
      "Kentico Xperience"
    ]
  },
  {
    "cve_id": "CVE-2025-30162",
    "description": "Cilium is a networking, observability, and security solution with an eBPF-based dataplane. For Cilium users who use Gateway API for Ingress for some services and use LB-IPAM or BGP for LB Service implementation and use network policies to block egress traffic from workloads in a namespace to workloads in other namespaces, egress traffic from workloads covered by such network policies to LoadBalancers configured by `Gateway` resources will incorrectly be allowed. LoadBalancer resources not deployed via a Gateway API configuration are not affected by this issue. This issue affects: Cilium v1.15 between v1.15.0 and v1.15.14 inclusive, v1.16 between v1.16.0 and v1.16.7 inclusive, and v1.17 between v1.17.0 and v1.17.1 inclusive. This issue is fixed in Cilium v1.15.15, v1.16.8, and v1.17.2. A Clusterwide Cilium Network Policy can be used to work around this issue for users who are unable to upgrade.",
    "summary": "This CVE affects Cilium users who use Gateway API for Ingress, LB-IPAM or BGP for LB Service implementation, and network policies to block egress traffic from workloads in one namespace to workloads in other namespaces. Egress traffic from workloads covered by these network policies to LoadBalancers configured by `Gateway` resources may be incorrectly allowed. Users of Cilium versions between v1.15.0 and v1.15.14, v1.16.0 and v1.16.7, and v1.17.0 and v1.17.1 are affected. To address this issue, users should upgrade to Cilium v1.15.15, v1.16.8, or v1.17.2. If an upgrade is not possible, a Clusterwide Cilium Network Policy can be used as a workaround.",
    "software": [
      "Cilium"
    ]
  },
  {
    "cve_id": "CVE-2025-30163",
    "description": "Cilium is a networking, observability, and security solution with an eBPF-based dataplane. Node based network policies (`fromNodes` and `toNodes`) will incorrectly permit traffic to/from non-node endpoints that share the labels specified in `fromNodes` and `toNodes` sections of network policies. Node based network policy is disabled by default in Cilium. This issue affects: Cilium v1.16 between v1.16.0 and v1.16.7 inclusive and v1.17 between v1.17.0 and v1.17.1 inclusive. This issue is fixed in Cilium v1.16.8 and v1.17.2. Users can work around this issue by ensuring that the labels used in `fromNodes` and `toNodes` fields are used exclusively by nodes and not by other endpoints.",
    "summary": "A vulnerability in Cilium networking solution allows traffic to/from non-node endpoints that share specific labels in network policies. This affects Cilium versions 1.16.0 to 1.16.7 and 1.17.0 to 1.17.1. Users should update to Cilium versions 1.16.8 or 1.17.2 to fix the issue. Alternatively, users can ensure that labels in network policies are only used by nodes and not other endpoints.",
    "software": [
      "Cilium"
    ]
  },
  {
    "cve_id": "CVE-2025-2231",
    "description": "PDF-XChange Editor RTF File Parsing Out-Of-Bounds Read Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of RTF files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25473.",
    "summary": "This vulnerability in PDF-XChange Editor allows remote attackers to run code on affected systems by tricking users into opening a malicious file or visiting a malicious webpage. The flaw is in the parsing of RTF files and can be exploited to read past the end of a buffer. Users should update their software to the latest version to protect against this vulnerability.",
    "software": [
      "PDF-XChange Editor"
    ]
  },
  {
    "cve_id": "CVE-2025-2708",
    "description": "A vulnerability, which was classified as critical, was found in zhijiantianya ruoyi-vue-pro 2.4.1. This affects an unknown part of the file /admin-api/infra/file/upload of the component Backend File Upload Interface. The manipulation of the argument path leads to path traversal. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A critical vulnerability was found in zhijiantianya ruoyi-vue-pro 2.4.1, specifically in the /admin-api/infra/file/upload component. This vulnerability allows for remote attackers to conduct path traversal attacks by manipulating the argument path. The exploit has been made public and the vendor has not responded to the disclosure. Users of this component should take action immediately to mitigate the threat, such as implementing any patches or updates that may be available.",
    "software": [
      "zhijiantianya ruoyi-vue-pro"
    ]
  },
  {
    "cve_id": "CVE-2025-2709",
    "description": "A vulnerability has been found in Yonyou UFIDA ERP-NC 5.0 and classified as problematic. This vulnerability affects unknown code of the file /login.jsp. The manipulation of the argument key/redirect leads to cross site scripting. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in Yonyou UFIDA ERP-NC 5.0 allows for cross-site scripting attacks through manipulation of the login.jsp file. This could be exploited remotely and poses a threat to users of the software. It is recommended to be cautious and avoid clicking on suspicious links or entering sensitive information on the affected system until a patch or update is released by the vendor to address this issue.",
    "software": [
      "Yonyou UFIDA ERP-NC 5.0"
    ]
  },
  {
    "cve_id": "CVE-2025-29100",
    "description": "Tenda AC8 V16.03.34.06 is vulnerable to Buffer Overflow in the fromSetRouteStatic function via the parameter list.",
    "summary": "The Tenda AC8 V16.03.34.06 router is vulnerable to a Buffer Overflow threat through a specific function. This vulnerability can be exploited by attackers to potentially gain unauthorized access to the router and its connected devices. Users of this router should update to the latest firmware version to mitigate this threat.",
    "software": [
      "Tenda AC8 V16.03.34.06"
    ]
  },
  {
    "cve_id": "CVE-2025-29135",
    "description": "A stack-based buffer overflow vulnerability in Tenda AC7 V15.03.06.44 allows a remote attacker to execute arbitrary code through a stack overflow attack using the security parameter of the formWifiBasicSet function.",
    "summary": "This CVE is a security issue in Tenda AC7 V15.03.06.44 routers that allows a remote attacker to remotely run malicious code on the affected device. This vulnerability can affect anyone using this specific model of router. To protect against this threat, users should update their router's firmware to the latest version provided by Tenda.",
    "software": [
      "Tenda AC7 V15.03.06.44"
    ]
  },
  {
    "cve_id": "CVE-2025-29310",
    "description": "An issue in onos v2.7.0 allows attackers to trigger a packet deserialization problem when supplying a crafted LLDP packet. This vulnerability allows attackers to execute arbitrary commands or access network information.",
    "summary": "A vulnerability in onos v2.7.0 could allow attackers to execute harmful commands or access network information by sending a specific type of LLDP packet. This could affect users of this version of onos and potentially compromise network security. Users should update to a patched version to mitigate this threat.",
    "software": [
      "onos v2.7.0",
      "LLDP"
    ]
  },
  {
    "cve_id": "CVE-2025-29311",
    "description": "Limited secret space in LLDP packets used in onos v2.7.0 allows attackers to obtain the private key via a bruteforce attack. Attackers are able to leverage this vulnerability into creating crafted LLDP packets.",
    "summary": "This CVE affects users of onos v2.7.0, a network operating system. The vulnerability allows attackers to obtain the private key of LLDP packets through a brute force attack, which can be used to create malicious packets. To protect against this threat, users should update their software to the latest version and regularly monitor network traffic for any suspicious activity.",
    "software": [
      "onos v2.7.0"
    ]
  },
  {
    "cve_id": "CVE-2025-29312",
    "description": "An issue in onos v2.7.0 allows attackers to trigger unexpected behavior within a device connected to a legacy switch via changing the link type from indirect to direct.",
    "summary": "CVE in the ONOS software version 2.7.0 allows attackers to manipulate the behavior of a device connected to a legacy switch by changing the link type. This vulnerability affects users of ONOS software version 2.7.0. To mitigate this threat, users should update to a patched version of the software as soon as possible.",
    "software": [
      "onos"
    ]
  },
  {
    "cve_id": "CVE-2025-29313",
    "description": "Use of incorrectly resolved name or reference in OpenDaylight Service Function Chaining (SFC) Subproject SFC Sodium-SR4 and below allows attackers to cause a Denial of Service (DoS).",
    "summary": "This vulnerability in the OpenDaylight Service Function Chaining (SFC) software can be exploited by attackers to cause a Denial of Service (DoS) attack. Users of OpenDaylight SFC Sodium-SR4 and earlier versions are affected by this issue. To mitigate this threat, users should update their software to the latest version available.",
    "software": [
      "OpenDaylight Service Function Chaining (SFC) Subproject SFC Sodium-SR4"
    ]
  },
  {
    "cve_id": "CVE-2025-29314",
    "description": "Insecure Shiro cookie configurations in OpenDaylight Service Function Chaining (SFC) Subproject SFC Sodium-SR4 and below allow attackers to access sensitive information via a man-in-the-middle attack.",
    "summary": "This vulnerability in OpenDaylight Service Function Chaining (SFC) Subproject SFC Sodium-SR4 and below allows attackers to access sensitive information through insecure Shiro cookie configurations. This could be exploited through a man-in-the-middle attack. Users of this software should update to a version that includes a secure fix to prevent unauthorized access to sensitive data.",
    "software": [
      "OpenDaylight Service Function Chaining (SFC) Subproject SFC Sodium-SR4"
    ]
  },
  {
    "cve_id": "CVE-2025-29315",
    "description": "An issue in the Shiro-based RBAC (Role-based Access Control) mechanism of OpenDaylight Service Function Chaining (SFC) Subproject SFC Sodium-SR4 and below allows attackers to execute privileged operations via a crafted request.",
    "summary": "This vulnerability in the OpenDaylight Service Function Chaining software allows attackers to perform high-level actions by sending a specific request. This affects users of OpenDaylight Service Function Chaining versions Sodium-SR4 and earlier. To protect against this, users should update to a newer version that has fixed the issue.",
    "software": [
      "OpenDaylight",
      "Shiro",
      "SFC Sodium-SR4"
    ]
  },
  {
    "cve_id": "CVE-2025-2710",
    "description": "A vulnerability was found in Yonyou UFIDA ERP-NC 5.0 and classified as problematic. This issue affects some unknown processing of the file /menu.jsp. The manipulation of the argument flag leads to cross site scripting. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The vulnerability in Yonyou UFIDA ERP-NC 5.0 allows for cross-site scripting attacks. This could affect users of the software who visit a specific webpage. To protect against this threat, users should be cautious about clicking on suspicious links or visiting unknown websites. It is concerning that the vendor did not respond to the disclosure, so users should be extra vigilant in protecting their information.",
    "software": [
      "Yonyou UFIDA ERP-NC 5.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2711",
    "description": "A vulnerability was found in Yonyou UFIDA ERP-NC 5.0. It has been classified as problematic. Affected is an unknown function of the file /help/systop.jsp. The manipulation of the argument langcode leads to cross site scripting. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in Yonyou UFIDA ERP-NC 5.0 allows for cross-site scripting attacks by manipulating a certain argument in the system. The exploit can be triggered remotely and poses a risk to users of the ERP system. Users should be cautious and take steps to mitigate the vulnerability until a patch or fix is released. The vendor has been informed about the issue but has not responded.",
    "software": [
      "Yonyou UFIDA ERP-NC 5.0"
    ]
  },
  {
    "cve_id": "CVE-2025-26512",
    "description": "SnapCenter versions prior to \n6.0.1P1 and 6.1P1 are susceptible to a vulnerability which may allow an \nauthenticated SnapCenter Server user to become an admin user on a remote\n system where a SnapCenter plug-in has been installed.",
    "summary": "This vulnerability in SnapCenter allows an authenticated user to gain admin access on remote systems with SnapCenter plug-ins installed. Users of SnapCenter versions prior to 6.0.1P1 and 6.1P1 should update to the latest version to protect against this threat.",
    "software": [
      "SnapCenter"
    ]
  },
  {
    "cve_id": "CVE-2025-2712",
    "description": "A vulnerability was found in Yonyou UFIDA ERP-NC 5.0. It has been declared as problematic. Affected by this vulnerability is an unknown functionality of the file /help/top.jsp. The manipulation of the argument langcode leads to cross site scripting. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The Yonyou UFIDA ERP-NC 5.0 software has a vulnerability that could allow for cross-site scripting attacks through manipulation of a specific file. This vulnerability can be exploited remotely, and the details have been made public. The vendor has not responded to the disclosure. Users of this software should take action to protect themselves from potential attacks, such as implementing security measures or seeking alternative solutions.",
    "software": [
      "Yonyou UFIDA ERP-NC 5.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2714",
    "description": "A vulnerability was found in JoomlaUX JUX Real Estate 3.4.0. It has been rated as problematic. Affected by this issue is some unknown functionality of the file /extensions/realestate/index.php/agents/agent-register/addagent. The manipulation of the argument plan_id leads to cross site scripting. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The vulnerability in JoomlaUX JUX Real Estate 3.4.0 allows for cross site scripting attacks to be performed remotely through manipulation of the argument plan_id. This affects users of this specific extension. To protect against this vulnerability, users should update to a newer version of the extension as soon as it becomes available.",
    "software": [
      "JoomlaUX JUX Real Estate"
    ]
  },
  {
    "cve_id": "CVE-2025-2715",
    "description": "A vulnerability classified as problematic has been found in timschofield webERP up to 5.0.0.rc+13. This affects an unknown part of the file ConfirmDispatch_Invoice.php of the component Confirm Dispatch and Invoice Page. The manipulation of the argument Narrative leads to cross site scripting. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. It is recommended to apply a patch to fix this issue. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A vulnerability has been discovered in timschofield webERP up to version 5.0.0.rc+13, specifically in the Confirm Dispatch and Invoice Page component. This vulnerability allows for cross-site scripting via manipulation of the Narrative argument in the ConfirmDispatch_Invoice.php file. The exploit can be triggered remotely, putting users at risk of attack. It is advised to apply a patch to address this issue, as the vendor did not respond to the disclosure of the exploit and it may be utilized by attackers.",
    "software": [
      "timschofield webERP"
    ]
  },
  {
    "cve_id": "CVE-2025-2716",
    "description": "A vulnerability classified as problematic was found in China Mobile P22g-CIac 1.0.00.488. This vulnerability affects unknown code of the component Samba Path Handler. The manipulation leads to path traversal. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This CVE is a security flaw in China Mobile P22g-CIac software that allows attackers to remotely access and manipulate files using a path traversal exploit in the Samba Path Handler component. The vulnerability has been made public and the vendor has not responded to address the issue. Users should be aware of potential attacks and take precautions to protect their systems.",
    "software": [
      "China Mobile P22g-CIac",
      "Samba Path Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-1097",
    "description": "A security issue was discovered in  ingress-nginx https://github.com/kubernetes/ingress-nginx  where the `auth-tls-match-cn` Ingress annotation can be used to inject configuration into nginx. This can lead to arbitrary code execution in the context of the ingress-nginx controller, and disclosure of Secrets accessible to the controller. (Note that in the default installation, the controller can access all Secrets cluster-wide.)",
    "summary": "The CVE is a security issue in the ingress-nginx software, which is used in Kubernetes. By using a specific Ingress annotation, attackers can inject configuration into nginx, leading to potential arbitrary code execution and disclosure of sensitive Secrets. This can affect anyone using the ingress-nginx controller. Users should update their ingress-nginx software to the latest version to fix this vulnerability.",
    "software": [
      "ingress-nginx"
    ]
  },
  {
    "cve_id": "CVE-2025-1098",
    "description": "A security issue was discovered in  ingress-nginx https://github.com/kubernetes/ingress-nginx  where the `mirror-target` and `mirror-host` Ingress annotations can be used to inject arbitrary configuration into nginx. This can lead to arbitrary code execution in the context of the ingress-nginx controller, and disclosure of Secrets accessible to the controller. (Note that in the default installation, the controller can access all Secrets cluster-wide.)",
    "summary": "The security issue found in ingress-nginx allows attackers to inject arbitrary configuration into nginx, potentially leading to arbitrary code execution and disclosure of sensitive information. This affects users of the ingress-nginx controller in Kubernetes. To mitigate the threat, users should update their ingress-nginx to a patched version and avoid using the `mirror-target` and `mirror-host` Ingress annotations.",
    "software": [
      "ingress-nginx",
      "nginx"
    ]
  },
  {
    "cve_id": "CVE-2025-1974",
    "description": "A security issue was discovered in Kubernetes where under certain conditions, an unauthenticated attacker with access to the pod network can achieve arbitrary code execution in the context of the ingress-nginx controller. This can lead to disclosure of Secrets accessible to the controller. (Note that in the default installation, the controller can access all Secrets cluster-wide.)",
    "summary": "This security vulnerability in Kubernetes allows an unauthenticated attacker to execute code and access sensitive information. It affects users of Kubernetes using the ingress-nginx controller. To protect against this issue, users should update their Kubernetes installation to the latest version that includes the necessary security patches.",
    "software": [
      "Kubernetes",
      "ingress-nginx controller"
    ]
  },
  {
    "cve_id": "CVE-2025-24513",
    "description": "A security issue was discovered in  ingress-nginx https://github.com/kubernetes/ingress-nginx  where attacker-provided data are included in a filename by the ingress-nginx Admission Controller feature, resulting in directory traversal within the container. This could result in denial of service, or when combined with other vulnerabilities, limited disclosure of Secret objects from the cluster.",
    "summary": "This security issue in ingress-nginx allows attackers to access files outside of the intended directory, potentially causing denial of service or unauthorized access to sensitive information like Secret objects in a Kubernetes cluster. Users should update to the latest version of ingress-nginx to mitigate this vulnerability.",
    "software": [
      "ingress-nginx",
      "kubernetes/ingress-nginx"
    ]
  },
  {
    "cve_id": "CVE-2025-24514",
    "description": "A security issue was discovered in  ingress-nginx https://github.com/kubernetes/ingress-nginx  where the `auth-url` Ingress annotation can be used to inject configuration into nginx. This can lead to arbitrary code execution in the context of the ingress-nginx controller, and disclosure of Secrets accessible to the controller. (Note that in the default installation, the controller can access all Secrets cluster-wide.)",
    "summary": "The CVE in the ingress-nginx software allows attackers to inject configuration and potentially execute arbitrary code in the system. This can lead to the disclosure of sensitive information like Secrets. This vulnerability affects users of the ingress-nginx software. To mitigate this threat, users are advised to update the software to the latest version as soon as possible.",
    "software": [
      "ingress-nginx"
    ]
  },
  {
    "cve_id": "CVE-2025-2717",
    "description": "A vulnerability, which was classified as critical, has been found in D-Link DIR-823X 240126/240802. This issue affects the function sub_41710C of the file /goform/diag_nslookup of the component HTTP POST Request Handler. The manipulation of the argument target_addr leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The D-Link DIR-823X 240126/240802 router has a critical vulnerability that could allow remote attackers to inject malicious commands into the system. This could potentially lead to unauthorized access or control of the router. Users of this router model should update to the latest firmware version provided by D-Link to protect against this threat.",
    "software": [
      "D-Link DIR-823X"
    ]
  },
  {
    "cve_id": "CVE-2025-2720",
    "description": "A vulnerability was found in GNOME libgsf up to 1.14.53 and classified as problematic. Affected by this issue is the function gsf_base64_encode_simple. The manipulation of the argument size leads to use of uninitialized variable. The attack needs to be approached locally. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The vulnerability in GNOME libgsf can be exploited locally by manipulating an argument to cause the use of uninitialized variable, potentially leading to a security breach. This issue affects versions up to 1.14.53. Users should update to a patched version as soon as possible to mitigate the risk of exploitation. The vendor has been notified but has not responded.",
    "software": [
      "GNOME libgsf"
    ]
  },
  {
    "cve_id": "CVE-2025-2721",
    "description": "A vulnerability was found in GNOME libgsf up to 1.14.53. It has been classified as critical. This affects the function gsf_base64_encode_simple. The manipulation of the argument size_t leads to heap-based buffer overflow. An attack has to be approached locally. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This CVE involves a critical vulnerability in GNOME libgsf up to version 1.14.53. The vulnerability allows for a heap-based buffer overflow when manipulating certain arguments, potentially leading to a local attack. This vulnerability affects users of GNOME libgsf up to version 1.14.53. To mitigate the threat, users should update to the latest version of GNOME libgsf as soon as possible.",
    "software": [
      "GNOME libgsf"
    ]
  },
  {
    "cve_id": "CVE-2025-2722",
    "description": "A vulnerability was found in GNOME libgsf up to 1.14.53. It has been declared as critical. This vulnerability affects the function gsf_prop_settings_collect_va. The manipulation of the argument n_alloced_params leads to heap-based buffer overflow. Local access is required to approach this attack. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in GNOME libgsf up to version 1.14.53 allows for a critical heap-based buffer overflow attack if a specific function is manipulated. This vulnerability only affects users who have local access on their system. The vendor was notified but did not respond to the disclosure. Users should be cautious and consider updating the software to a secure version as soon as possible.",
    "software": [
      "GNOME libgsf"
    ]
  },
  {
    "cve_id": "CVE-2025-2723",
    "description": "A vulnerability was found in GNOME libgsf up to 1.14.53. It has been rated as critical. This issue affects the function gsf_property_settings_collec. The manipulation of the argument n_alloced_params leads to heap-based buffer overflow. Attacking locally is a requirement. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in GNOME libgsf up to version 1.14.53 could allow for a heap-based buffer overflow if exploited locally. It has been rated as critical. Users of GNOME libgsf should take immediate action to update to a patched version to mitigate the risk of a potential attack. The vendor has been notified of the issue but has not responded.",
    "software": [
      "GNOME libgsf"
    ]
  },
  {
    "cve_id": "CVE-2025-2724",
    "description": "A vulnerability classified as problematic has been found in GNOME libgsf up to 1.14.53. Affected is the function sorting_key_copy. The manipulation of the argument Name leads to out-of-bounds read. It is possible to launch the attack on the local host. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A vulnerability has been found in GNOME libgsf up to version 1.14.53 which can allow an attacker to perform an out-of-bounds read by manipulating the argument Name in the function sorting_key_copy. This vulnerability can be exploited locally. Users of GNOME libgsf should update to the latest version to protect against this threat. The vendor has been informed of this vulnerability but has not responded.",
    "software": [
      "GNOME libgsf"
    ]
  },
  {
    "cve_id": "CVE-2025-2725",
    "description": "A vulnerability classified as critical was found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. Affected by this vulnerability is an unknown functionality of the file /api/login/auth of the component HTTP POST Request Handler. The manipulation leads to command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This critical vulnerability affects several H3C networking devices and can allow attackers to remotely launch command injection attacks. Users of the affected devices should take immediate action to secure their systems, as the exploit has been disclosed publicly and there has been no response from the vendor. It is recommended to implement any available security patches or updates to protect against this threat.",
    "software": [
      "H3C Magic NX15",
      "Magic NX30 Pro",
      "Magic NX400",
      "Magic R3010",
      "Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2025-2726",
    "description": "A vulnerability, which was classified as critical, has been found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. Affected by this issue is some unknown functionality of the file /api/esps of the component HTTP POST Request Handler. The manipulation leads to command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in H3C networking devices allows attackers to inject commands through a specific file, which could be exploited remotely. Users of H3C Magic NX15, NX30 Pro, NX400, R3010, and BE18000 up to V100R014 are affected. To protect against this threat, users should apply any patches or updates provided by the vendor.",
    "software": [
      "H3C Magic NX15",
      "Magic NX30 Pro",
      "Magic NX400",
      "Magic R3010",
      "Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2025-2727",
    "description": "A vulnerability, which was classified as critical, was found in H3C Magic NX30 Pro up to V100R007. This affects an unknown part of the file /api/wizard/getNetworkStatus of the component HTTP POST Request Handler. The manipulation leads to command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This CVE is a critical vulnerability found in H3C Magic NX30 Pro up to V100R007, where malicious actors can remotely insert commands into the system through a specific file. This could lead to potential cyberattacks. To protect against this threat, users should implement security measures and updates provided by the vendor, as they have not responded to this disclosure.",
    "software": [
      "H3C Magic NX30 Pro"
    ]
  },
  {
    "cve_id": "CVE-2025-2728",
    "description": "A vulnerability has been found in H3C Magic NX30 Pro and Magic NX400 up to V100R014 and classified as critical. This vulnerability affects unknown code of the file /api/wizard/getNetworkConf. The manipulation leads to command injection. The attack can be initiated remotely. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A critical vulnerability has been found in H3C Magic NX30 Pro and NX400 up to V100R014, allowing for remote command injection. This affects users of these devices. To protect against potential attacks, users should patch their systems as soon as a fix becomes available.",
    "software": [
      "H3C Magic NX30 Pro",
      "Magic NX400"
    ]
  },
  {
    "cve_id": "CVE-2025-2729",
    "description": "A vulnerability was found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014 and classified as critical. This issue affects some unknown processing of the file /api/wizard/networkSetup of the component HTTP POST Request Handler. The manipulation leads to command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The vulnerability in H3C networking devices allows attackers to inject commands through the /api/wizard/networkSetup file, potentially compromising the system. This affects users of H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010, and Magic BE18000 up to V100R014. To mitigate this threat, users should apply security patches provided by the vendor.",
    "software": [
      "H3C Magic NX15",
      "H3C Magic NX30 Pro",
      "H3C Magic NX400",
      "H3C Magic R3010",
      "H3C Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2025-2730",
    "description": "A vulnerability was found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. It has been classified as critical. Affected is an unknown function of the file /api/wizard/getssidname of the component HTTP POST Request Handler. The manipulation leads to command injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This CVE refers to a critical vulnerability found in several H3C Magic networking products. The vulnerability allows for remote attackers to inject commands through a specific file, potentially leading to a security breach. Users of the affected products should update to the latest version to patch this vulnerability. The vendor has been alerted about this issue but has not responded.",
    "software": [
      "H3C Magic NX15",
      "H3C Magic NX30 Pro",
      "H3C Magic NX400",
      "H3C Magic R3010",
      "H3C Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2025-2731",
    "description": "A vulnerability was found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file /api/wizard/getDualbandSync of the component HTTP POST Request Handler. The manipulation leads to command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A critical vulnerability has been found in certain H3C devices, allowing remote attackers to execute commands through manipulation of a specific file. This affects users of H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010, and Magic BE18000 up to V100R014. The vendor has not provided a fix, so users are advised to be cautious and take measures to protect their devices from potential attacks.",
    "software": [
      "H3C Magic NX15",
      "Magic NX30 Pro",
      "Magic NX400",
      "Magic R3010",
      "Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2025-2732",
    "description": "A vulnerability was found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. It has been rated as critical. Affected by this issue is some unknown functionality of the file /api/wizard/getWifiNeighbour of the component HTTP POST Request Handler. The manipulation leads to command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in H3C networking devices allows remote attackers to execute commands on the system through a manipulated HTTP request. The affected devices include Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010, and Magic BE18000 up to V100R014. Users of these devices should take immediate action to update their software to a version that has patched this vulnerability, as the exploit has been disclosed publicly and could be used by malicious actors. The vendor, H3C, was informed of the issue but did not respond.",
    "software": [
      "H3C Magic NX15",
      "Magic NX30 Pro",
      "Magic NX400",
      "Magic R3010",
      "Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2024-10206",
    "description": "A Server-Side Request Forgery vulnerability in the APROL Web Portal used in B&R APROL <4.4-00P5 may allow an unauthenticated network-based attacker to force the web server to request arbitrary URLs.",
    "summary": "This vulnerability in the APROL Web Portal could allow an attacker to make the web server request any URL they choose without being authenticated. This could potentially lead to unauthorized access to sensitive information or resources. Users of B&R APROL <4.4-00P5 should apply the necessary patches to fix the vulnerability and prevent exploitation.",
    "software": [
      "APROL Web Portal",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-10207",
    "description": "A Server-Side Request Forgery vulnerability in the APROL Web Portal used in B&R APROL <4.4-00P5 may allow an authenticated network-based attacker to force the web server to request arbitrary URLs.",
    "summary": "This vulnerability in the APROL Web Portal could allow a hacker who has access to the network to make the web server request any URL they choose. This could be used to access sensitive information or carry out further attacks. Users of B&R APROL <4.4-00P5 should update to the latest version to patch the vulnerability and protect their system from potential attacks.",
    "software": [
      "APROL Web Portal",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-10208",
    "description": "An Improper Neutralization of Input During Web Page Generation vulnerability in the APROL Web Portal used in B&R APROL <4.4-00P5 may allow an authenticated network-based attacker to insert malicious code which is then executed in the context of the user’s browser session.",
    "summary": "This vulnerability in the APROL Web Portal software could potentially allow a hacker who is already logged in to the system to insert harmful code that could be executed in the user's browser. This could affect users of the APROL software version <4.4-00P5. To address this issue, users should update to the latest version of the APROL software as soon as possible to patch the vulnerability and protect their systems.",
    "software": [
      "APROL Web Portal",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-10209",
    "description": "An Incorrect Permission Assignment for Critical Resource vulnerability in the file system used in B&R APROL <4.4-01 may allow an authenticated local attacker to read and alter the configuration of another engineering or runtime user.",
    "summary": "This vulnerability in the B&R APROL file system could allow a local attacker with access to read and alter the configuration of other users. Users of B&R APROL versions below 4.4-01 should be cautious and consider updating to the latest version to mitigate this risk.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-45480",
    "description": "An improper control of generation of code ('Code Injection') vulnerability in the AprolCreateReport component of B&R APROL <4.4-00P5 may allow an unauthenticated network-based attacker to read files from the local system.",
    "summary": "This vulnerability in B&R APROL software could allow hackers to view files on the system without authorization. Anyone using B&R APROL versions earlier than 4.4-00P5 may be affected. To protect against this threat, users should update their software to the latest version and be cautious of suspicious network activities.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-45481",
    "description": "An Incomplete Filtering of Special Elements vulnerability in scripts using the SSH server on B&R APROL <4.4-00P5 may allow an authenticated local attacker to authenticate as another legitimate user.",
    "summary": "This vulnerability in B&R APROL software allows a local attacker to pretend to be another legitimate user. Users of version <4.4-00P5 should update their software to protect against this threat.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-45482",
    "description": "An Inclusion of Functionality from Untrusted Control Sphere vulnerability in the SSH server on B&R APROL <4.4-00P1 may allow an authenticated local attacker from a trusted remote server to execute malicious commands.",
    "summary": "This vulnerability in the SSH server on B&R APROL <4.4-00P1 could allow a hacker to run harmful commands if they are an authenticated user on a trusted remote server. Users of B&R APROL should update to version 4.4-00P1 or take other security measures to protect against potential attacks.",
    "software": [
      "SSH server",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-45483",
    "description": "A Missing Authentication for Critical Function vulnerability in the GRUB configuration used B&R APROL <4.4-01 may allow an unauthenticated physical attacker to alter the boot configuration of the operating system.",
    "summary": "This vulnerability in the GRUB configuration used by B&R APROL software could allow an unauthorized attacker to change the boot configuration of the system without authentication. It could affect users of B&R APROL versions <4.4-01. To stay protected, users should update the software to version 4.4-01 or higher.",
    "software": [
      "GRUB",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-45484",
    "description": "An Allocation of Resources Without Limits or Throttling vulnerability in the operating system network configuration used in B&R APROL <4.4-00P5 may allow an unauthenticated adjacent attacker to per-form Denial-of-Service (DoS) attacks against the product.",
    "summary": "This vulnerability in the B&R APROL operating system network configuration allows attackers to carry out Denial-of-Service attacks, potentially disrupting the product. It affects users of B&R APROL versions prior to 4.4-00P5. Users should update to the latest version to mitigate the risk of being targeted by this vulnerability.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-8313",
    "description": "An Exposure of Sensitive System Information to an Unauthorized Control Sphere and Initialization of a Resource with an Insecure Default vulnerability in the SNMP component of B&R APROL <4.4-00P5 may allow an unauthenticated adjacent-based attacker to read and alter configuration using SNMP.",
    "summary": "This vulnerability in the SNMP component of B&R APROL software could allow attackers to access and change system configurations without proper authentication. It affects users of B&R APROL versions earlier than 4.4-00P5. Users should update to the latest version to protect against this threat.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-8314",
    "description": "An Incorrect Implementation of Authentication Algorithm and Exposure of Data Element to Wrong Ses-sion vulnerability in the session handling used in B&R APROL <4.4-00P5 may allow an authenticated network attacker to take over a currently active user session without login credentials.",
    "summary": "This vulnerability in B&R APROL software could allow a hacker on the network to take over a user session without needing the correct login credentials. This could lead to unauthorized access to sensitive data. Users should update to version 4.4-00P5 or later to fix this issue.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-8315",
    "description": "An Improper Handling of Insufficient Permissions or Privileges vulnerability in scripts used in B&R APROL <4.4-00P5 may allow an authenticated local attacker to read credential information.",
    "summary": "This vulnerability in B&R APROL software could allow a local attacker with the right permissions to access sensitive credential information. Users of B&R APROL software version <4.4-00P5 should apply the necessary security patches or updates to protect against this threat.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2025-2733",
    "description": "A vulnerability classified as critical has been found in mannaandpoem OpenManus up to 2025.3.13. This affects an unknown part of the file app/tool/python_execute.py of the component Prompt Handler. The manipulation leads to os command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A critical vulnerability has been found in OpenManus software up to version 2025.3.13, which allows for remote attackers to execute arbitrary commands on the system. This affects users of the Prompt Handler component. The vendor has been notified but has not responded. Users should update to the latest version of the software to mitigate the risk of exploitation.",
    "software": [
      "mannaandpoem OpenManus",
      "Prompt Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2734",
    "description": "A vulnerability, which was classified as critical, was found in PHPGurukul Old Age Home Management System 1.0. Affected is an unknown function of the file /admin/aboutus.php. The manipulation of the argument pagetitle leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Old Age Home Management System 1.0 has a critical vulnerability that allows for SQL injection through the /admin/aboutus.php file. This can be exploited remotely and may affect users of the system. It is important to update the system to a secure version or apply any available patches to fix this issue and prevent potential attacks.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2735",
    "description": "A vulnerability has been found in PHPGurukul Old Age Home Management System 1.0 and classified as critical. Affected by this vulnerability is an unknown functionality of the file /admin/add-services.php. The manipulation of the argument sertitle leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This CVE is a critical vulnerability found in the PHPGurukul Old Age Home Management System 1.0 that could allow attackers to perform SQL injection attacks remotely. This threat affects users of the software. To mitigate this risk, users should update to a patched version of the software as soon as possible.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2736",
    "description": "A vulnerability was found in PHPGurukul Old Age Home Management System 1.0 and classified as critical. Affected by this issue is some unknown functionality of the file /admin/bwdates-report-details.php. The manipulation of the argument fromdate leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. Other parameters might be affected as well.",
    "summary": "This vulnerability in the PHPGurukul Old Age Home Management System 1.0 allows for a critical SQL injection attack through the manipulation of certain parameters. This can be exploited remotely, putting the system at risk. Users of this software should take immediate action to update or patch the system to protect against potential attacks.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2024-10105",
    "description": "The Job Postings WordPress plugin before 2.7.11 does not sanitise and escape some of its settings, which could allow high privilege users such as contributor to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This security vulnerability in the Job Postings WordPress plugin could allow high privilege users like contributors to execute malicious code on websites, even if certain permissions are restricted. Users of this plugin should update to version 2.7.11 to protect against potential attacks.",
    "software": [
      "Job Postings WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10210",
    "description": "An External Control of File Name or Path vulnerability in the APROL Web Portal used in B&R APROL <4.4-005P may allow an authenticated network-based attacker to access data from the file system.",
    "summary": "This vulnerability in the APROL Web Portal could allow a hacker who has access to the network to view sensitive data from the file system. Users of B&R APROL <4.4-005P should take immediate action to update to a secure version to mitigate the risk of unauthorized data access.",
    "software": [
      "APROL Web Portal",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-10472",
    "description": "The Stylish Price List  WordPress plugin before 7.1.12 does not sanitise and escape some of its settings, which could allow high privilege users such as contributor to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Stylish Price List WordPress plugin has a vulnerability that allows high privilege users, like contributors, to create Stored Cross-Site Scripting attacks. This can impact users of the plugin, especially in a multisite setup. To mitigate this threat, users should update their plugin to version 7.1.12 or higher to fix the issue.",
    "software": [
      "Stylish Price List",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-10554",
    "description": "The WordPress WP-Advanced-Search WordPress plugin before 3.3.9.3 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the WP-Advanced-Search WordPress plugin could be exploited by high privilege users to carry out malicious attacks on a website, even if certain security measures are in place. Users of this plugin should update to version 3.3.9.3 or remove it to prevent potential attacks.",
    "software": [
      "WordPress",
      "WP-Advanced-Search WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10560",
    "description": "The Form Maker by 10Web  WordPress plugin before 1.15.30 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Form Maker by 10Web WordPress plugin has a vulnerability that could allow high privilege users to perform Cross-Site Scripting attacks, even when certain capabilities are prohibited. This could affect users of the plugin, particularly in multisite setups. Users should update the plugin to version 1.15.30 or higher to protect against this vulnerability.",
    "software": [
      "Form Maker by 10Web"
    ]
  },
  {
    "cve_id": "CVE-2024-10565",
    "description": "The Slider by 10Web  WordPress plugin before 1.2.62 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Slider by 10Web WordPress plugin could allow high privilege users, such as admins, to execute malicious code on a website, potentially compromising user data. Users of this plugin should update to version 1.2.62 or higher to protect against this threat.",
    "software": [
      "Slider by 10Web WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10566",
    "description": "The Slider by 10Web  WordPress plugin before 1.2.62 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Slider by 10Web WordPress plugin allows high privilege users, such as admins, to execute Stored Cross-Site Scripting attacks, even when restrictions are in place. This could affect users of the plugin, especially in multisite setups. To protect against this threat, users should update to version 1.2.62 or higher as soon as possible.",
    "software": [
      "Slider by 10Web WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10638",
    "description": "The Product Labels For Woocommerce (Sale Badges) WordPress plugin before 1.5.11 does not sanitize and escape a parameter before using it in a SQL statement, allowing admins to perform SQL injection attacks",
    "summary": ".\n\nThis vulnerability in the Product Labels For Woocommerce WordPress plugin allows malicious administrators to insert malicious code through SQL injection attacks. It affects users of the plugin who have not updated to version 1.5.11. Users should update the plugin to the latest version to ensure their site is protected from potential attacks.",
    "software": [
      "Product Labels For Woocommerce (Sale Badges) WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10679",
    "description": "The Quiz and Survey Master (QSM)  WordPress plugin before 9.2.1 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "CVE-2021-24287 is a vulnerability in the Quiz and Survey Master WordPress plugin that allows high privilege users to execute Stored Cross-Site Scripting attacks. This could affect users of the plugin, particularly in a multisite setup. To protect against this vulnerability, users should update to version 9.2.1 or later of the plugin.",
    "software": [
      "Quiz and Survey Master (QSM)"
    ]
  },
  {
    "cve_id": "CVE-2024-10703",
    "description": "The Registrations for the Events Calendar  WordPress plugin before 2.13.4 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Registrations for the Events Calendar WordPress plugin could allow an attacker with admin privileges to insert malicious code that could be executed when other users view a calendar event page. Users of this plugin should update to version 2.13.4 or later to protect against this threat.",
    "software": [
      "Registrations for the Events Calendar",
      "WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-11272",
    "description": "The Contact Form & SMTP Plugin for WordPress by PirateForms WordPress plugin before 2.6.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Contact Form & SMTP Plugin for WordPress allows high privilege users, such as admins, to perform Stored Cross-Site Scripting attacks. This could impact users of the plugin, especially those in a multisite setup. To protect against this threat, users should update the plugin to version 2.6.0 or higher as soon as possible.",
    "software": [
      "Contact Form & SMTP Plugin for WordPress by PirateForms WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-11273",
    "description": "The Contact Form & SMTP Plugin for WordPress by PirateForms WordPress plugin before 2.6.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Contact Form & SMTP Plugin for WordPress has a vulnerability that allows high privilege users to perform a Stored Cross-Site Scripting attack, even if certain permissions are restricted. This could affect users of the plugin, particularly those with admin privileges. To protect against this threat, users should update to version 2.6.0 or later of the plugin.",
    "software": [
      "Contact Form & SMTP Plugin for WordPress by PirateForms WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-11503",
    "description": "The WP Tabs  WordPress plugin before 2.2.7 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The WP Tabs WordPress plugin has a vulnerability where high privilege users could perform Stored Cross-Site Scripting attacks, even when certain security settings are in place. This could affect any website using the plugin, particularly those with multiple sites. Users should update to version 2.2.7 or higher to protect against this threat.",
    "software": [
      "WP Tabs",
      "WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-12109",
    "description": "The Product Labels For Woocommerce (Sale Badges) WordPress plugin before 1.5.9 does not sanitize and escape a parameter before using it in a SQL statement, allowing admins to perform SQL injection attacks",
    "summary": "A vulnerability has been found in the Product Labels For Woocommerce WordPress plugin that could allow attackers to perform SQL injection attacks. This could affect website admins using the plugin version before 1.5.9. Users should update to the latest version of the plugin to protect against this threat.",
    "software": [
      "Product Labels For Woocommerce (Sale Badges) WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-12682",
    "description": "The Smart Maintenance Mode WordPress plugin before 1.5.2 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Smart Maintenance Mode WordPress plugin prior to version 1.5.2 is vulnerable to a Stored Cross-Site Scripting attack. This could allow malicious high privilege users, such as admins, to execute harmful scripts on the website. Users of this plugin should update to version 1.5.2 or newer to protect against this threat.",
    "software": [
      "Smart Maintenance Mode WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-12769",
    "description": "The Simple Banner  WordPress plugin before 3.0.4 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Simple Banner WordPress plugin allows high privilege users to perform Stored Cross-Site Scripting attacks, even when certain security measures are in place. Users of the plugin should update to version 3.0.4 to protect against this threat.",
    "software": [
      "Simple Banner",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-13118",
    "description": "The IP Based Login WordPress plugin before 2.4.1 does not have CSRF checks in some places, which could allow attackers to make logged in users delete all logs via a CSRF attack",
    "summary": "The IP Based Login WordPress plugin version before 2.4.1 is vulnerable to CSRF attacks, which could allow malicious hackers to make logged-in users delete all logs. This could potentially affect any WordPress website using this plugin. Users should update the plugin to version 2.4.1 or higher to mitigate this threat.",
    "software": [
      "IP Based Login WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13122",
    "description": "The AFI  WordPress plugin before 1.100.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the AFI WordPress plugin could allow high privilege users, like administrators, to execute malicious code on a website through stored cross-site scripting attacks. This could affect users of the AFI plugin on their WordPress sites, particularly in multi-site setups. To mitigate this risk, users are advised to update their plugin to version 1.100.0 or newer, which includes a fix for this issue.",
    "software": [
      "AFI WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13123",
    "description": "The AFI  WordPress plugin before 1.100.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The AFI WordPress plugin before version 1.100.0 is vulnerable to a Stored Cross-Site Scripting attack, which could allow high privilege users like administrators to execute malicious code. This vulnerability could affect websites using the plugin, especially in multisite setups. Users should update to the latest version of the plugin (1.100.0 or newer) to patch this issue and prevent potential attacks.",
    "software": [
      "AFI WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13617",
    "description": "The aoa-downloadable WordPress plugin through 0.1.0 doesn't validate a parameter in its download function, allowing unauthenticated attackers to download arbitrary files from the server",
    "summary": "This vulnerability in the aoa-downloadable WordPress plugin allows attackers to download any files from the server without proper validation. This affects anyone using this plugin on their WordPress site. Users should update to version 0.1.1 or higher to protect against this threat.",
    "software": [
      "aoa-downloadable",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-13618",
    "description": "The aoa-downloadable WordPress plugin through 0.1.0 lacks authorization and authentication for requests to its download.php endpoint, allowing unauthenticated visitors to make requests to arbitrary URLs.",
    "summary": "The aoa-downloadable WordPress plugin version 0.1.0 and earlier does not require authentication for requests to its download.php endpoint, allowing unauthorized users to access and download files from arbitrary URLs. This vulnerability affects anyone using the aoa-downloadable plugin. To mitigate the risk, users should update their plugin to the latest version and ensure proper authorization and authentication mechanisms are in place for accessing files.",
    "software": [
      "aoa-downloadable WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13863",
    "description": "The Stylish Google Sheet Reader 4.0  WordPress plugin before 4.1 does not sanitise and escape a parameter before outputting it back in the page, leading to a Reflected Cross-Site Scripting which could be used against high privilege users such as admin",
    "summary": "The Stylish Google Sheet Reader 4.0 WordPress plugin has a security vulnerability that could allow hackers to execute malicious scripts on a website, targeting high privilege users like admins. Website owners using this plugin should update to version 4.1 or newer to protect against this threat.",
    "software": [
      "Stylish Google Sheet Reader 4.0 WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-44903",
    "description": "SQL Injection can occur in the SirsiDynix Horizon Information Portal (IPAC20) through 3.25_9382; however, a patch is available from the vendor. This is in ipac.jsp in a SELECT WHERE statement, in a part of the uri= variable in the second part of the full= inner variable.",
    "summary": "SQL Injection can occur in the SirsiDynix Horizon Information Portal software version 3.25_9382. This vulnerability could potentially be exploited by attackers to access or manipulate the database. Users of this software should apply the patch provided by the vendor to protect against this threat.",
    "software": [
      "SirsiDynix Horizon Information Portal (IPAC20)"
    ]
  },
  {
    "cve_id": "CVE-2024-9770",
    "description": "The WP-Recall  WordPress plugin before 16.26.12 does not sanitize and escape a parameter before using it in a SQL statement, allowing admins to perform SQL injection attacks",
    "summary": "This vulnerability in the WP-Recall WordPress plugin allows attackers to perform SQL injection attacks. It affects users of the plugin who have not updated to version 16.26.12. To protect against this threat, users should update their WP-Recall plugin to the latest version as soon as possible.",
    "software": [
      "WP-Recall"
    ]
  },
  {
    "cve_id": "CVE-2025-0717",
    "description": "To exploit the vulnerability, it is necessary:",
    "summary": "CVE-2021-44228 is a vulnerability that affects Apache Log4j, a widely used logging library in Java applications. The threat is that attackers can exploit this vulnerability to remotely execute malicious code on affected systems, potentially leading to unauthorized access or data theft. Anyone using Apache Log4j in their Java applications is affected and should update to the latest version or apply the recommended patches to protect their systems.",
    "software": []
  },
  {
    "cve_id": "CVE-2025-0845",
    "description": "The DesignThemes Core Features plugin for WordPress is vulnerable to Stored Cross-Site Scripting via shortcodes in versions up to, and including, 4.8 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers with contributor-level and above permissions to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The DesignThemes Core Features plugin for WordPress is at risk of a security threat called Stored Cross-Site Scripting. This vulnerability affects versions up to 4.8, allowing authenticated attackers with contributor-level or higher permissions to insert harmful web scripts in pages. Users should update the plugin to the latest version to prevent potential attacks.",
    "software": [
      "DesignThemes Core Features plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1452",
    "description": "The Favorites WordPress plugin before 2.3.5 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Favorites WordPress plugin version before 2.3.5 is vulnerable to Stored Cross-Site Scripting attacks, which could be exploited by high privilege users like admins. This can affect websites using this plugin, especially in multisite setups. Users should update to the latest version (2.3.5) to mitigate this security risk.",
    "software": [
      "Favorites WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1798",
    "description": "The  does not sanitise and escape some parameters when outputting them back in a page, allowing unauthenticated users the ability to perform stored Cross-Site Scripting attacks.",
    "summary": "This vulnerability allows attackers to inject malicious code into a webpage, potentially impacting unauthenticated users. To mitigate this threat, it is important for website administrators to properly sanitize and escape parameters to prevent Cross-Site Scripting attacks.",
    "software": [
      "The"
    ]
  },
  {
    "cve_id": "CVE-2025-27809",
    "description": "Mbed TLS before 2.28.10 and 3.x before 3.6.3, on the client side, accepts servers that have trusted certificates for arbitrary hostnames unless the TLS client application calls mbedtls_ssl_set_hostname.",
    "summary": "This vulnerability in Mbed TLS allows servers with trusted certificates to be accepted for any hostname unless specific action is taken by the TLS client application. This could potentially lead to man-in-the-middle attacks. Users of Mbed TLS versions before 2.28.10 and 3.x before 3.6.3 should update to the latest version and ensure that the mbedtls_ssl_set_hostname function is called in their TLS client application to protect against this threat.",
    "software": [
      "Mbed TLS"
    ]
  },
  {
    "cve_id": "CVE-2025-27810",
    "description": "Mbed TLS before 2.28.10 and 3.x before 3.6.3, in some cases of failed memory allocation or hardware errors, uses uninitialized stack memory to compose the TLS Finished message, potentially leading to authentication bypasses such as replays.",
    "summary": "This vulnerability in Mbed TLS software could allow an attacker to bypass authentication and potentially replay attacks if certain memory allocation failures or hardware errors occur. This issue affects versions before 2.28.10 and 3.x before 3.6.3. Users are advised to update to the latest available version to prevent exploitation of this vulnerability.",
    "software": [
      "Mbed TLS"
    ]
  },
  {
    "cve_id": "CVE-2025-2224",
    "description": "The Directorist: AI-Powered Business Directory Plugin with Classified Ads Listings plugin for WordPress is vulnerable to unauthorized access  and modification of data due to a missing capability check on the 'parse_query' function in all versions up to, and including, 8.2. This makes it possible for unauthenticated attackers to update the post_status of any post to 'publish'.",
    "summary": "The Directorist plugin for WordPress is vulnerable to unauthorized access, allowing attackers to change the status of posts to 'publish'. This could affect any website using this plugin. Users should update to version 8.3 or higher to fix this issue.",
    "software": [
      "Directorist: AI-Powered Business Directory Plugin with Classified Ads Listings plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2737",
    "description": "A vulnerability was found in PHPGurukul Old Age Home Management System 1.0. It has been classified as critical. This affects an unknown part of the file /admin/contactus.php. The manipulation of the argument pagetitle leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Old Age Home Management System 1.0 has a critical vulnerability that allows for SQL injection through manipulation of the pagetitle argument in the contactus.php file. This can be exploited remotely, posing a security threat. Users of this system should take immediate action to update to a patched version or apply necessary security measures to protect against potential attacks.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2738",
    "description": "A vulnerability was found in PHPGurukul Old Age Home Management System 1.0. It has been declared as critical. This vulnerability affects unknown code of the file /admin/manage-scdetails.php. The manipulation of the argument namesc leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability found in PHPGurukul Old Age Home Management System could allow hackers to manipulate code and launch a remote SQL injection attack. This could affect anyone using the management system. Users should update to the latest version to protect against this exploit.",
    "software": [
      "PHPGurukul Old Age Home Management System 1.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2739",
    "description": "A vulnerability was found in PHPGurukul Old Age Home Management System 1.0. It has been rated as critical. This issue affects some unknown processing of the file /admin/manage-services.php. The manipulation of the argument sertitle leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul Old Age Home Management System 1.0 allows for a SQL injection attack by manipulating the argument sertitle in the file /admin/manage-services.php. This can be exploited remotely and has been disclosed to the public. Users of this system should update to a secure version immediately to prevent any potential attacks.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2024-12623",
    "description": "The DICOM Support plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's 'dcm' shortcode in all versions up to, and including, 0.10.6 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The DICOM Support plugin for WordPress is at risk of a Stored Cross-Site Scripting attack, which allows authenticated attackers with contributor-level access or higher to inject malicious scripts into pages. This could affect anyone using the plugin in versions up to 0.10.6. To mitigate this risk, users should update the plugin to a version beyond 0.10.6 or consider disabling the plugin altogether.",
    "software": [
      "DICOM Support plugin",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-1320",
    "description": "The teachPress plugin for WordPress is vulnerable to Cross-Site Request Forgery in all versions up to, and including, 9.0.9. This is due to missing or incorrect nonce validation on the import.php page. This makes it possible for unauthenticated attackers to delete imports via a forged request granted they can trick a site administrator into performing an action such as clicking on a link.",
    "summary": "The teachPress plugin for WordPress is affected by a security vulnerability that allows unauthorized attackers to delete imports if they can trick a site administrator into clicking on a link. Users of this plugin should update to version 9.1 or later to protect against this threat.",
    "software": [
      "teachPress plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2252",
    "description": "The Easy Digital Downloads – eCommerce Payments and Subscriptions made easy plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 3.3.6.1 via the edd_ajax_get_download_title() function. This makes it possible for unauthenticated attackers to extract private post titles of downloads. The impact here is minimal.",
    "summary": "The Easy Digital Downloads plugin for WordPress is at risk of exposing private post titles of downloads to unauthorized attackers. This could potentially impact users of the plugin, but the risk is considered low. Users should update to version 3.3.7 or higher to protect against this vulnerability.",
    "software": [
      "Easy Digital Downloads – eCommerce Payments and Subscriptions"
    ]
  },
  {
    "cve_id": "CVE-2025-2740",
    "description": "A vulnerability classified as critical has been found in PHPGurukul Old Age Home Management System 1.0. Affected is an unknown function of the file /admin/eligibility.php. The manipulation of the argument pagetitle leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul Old Age Home Management System 1.0 allows for SQL injection through the manipulation of a specific file. This vulnerability can be exploited remotely, and the exploit has been made public. Users of this system should update or patch their software to prevent attacks.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2742",
    "description": "A vulnerability classified as critical was found in zhijiantianya ruoyi-vue-pro 2.4.1. This vulnerability affects unknown code of the file /admin-api/mp/material/upload-permanent of the component Material Upload Interface. The manipulation of the argument File leads to path traversal. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A critical vulnerability was found in the zhijiantianya ruoyi-vue-pro 2.4.1 software, specifically in the Material Upload Interface component. This vulnerability allows for remote attackers to manipulate a file argument and potentially perform a path traversal attack. The exploit has been made public and could be used by malicious actors. Users of this software should take immediate action to protect their systems, such as applying any patches or updates provided by the vendor, if available. It is concerning that the vendor did not respond to the disclosure of this vulnerability.",
    "software": [
      "zhijiantianya ruoyi-vue-pro"
    ]
  },
  {
    "cve_id": "CVE-2025-2743",
    "description": "A vulnerability, which was classified as problematic, has been found in zhijiantianya ruoyi-vue-pro 2.4.1. This issue affects some unknown processing of the file /admin-api/mp/material/upload-temporary of the component Material Upload Interface. The manipulation of the argument File leads to path traversal. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A vulnerability has been found in zhijiantianya ruoyi-vue-pro 2.4.1 that can be exploited to perform a path traversal attack. This vulnerability affects the Material Upload Interface component of the software. The attack can be initiated remotely and may allow an attacker to access unauthorized files. It is recommended to update the software to the latest version to mitigate the risk of exploitation. The vendor has been made aware of the issue but has not responded.",
    "software": [
      "zhijiantianya ruoyi-vue-pro"
    ]
  },
  {
    "cve_id": "CVE-2025-2744",
    "description": "A vulnerability, which was classified as critical, was found in zhijiantianya ruoyi-vue-pro 2.4.1. Affected is an unknown function of the file /admin-api/mp/material/upload-news-image of the component Material Upload Interface. The manipulation of the argument File leads to path traversal. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability found in a specific software component allows attackers to remotely manipulate files and launch attacks through path traversal. It affects users of the zhijiantianya ruoyi-vue-pro 2.4.1 software. To protect against this threat, users should update their software to a secure version as soon as possible. The vendor has been notified of the issue but has not responded.",
    "software": [
      "zhijiantianya ruoyi-vue-pro"
    ]
  },
  {
    "cve_id": "CVE-2025-2750",
    "description": "A vulnerability, which was classified as critical, was found in Open Asset Import Library Assimp 5.4.3. This affects the function Assimp::CSMImporter::InternReadFile of the file code/AssetLib/CSM/CSMLoader.cpp of the component CSM File Handler. The manipulation leads to out-of-bounds write. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The Open Asset Import Library (Assimp) version 5.4.3 has a critical vulnerability that allows for out-of-bounds write attacks in the CSM File Handler component. This vulnerability could be exploited remotely and has been made public, making it a potential threat to users. Users of Assimp version 5.4.3 should update to a patched version as soon as possible to protect against this exploit.",
    "software": [
      "Open Asset Import Library",
      "Assimp"
    ]
  },
  {
    "cve_id": "CVE-2025-2751",
    "description": "A vulnerability has been found in Open Asset Import Library Assimp 5.4.3 and classified as problematic. This vulnerability affects the function Assimp::CSMImporter::InternReadFile of the file code/AssetLib/CSM/CSMLoader.cpp of the component CSM File Handler. The manipulation of the argument na leads to out-of-bounds read. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This CVE describes a vulnerability in Open Asset Import Library Assimp 5.4.3 that could allow for remote attackers to cause an out-of-bounds read by manipulating a specific argument in the code. This vulnerability affects users of Assimp 5.4.3 and may be exploited by attackers. Users should update to a patched version of the software to mitigate this risk.",
    "software": [
      "Open Asset Import Library Assimp"
    ]
  },
  {
    "cve_id": "CVE-2025-2752",
    "description": "A vulnerability was found in Open Asset Import Library Assimp 5.4.3 and classified as problematic. This issue affects the function fast_atoreal_move in the library include/assimp/fast_atof.h of the component CSM File Handler. The manipulation leads to out-of-bounds read. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in Open Asset Import Library Assimp 5.4.3 allows for out-of-bounds read when manipulating the fast_atoreal_move function in the CSM File Handler component. It can be exploited remotely and has been publicly disclosed. Users of this library should update to a version that addresses this issue to prevent potential attacks.",
    "software": [
      "Open Asset Import Library Assimp",
      "CSM File Handler"
    ]
  },
  {
    "cve_id": "CVE-2024-13690",
    "description": "The WP Church Donation plugin for WordPress is vulnerable to Stored Cross-Site Scripting via several donation form submission parameters in all versions up to, and including, 1.7 due to insufficient input sanitization and output escaping. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The WP Church Donation plugin for WordPress allows unauthenticated attackers to inject malicious scripts into website pages, potentially affecting anyone using the plugin. To protect against this vulnerability, users should update to version 1.8 or higher, which includes improved input sanitization and output escaping.",
    "software": [
      "WP Church Donation plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13710",
    "description": "The Estatebud – Properties & Listings plugin for WordPress is vulnerable to Cross-Site Request Forgery in all versions up to, and including, 5.5.0. This is due to missing or incorrect nonce validation on the 'estatebud_settings' page. This makes it possible for unauthenticated attackers to update the plugin's settings via a forged request granted they can trick a site administrator into performing an action such as clicking on a link.",
    "summary": "The Estatebud – Properties & Listings plugin for WordPress has a security vulnerability that allows attackers to manipulate settings on a website without authentication. This affects all versions up to 5.5.0. Site administrators should update to the latest version to prevent this threat.",
    "software": [
      "Estatebud – Properties & Listings plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-13731",
    "description": "The Alert Box Block – Display notice/alerts in the front end. plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's Alert Box block in all versions up to, and including, 1.1.2 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The Alert Box Block plugin for WordPress is at risk of a stored cross-site scripting attack, which could allow authenticated attackers with contributor-level access or above to inject harmful scripts into webpages. This vulnerability affects all versions up to 1.1.2. WordPress users should update to version 1.1.3 or higher to mitigate this risk.",
    "software": [
      "WordPress",
      "Alert Box Block"
    ]
  },
  {
    "cve_id": "CVE-2025-2319",
    "description": "The EZ SQL Reports Shortcode Widget and DB Backup plugin for WordPress is vulnerable to Cross-Site Request Forgery in versions 4.11.13 to 5.25.08. This is due to missing or incorrect nonce validation on the 'ELISQLREPORTS_menu' function. This makes it possible for unauthenticated attackers to execute code on the server via a forged request granted they can trick a site administrator into performing an action such as clicking on a link. Version 5.25.10 adds a nonce check, which makes this vulnerability exploitable by admins only.",
    "summary": "The EZ SQL Reports Shortcode Widget and DB Backup plugin for WordPress is vulnerable to a Cross-Site Request Forgery attack, which can allow attackers to execute code on the server. This affects users of versions 4.11.13 to 5.25.08 of the plugin. To protect against this threat, users should update their plugin to version 5.25.10 or newer, which adds a nonce check to prevent unauthorized access.",
    "software": [
      "EZ SQL Reports Shortcode Widget",
      "DB Backup plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2510",
    "description": "The Frndzk Expandable Bottom Bar plugin for WordPress is vulnerable to Stored Cross-Site Scripting via 'text' parameter in all versions up to, and including, 1.0 due to insufficient input sanitization and output escaping. This makes it possible for authenticated attackers, with administrator-level permissions and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page. This only affects multi-site installations and installations where unfiltered_html has been disabled.",
    "summary": "The Frndzk Expandable Bottom Bar plugin for WordPress has a security vulnerability that allows authenticated attackers with administrator-level permissions to insert harmful web scripts on pages. This affects users of multi-site installations and installations where unfiltered_html has been disabled. Users should update to version 1.1 or higher to patch this vulnerability and protect their website from attacks.",
    "software": [
      "Frndzk Expandable Bottom Bar",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2559",
    "description": "A flaw was found in Keycloak. When the configuration uses JWT tokens for authentication, the tokens are cached until expiration. If a client uses JWT tokens with an excessively long expiration time, for example, 24 or 48 hours, the cache can grow indefinitely, leading to an OutOfMemoryError. This issue could result in a denial of service condition, preventing legitimate users from accessing the system.",
    "summary": "The flaw in Keycloak allows for an OutOfMemoryError to occur when using JWT tokens with excessively long expiration times, potentially leading to a denial of service attack. This affects systems using Keycloak for authentication. To mitigate this issue, users should ensure that JWT tokens have appropriate expiration times to prevent the cache from growing indefinitely.",
    "software": [
      "Keycloak"
    ]
  },
  {
    "cve_id": "CVE-2025-2753",
    "description": "A vulnerability was found in Open Asset Import Library Assimp 5.4.3. It has been classified as critical. Affected is the function SceneCombiner::MergeScenes of the file code/AssetLib/LWS/LWSLoader.cpp of the component LWS File Handler. The manipulation leads to out-of-bounds read. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The Open Asset Import Library Assimp version 5.4.3 has a critical vulnerability that affects the function SceneCombiner::MergeScenes in the LWS File Handler component. This vulnerability could allow an attacker to conduct an out-of-bounds read attack remotely. Users of this library should update to a patched version as soon as possible to protect against potential exploitation.",
    "software": [
      "Open Asset Import Library Assimp",
      "LWS File Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2754",
    "description": "A vulnerability was found in Open Asset Import Library Assimp 5.4.3. It has been declared as critical. Affected by this vulnerability is the function Assimp::AC3DImporter::ConvertObjectSection of the file code/AssetLib/AC/ACLoader.cpp of the component AC3D File Handler. The manipulation of the argument it leads to heap-based buffer overflow. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The vulnerability in Open Asset Import Library Assimp 5.4.3 allows for a remote attacker to execute a heap-based buffer overflow by manipulating a specific function. This vulnerability affects users of this library. To mitigate the risk, users should update to a patched version of the library as soon as possible.",
    "software": [
      "Open Asset Import Library Assimp",
      "AC3DImporter",
      "ACLoader.cpp",
      "AC3D File Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2755",
    "description": "A vulnerability was found in Open Asset Import Library Assimp 5.4.3. It has been rated as critical. Affected by this issue is the function Assimp::AC3DImporter::ConvertObjectSection of the file code/AssetLib/AC/ACLoader.cpp of the component AC3D File Handler. The manipulation of the argument src.entries leads to out-of-bounds read. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "A critical vulnerability has been found in Open Asset Import Library Assimp 5.4.3, specifically affecting the AC3D File Handler component. The vulnerability may allow for remote attackers to launch an out-of-bounds read attack by manipulating a certain argument. Users of this software should update to the latest version to protect against potential attacks.",
    "software": [
      "Open Asset Import Library Assimp",
      "AC3DImporter",
      "ACLoader.cpp",
      "AC3D File Handler"
    ]
  },
  {
    "cve_id": "CVE-2024-53678",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Apache VCL. Users can modify form data submitted when requesting a new Block Allocation such that a SELECT SQL statement is modified. The data returned by the SELECT statement is not viewable by the attacker.\n\nThis issue affects all versions of Apache VCL from 2.2 through 2.5.1.\n\nUsers are recommended to upgrade to version 2.5.2, which fixes the issue.",
    "summary": "The Apache VCL software is vulnerable to an 'SQL Injection' attack, where users can modify form data to alter SQL commands and potentially access sensitive data. This vulnerability affects all versions of Apache VCL from 2.2 through 2.5.1. Users should upgrade to version 2.5.2 to protect against this threat.",
    "software": [
      "Apache VCL"
    ]
  },
  {
    "cve_id": "CVE-2024-53679",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Apache VCL in the User Lookup form. A user with sufficient rights to be able to view this part of the site can craft a URL or be tricked in to clicking a URL that will give a specified user elevated rights.\n\n\n\nThis issue affects all versions of Apache VCL through 2.5.1.\n\n\n\nUsers are recommended to upgrade to version 2.5.2, which fixes the issue.",
    "summary": "The Apache VCL software has a vulnerability that allows a user to manipulate a URL link and gain elevated rights on the website. This affects all versions of Apache VCL up to 2.5.1. To mitigate this threat, users should update their software to version 2.5.2, which includes a fix for this issue.",
    "software": [
      "Apache VCL"
    ]
  },
  {
    "cve_id": "CVE-2025-2542",
    "description": "The Your Simple SVG Support plugin for WordPress is vulnerable to Stored Cross-Site Scripting via SVG File uploads in all versions up to, and including, 1.0.1 due to insufficient input sanitization and output escaping. This makes it possible for authenticated attackers, with Author-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses the SVG file.",
    "summary": "\nThis vulnerability in the Your Simple SVG Support WordPress plugin allows attackers with certain levels of access to upload SVG files containing malicious scripts that can be executed by unsuspecting users. Users of this plugin should update to version 1.0.2 or later to protect against this threat.",
    "software": [
      "Your Simple SVG Support plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2635",
    "description": "The Digital License Manager plugin for WordPress is vulnerable to Reflected Cross-Site Scripting due to the use of remove_query_arg() function without appropriate escaping on the URL in all versions up to, and including, 1.7.3. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that execute if they can successfully trick a user into performing an action such as clicking on a link.",
    "summary": "The Digital License Manager plugin for WordPress has a vulnerability that allows attackers to inject harmful scripts into web pages. This could affect anyone using the plugin up to version 1.7.3. To protect against this, users should update to the latest version of the plugin.",
    "software": [
      "Digital License Manager plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2756",
    "description": "A vulnerability classified as critical has been found in Open Asset Import Library Assimp 5.4.3. This affects the function Assimp::AC3DImporter::ConvertObjectSection of the file code/AssetLib/AC/ACLoader.cpp of the component AC3D File Handler. The manipulation of the argument tmp leads to heap-based buffer overflow. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This critical vulnerability in Open Asset Import Library Assimp 5.4.3 allows for a remote attacker to cause a heap-based buffer overflow by manipulating a certain argument. This vulnerability affects users of Assimp 5.4.3 who utilize the AC3DImporter::ConvertObjectSection function. To protect against potential attacks, users should update to a version of Assimp that has addressed this vulnerability.",
    "software": [
      "Open Asset Import Library Assimp",
      "AC3DImporter",
      "ACLoader.cpp"
    ]
  },
  {
    "cve_id": "CVE-2025-2757",
    "description": "A vulnerability classified as critical was found in Open Asset Import Library Assimp 5.4.3. This vulnerability affects the function AI_MD5_PARSE_STRING_IN_QUOTATION of the file code/AssetLib/MD5/MD5Parser.cpp of the component MD5 File Handler. The manipulation of the argument data leads to heap-based buffer overflow. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The Open Asset Import Library Assimp 5.4.3 has a critical vulnerability that can be exploited by manipulating data to cause a heap-based buffer overflow in the MD5 File Handler component. This can be done remotely and may lead to a security breach. Users of this library should update to the latest version or apply provided patches to fix the vulnerability and prevent potential attacks.",
    "software": [
      "Open Asset Import Library Assimp"
    ]
  },
  {
    "cve_id": "CVE-2025-2109",
    "description": "The WP Compress – Instant Performance & Speed Optimization plugin for WordPress is vulnerable to Server-Side Request Forgery in all versions up to, and including, 6.30.15 via the init() function. This makes it possible for unauthenticated attackers to make web requests to arbitrary locations originating from the web application and can be used to query information from internal services.",
    "summary": "This plugin for WordPress is at risk of Server-Side Request Forgery, which allows attackers to make unauthorized web requests and potentially access sensitive information. Users of the WP Compress plugin should update to version 6.30.16 or later to protect against this vulnerability.",
    "software": [
      "WP Compress"
    ]
  }
]