[
  {
    "cve_id": "CVE-2025-1097",
    "description": "A security issue was discovered in  ingress-nginx https://github.com/kubernetes/ingress-nginx  where the `auth-tls-match-cn` Ingress annotation can be used to inject configuration into nginx. This can lead to arbitrary code execution in the context of the ingress-nginx controller, and disclosure of Secrets accessible to the controller. (Note that in the default installation, the controller can access all Secrets cluster-wide.)",
    "summary": "A vulnerability in ingress-nginx allows attackers to inject code into nginx using a specific Ingress annotation, leading to arbitrary code execution and potential exposure of Secrets stored by the controller. This affects users of Kubernetes using ingress-nginx. To protect against this threat, users should update to the latest version of ingress-nginx and apply any relevant patches or fixes.",
    "software": [
      "ingress-nginx"
    ]
  },
  {
    "cve_id": "CVE-2025-1098",
    "description": "A security issue was discovered in  ingress-nginx https://github.com/kubernetes/ingress-nginx  where the `mirror-target` and `mirror-host` Ingress annotations can be used to inject arbitrary configuration into nginx. This can lead to arbitrary code execution in the context of the ingress-nginx controller, and disclosure of Secrets accessible to the controller. (Note that in the default installation, the controller can access all Secrets cluster-wide.)",
    "summary": "This security issue in the ingress-nginx software allows attackers to inject harmful code into the system, potentially leading to arbitrary code execution and exposing sensitive data. Users of ingress-nginx are at risk of being affected by this vulnerability. To mitigate the threat, users should update their software to the latest version that includes a patch for this issue.",
    "software": [
      "ingress-nginx"
    ]
  },
  {
    "cve_id": "CVE-2025-1974",
    "description": "A security issue was discovered in Kubernetes where under certain conditions, an unauthenticated attacker with access to the pod network can achieve arbitrary code execution in the context of the ingress-nginx controller. This can lead to disclosure of Secrets accessible to the controller. (Note that in the default installation, the controller can access all Secrets cluster-wide.)",
    "summary": "This security vulnerability in Kubernetes allows an unauthorized attacker to execute code and access sensitive information such as secrets. It affects any organizations using Kubernetes with the ingress-nginx controller. To protect against this threat, it is recommended to update the Kubernetes software to the latest version and restrict access to the pod network to only trusted users.",
    "software": [
      "Kubernetes",
      "ingress-nginx controller"
    ]
  },
  {
    "cve_id": "CVE-2025-24513",
    "description": "A security issue was discovered in  ingress-nginx https://github.com/kubernetes/ingress-nginx  where attacker-provided data are included in a filename by the ingress-nginx Admission Controller feature, resulting in directory traversal within the container. This could result in denial of service, or when combined with other vulnerabilities, limited disclosure of Secret objects from the cluster.",
    "summary": "This security issue in the ingress-nginx software can allow attackers to access and manipulate files within a container, potentially leading to denial of service or exposure of sensitive information. Users of ingress-nginx should update to the latest version to mitigate this risk.",
    "software": [
      "ingress-nginx Admission Controller feature"
    ]
  },
  {
    "cve_id": "CVE-2025-24514",
    "description": "A security issue was discovered in  ingress-nginx https://github.com/kubernetes/ingress-nginx  where the `auth-url` Ingress annotation can be used to inject configuration into nginx. This can lead to arbitrary code execution in the context of the ingress-nginx controller, and disclosure of Secrets accessible to the controller. (Note that in the default installation, the controller can access all Secrets cluster-wide.)",
    "summary": "The security issue in the ingress-nginx software allows attackers to inject malicious configuration through the `auth-url` annotation, which can result in executing arbitrary code and leaking sensitive information like Secrets. This impacts users of the ingress-nginx software, which is commonly used in Kubernetes environments. It is recommended to update the software to the latest version to mitigate this vulnerability.",
    "software": [
      "ingress-nginx"
    ]
  },
  {
    "cve_id": "CVE-2025-2717",
    "description": "A vulnerability, which was classified as critical, has been found in D-Link DIR-823X 240126/240802. This issue affects the function sub_41710C of the file /goform/diag_nslookup of the component HTTP POST Request Handler. The manipulation of the argument target_addr leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "A critical vulnerability has been discovered in the D-Link DIR-823X router, which allows remote attackers to execute arbitrary commands on the device by manipulating certain parameters. This vulnerability affects users of this specific model of D-Link routers and can be exploited remotely. It is recommended to update the firmware of the router to the latest version to patch this vulnerability and prevent potential attacks.",
    "software": [
      "D-Link DIR-823X"
    ]
  },
  {
    "cve_id": "CVE-2025-2720",
    "description": "A vulnerability was found in GNOME libgsf up to 1.14.53 and classified as problematic. Affected by this issue is the function gsf_base64_encode_simple. The manipulation of the argument size leads to use of uninitialized variable. The attack needs to be approached locally. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The GNOME libgsf software has a vulnerability that could be exploited by an attacker to use uninitialized variables via a function called gsf_base64_encode_simple. This vulnerability can be used by someone with local access to the system. It is recommended to update GNOME libgsf to the latest version to fix this issue. The vendor has been notified about the vulnerability but has not responded.",
    "software": [
      "GNOME libgsf"
    ]
  },
  {
    "cve_id": "CVE-2025-2721",
    "description": "A vulnerability was found in GNOME libgsf up to 1.14.53. It has been classified as critical. This affects the function gsf_base64_encode_simple. The manipulation of the argument size_t leads to heap-based buffer overflow. An attack has to be approached locally. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The vulnerability in GNOME libgsf could allow an attacker to remotely execute code on a targeted system through a heap-based buffer overflow. This threat impacts users of GNOME libgsf up to version 1.14.53. To mitigate this risk, users should update to the latest version of GNOME libgsf as soon as possible.",
    "software": [
      "GNOME libgsf"
    ]
  },
  {
    "cve_id": "CVE-2025-2722",
    "description": "A vulnerability was found in GNOME libgsf up to 1.14.53. It has been declared as critical. This vulnerability affects the function gsf_prop_settings_collect_va. The manipulation of the argument n_alloced_params leads to heap-based buffer overflow. Local access is required to approach this attack. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in GNOME libgsf up to version 1.14.53 allows for a critical heap-based buffer overflow attack. It can only be accessed locally, meaning the attacker needs physical access to the device. The vendor has not responded to this disclosure. Users should be aware of this vulnerability, consider restricting physical access to their devices, and look out for any updates or patches from the vendor to address this issue.",
    "software": [
      "GNOME libgsf"
    ]
  },
  {
    "cve_id": "CVE-2025-2723",
    "description": "A vulnerability was found in GNOME libgsf up to 1.14.53. It has been rated as critical. This issue affects the function gsf_property_settings_collec. The manipulation of the argument n_alloced_params leads to heap-based buffer overflow. Attacking locally is a requirement. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This CVE (Common Vulnerabilities and Exposures) relates to a critical vulnerability found in GNOME libgsf software, which could be exploited by a local attacker to cause a heap-based buffer overflow. This vulnerability affects versions up to 1.14.53 of the software. The vendor was notified about the issue but did not respond. Users should update to the latest version of the software to protect against potential attacks.",
    "software": [
      "GNOME libgsf"
    ]
  },
  {
    "cve_id": "CVE-2025-2724",
    "description": "A vulnerability classified as problematic has been found in GNOME libgsf up to 1.14.53. Affected is the function sorting_key_copy. The manipulation of the argument Name leads to out-of-bounds read. It is possible to launch the attack on the local host. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The vulnerability in GNOME libgsf up to version 1.14.53 allows for a possible attack on the local host by manipulating the argument Name, leading to an out-of-bounds read. This could potentially affect users of GNOME libgsf. Users are advised to be cautious and take preventive measures to protect their systems, as the vendor has not responded to the disclosure.",
    "software": [
      "GNOME libgsf"
    ]
  },
  {
    "cve_id": "CVE-2025-2725",
    "description": "A vulnerability classified as critical was found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. Affected by this vulnerability is an unknown functionality of the file /api/login/auth of the component HTTP POST Request Handler. The manipulation leads to command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This critical vulnerability affects several H3C Magic products and could allow remote attackers to execute commands on the affected devices. Users should take immediate action to update to the latest version (V100R014) to fix this issue and prevent potential cyber attacks. The vendor has been informed about the vulnerability but has not responded, so users should take precautionary measures to protect their systems.",
    "software": [
      "H3C Magic NX15",
      "Magic NX30 Pro",
      "Magic NX400",
      "Magic R3010",
      "Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2025-2726",
    "description": "A vulnerability, which was classified as critical, has been found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. Affected by this issue is some unknown functionality of the file /api/esps of the component HTTP POST Request Handler. The manipulation leads to command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "Vulnerability found in H3C networking devices allows remote attackers to execute commands on the system through manipulation of an HTTP POST request. This affects several models including Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010, and Magic BE18000 up to version V100R014. Users should update their devices to a secure version as soon as possible to mitigate the risk of exploitation. The vendor has not responded to attempts to address the issue.",
    "software": [
      "H3C Magic NX15",
      "Magic NX30 Pro",
      "Magic NX400",
      "Magic R3010",
      "Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2025-2727",
    "description": "A vulnerability, which was classified as critical, was found in H3C Magic NX30 Pro up to V100R007. This affects an unknown part of the file /api/wizard/getNetworkStatus of the component HTTP POST Request Handler. The manipulation leads to command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This critical vulnerability was found in H3C Magic NX30 Pro software. It can be exploited remotely to inject malicious commands. Users of this software should take immediate action to protect their network security, as the exploit has been disclosed to the public and the vendor has not responded to the issue.",
    "software": [
      "H3C Magic NX30 Pro"
    ]
  },
  {
    "cve_id": "CVE-2025-2728",
    "description": "A vulnerability has been found in H3C Magic NX30 Pro and Magic NX400 up to V100R014 and classified as critical. This vulnerability affects unknown code of the file /api/wizard/getNetworkConf. The manipulation leads to command injection. The attack can be initiated remotely. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability affects H3C Magic NX30 Pro and Magic NX400 devices, allowing attackers to inject commands remotely. The vendor has not responded to the disclosure. Users should update their devices to the latest software version to protect against this threat.",
    "software": [
      "H3C Magic NX30 Pro",
      "Magic NX400 up to V100R014"
    ]
  },
  {
    "cve_id": "CVE-2025-2729",
    "description": "A vulnerability was found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014 and classified as critical. This issue affects some unknown processing of the file /api/wizard/networkSetup of the component HTTP POST Request Handler. The manipulation leads to command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability found in certain H3C networking devices allows for remote attackers to execute commands on the system by manipulating a specific file. This could potentially cause harm to the affected systems. To protect against this threat, it is recommended to update the affected devices to a version beyond V100R014 and monitor for any unusual activity on the network.",
    "software": [
      "H3C Magic NX15",
      "Magic NX30 Pro",
      "Magic NX400",
      "Magic R3010",
      "Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2025-2730",
    "description": "A vulnerability was found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. It has been classified as critical. Affected is an unknown function of the file /api/wizard/getssidname of the component HTTP POST Request Handler. The manipulation leads to command injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This CVE describes a critical vulnerability in certain H3C networking devices, which could allow remote attackers to inject commands into the system. The vulnerability affects several models up to a certain software version. Users of these devices should take immediate action to update their software to a secure version. The vendor has not responded to the disclosure of this exploit, so users should be extra cautious.",
    "software": [
      "H3C Magic NX15",
      "Magic NX30 Pro",
      "Magic NX400",
      "Magic R3010",
      "Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2025-2731",
    "description": "A vulnerability was found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file /api/wizard/getDualbandSync of the component HTTP POST Request Handler. The manipulation leads to command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This CVE refers to a critical vulnerability found in H3C networking devices, specifically the Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010, and Magic BE18000 up to version V100R014. The vulnerability allows for command injection through manipulation of a specific file, leading to potential remote attacks. The exploit has been publicly disclosed and may be utilized by malicious actors. Users of these devices are advised to take immediate action to mitigate the risk, such as implementing security patches if available or contacting the vendor for further guidance.",
    "software": [
      "H3C Magic NX15",
      "Magic NX30 Pro",
      "Magic NX400",
      "Magic R3010",
      "Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2025-2732",
    "description": "A vulnerability was found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. It has been rated as critical. Affected by this issue is some unknown functionality of the file /api/wizard/getWifiNeighbour of the component HTTP POST Request Handler. The manipulation leads to command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in H3C Magic networking devices allows attackers to inject commands remotely through the /api/wizard/getWifiNeighbour file, potentially causing harm. Users of the affected devices should take immediate action to secure their network and consider alternative solutions if the vendor does not address the issue promptly.",
    "software": [
      "H3C Magic NX15",
      "H3C Magic NX30 Pro",
      "H3C Magic NX400",
      "H3C Magic R3010",
      "H3C Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2024-10206",
    "description": "A Server-Side Request Forgery vulnerability in the APROL Web Portal used in B&R APROL <4.4-00P5 may allow an unauthenticated network-based attacker to force the web server to request arbitrary URLs.",
    "summary": "This vulnerability in the APROL Web Portal could allow a hacker to manipulate the web server into requesting unauthorized URLs. This could potentially lead to unauthorized access or other malicious activities. Users of B&R APROL <4.4-00P5 should update to a patched version as soon as possible to mitigate this threat.",
    "software": [
      "APROL Web Portal",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-10207",
    "description": "A Server-Side Request Forgery vulnerability in the APROL Web Portal used in B&R APROL <4.4-00P5 may allow an authenticated network-based attacker to force the web server to request arbitrary URLs.",
    "summary": "This vulnerability in the APROL Web Portal allows a malicious attacker who is connected to the same network to trick the server into accessing malicious websites without the user's consent. This can potentially lead to unauthorized access or manipulation of sensitive data. Users of B&R APROL software version <4.4-00P5 should update to the latest version to patch this vulnerability and prevent unauthorized access to their network.",
    "software": [
      "APROL Web Portal",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-10208",
    "description": "An Improper Neutralization of Input During Web Page Generation vulnerability in the APROL Web Portal used in B&R APROL <4.4-00P5 may allow an authenticated network-based attacker to insert malicious code which is then executed in the context of the user’s browser session.",
    "summary": "This vulnerability in the APROL Web Portal software could allow a hacker to insert malicious code into web pages and potentially compromise the user's browser session. It affects users of B&R APROL software versions older than 4.4-00P5. Users should update to the latest version of the software to mitigate this threat.",
    "software": [
      "APROL Web Portal",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-10209",
    "description": "An Incorrect Permission Assignment for Critical Resource vulnerability in the file system used in B&R APROL <4.4-01 may allow an authenticated local attacker to read and alter the configuration of another engineering or runtime user.",
    "summary": "This vulnerability in B&R APROL <4.4-01 file system could allow a local attacker to access and change the configurations of other users. Users of this software should update to version 4.4-01 or newer to prevent unauthorized access to sensitive information.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-45480",
    "description": "An improper control of generation of code ('Code Injection') vulnerability in the AprolCreateReport component of B&R APROL <4.4-00P5 may allow an unauthenticated network-based attacker to read files from the local system.",
    "summary": "This vulnerability in B&R APROL software allows hackers to access files on a system without being authenticated. This can affect anyone using APROL software version less than 4.4-00P5. Users should update to the latest version to protect their data.",
    "software": [
      "AprolCreateReport",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-45481",
    "description": "An Incomplete Filtering of Special Elements vulnerability in scripts using the SSH server on B&R APROL <4.4-00P5 may allow an authenticated local attacker to authenticate as another legitimate user.",
    "summary": "This vulnerability in the B&R APROL software allows a local attacker to potentially impersonate another user by exploiting incomplete filtering of special elements in scripts using the SSH server. Users of B&R APROL <4.4-00P5 should update to the latest version to mitigate this threat.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-45482",
    "description": "An Inclusion of Functionality from Untrusted Control Sphere vulnerability in the SSH server on B&R APROL <4.4-00P1 may allow an authenticated local attacker from a trusted remote server to execute malicious commands.",
    "summary": "This vulnerability in the SSH server on B&R APROL <4.4-00P1 could allow a hacker who is authenticated on a trusted remote server to execute harmful commands. Users of B&R APROL <4.4-00P1 should update to the latest version to patch this vulnerability and prevent unauthorized access to their system.",
    "software": [
      "SSH server",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-45483",
    "description": "A Missing Authentication for Critical Function vulnerability in the GRUB configuration used B&R APROL <4.4-01 may allow an unauthenticated physical attacker to alter the boot configuration of the operating system.",
    "summary": "This vulnerability in the GRUB configuration in B&R APROL software may be exploited by a physical attacker without authentication, allowing them to change the boot configuration of the system. This could lead to unauthorized access or control over the system. Users should update to version 4.4-01 or newer to address this issue and prevent potential attacks.",
    "software": [
      "GRUB",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-45484",
    "description": "An Allocation of Resources Without Limits or Throttling vulnerability in the operating system network configuration used in B&R APROL <4.4-00P5 may allow an unauthenticated adjacent attacker to per-form Denial-of-Service (DoS) attacks against the product.",
    "summary": "This vulnerability in the B&R APROL operating system network configuration could allow an attacker nearby to launch a Denial-of-Service attack on the product without needing any authentication. To protect against this, users should update to version 4.4-00P5 or higher.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-8313",
    "description": "An Exposure of Sensitive System Information to an Unauthorized Control Sphere and Initialization of a Resource with an Insecure Default vulnerability in the SNMP component of B&R APROL <4.4-00P5 may allow an unauthenticated adjacent-based attacker to read and alter configuration using SNMP.",
    "summary": "This vulnerability in the SNMP component of B&R APROL software could allow an attacker in close proximity to the system to access and change sensitive configuration information using SNMP. Users of B&R APROL software version <4.4-00P5 should update to the latest version to patch this vulnerability and prevent unauthorized access.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-8314",
    "description": "An Incorrect Implementation of Authentication Algorithm and Exposure of Data Element to Wrong Ses-sion vulnerability in the session handling used in B&R APROL <4.4-00P5 may allow an authenticated network attacker to take over a currently active user session without login credentials.",
    "summary": "This vulnerability in B&R APROL <4.4-00P5 could allow a hacker on the same network to take control of a user's session without needing to log in. Users of this software should update to the latest version to patch this vulnerability and prevent unauthorized access to their accounts.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-8315",
    "description": "An Improper Handling of Insufficient Permissions or Privileges vulnerability in scripts used in B&R APROL <4.4-00P5 may allow an authenticated local attacker to read credential information.",
    "summary": "This vulnerability in B&R APROL software could allow a local attacker with access to the system to read credential information. This vulnerability affects users of B&R APROL version <4.4-00P5. Users should update to the latest version of the software to patch this security issue.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2025-2733",
    "description": "A vulnerability classified as critical has been found in mannaandpoem OpenManus up to 2025.3.13. This affects an unknown part of the file app/tool/python_execute.py of the component Prompt Handler. The manipulation leads to os command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A critical vulnerability has been found in OpenManus up to version 2025.3.13, which allows for remote attackers to execute arbitrary operating system commands. This vulnerability affects users of the Prompt Handler component and has been publicly disclosed with no response from the vendor. Users should update to a patched version of OpenManus as soon as possible to mitigate the threat of os command injection.",
    "software": [
      "mannaandpoem OpenManus",
      "Prompt Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2734",
    "description": "A vulnerability, which was classified as critical, was found in PHPGurukul Old Age Home Management System 1.0. Affected is an unknown function of the file /admin/aboutus.php. The manipulation of the argument pagetitle leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Old Age Home Management System 1.0 has a critical vulnerability that allows for sql injection through the pagetitle function in the aboutus.php file. This vulnerability can be exploited remotely, and the exploit has been made public. Users of this system should update to a patched version immediately to prevent attacks.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2735",
    "description": "A vulnerability has been found in PHPGurukul Old Age Home Management System 1.0 and classified as critical. Affected by this vulnerability is an unknown functionality of the file /admin/add-services.php. The manipulation of the argument sertitle leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul Old Age Home Management System 1.0 allows attackers to remotely launch a SQL injection attack through the file /admin/add-services.php. This could affect users who have this system installed. To protect against this threat, users should update their system to a version that addresses this vulnerability.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2736",
    "description": "A vulnerability was found in PHPGurukul Old Age Home Management System 1.0 and classified as critical. Affected by this issue is some unknown functionality of the file /admin/bwdates-report-details.php. The manipulation of the argument fromdate leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. Other parameters might be affected as well.",
    "summary": "This vulnerability in PHPGurukul Old Age Home Management System 1.0 allows for a critical SQL injection attack to occur by manipulating the argument fromdate in the file /admin/bwdates-report-details.php. This can be exploited remotely and has been publicly disclosed. Users of this system should update to a secure version to prevent the risk of an attack.",
    "software": []
  },
  {
    "cve_id": "CVE-2024-10105",
    "description": "The Job Postings WordPress plugin before 2.7.11 does not sanitise and escape some of its settings, which could allow high privilege users such as contributor to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Job Postings WordPress plugin version 2.7.11 and below is vulnerable to Stored Cross-Site Scripting attacks. High privilege users, like contributors, can exploit this vulnerability to insert malicious code into the plugin settings. This could affect WordPress websites using this plugin, especially in a multisite setup. Users should update to version 2.7.11 or higher to protect against this threat.",
    "software": [
      "Job Postings WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10210",
    "description": "An External Control of File Name or Path vulnerability in the APROL Web Portal used in B&R APROL <4.4-005P may allow an authenticated network-based attacker to access data from the file system.",
    "summary": "This vulnerability in the APROL Web Portal software allows an attacker who is logged in to the network to access files on the system. Users of B&R APROL <4.4-005P should update their software to fix this issue and prevent unauthorized access to files.",
    "software": [
      "APROL Web Portal",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-10472",
    "description": "The Stylish Price List  WordPress plugin before 7.1.12 does not sanitise and escape some of its settings, which could allow high privilege users such as contributor to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Stylish Price List WordPress plugin version before 7.1.12 is vulnerable to a Stored Cross-Site Scripting attack. This means that even high privilege users like contributors could inject malicious code into the plugin's settings. This could affect users of the plugin, especially in a multisite setup. To protect against this vulnerability, users should update to version 7.1.12 or newer as soon as possible.",
    "software": [
      "Stylish Price List",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-10554",
    "description": "The WordPress WP-Advanced-Search WordPress plugin before 3.3.9.3 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the WP-Advanced-Search WordPress plugin allows high privilege users, such as admins, to perform attacks that can execute malicious code on a website. This affects users of the plugin before version 3.3.9.3. Users should update the plugin to the latest version as soon as possible to protect against this threat.",
    "software": [
      "WordPress",
      "WP-Advanced-Search WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10560",
    "description": "The Form Maker by 10Web  WordPress plugin before 1.15.30 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Form Maker by 10Web WordPress plugin allows high privilege users, like administrators, to execute stored cross-site scripting attacks even when certain permissions are restricted. Users of this plugin, specifically those with high privileges, are affected. To protect against this threat, users should update to version 1.15.30 or newer to ensure that the settings are properly sanitized and escaped.",
    "software": [
      "Form Maker by 10Web WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10565",
    "description": "The Slider by 10Web  WordPress plugin before 1.2.62 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This CVE involves a security flaw in the Slider by 10Web WordPress plugin version before 1.2.62, which can be exploited by high privilege users like admins to carry out Stored Cross-Site Scripting attacks, even when certain security measures are in place. This vulnerability can affect WordPress websites using this plugin, especially in a multisite setup. Users should update the plugin to version 1.2.62 or newer to mitigate the risk of attacks.",
    "software": [
      "Slider by 10Web WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10566",
    "description": "The Slider by 10Web  WordPress plugin before 1.2.62 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Slider by 10Web WordPress plugin before version 1.2.62 is vulnerable to Stored Cross-Site Scripting attacks, which could be exploited by high privilege users such as admins. This vulnerability could affect users of the plugin, especially in multisite setups where unfiltered_html capability is disallowed. Users should update to version 1.2.62 or later to protect against this threat.",
    "software": [
      "Slider by 10Web WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10638",
    "description": "The Product Labels For Woocommerce (Sale Badges) WordPress plugin before 1.5.11 does not sanitize and escape a parameter before using it in a SQL statement, allowing admins to perform SQL injection attacks",
    "summary": ". This vulnerability can be exploited by an authenticated attacker with the ability to manage WooCommerce product labels. It affects users of the Product Labels For WooCommerce (Sale Badges) plugin before version 1.5.11. To mitigate this threat, users should update the plugin to the latest version (1.5.11) to ensure that the SQL injection vulnerability is patched.",
    "software": [
      "Product Labels For Woocommerce (Sale Badges) WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10679",
    "description": "The Quiz and Survey Master (QSM)  WordPress plugin before 9.2.1 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Quiz and Survey Master WordPress plugin could allow high privilege users, like admins, to carry out malicious attacks on websites. It can affect any websites using the plugin before version 9.2.1. Users should update to the latest version of the plugin (9.2.1) to protect their site from potential attacks.",
    "software": [
      "Quiz and Survey Master"
    ]
  },
  {
    "cve_id": "CVE-2024-10703",
    "description": "The Registrations for the Events Calendar  WordPress plugin before 2.13.4 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Registrations for the Events Calendar WordPress plugin could allow hackers with high privileges to insert malicious code into a website, potentially leading to a Cross-Site Scripting attack. This could affect websites using this plugin, particularly those with multiple users. To protect against this threat, users should update the plugin to version 2.13.4 or later.",
    "software": [
      "Registrations for the Events Calendar",
      "WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-11272",
    "description": "The Contact Form & SMTP Plugin for WordPress by PirateForms WordPress plugin before 2.6.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Contact Form & SMTP Plugin for WordPress is vulnerable to Stored Cross-Site Scripting attacks, which could be exploited by high privilege users, such as admins, even when certain security measures are in place. Users of this plugin should update to version 2.6.0 or higher to protect against this threat.",
    "software": [
      "Contact Form & SMTP Plugin",
      "PirateForms WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-11273",
    "description": "The Contact Form & SMTP Plugin for WordPress by PirateForms WordPress plugin before 2.6.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Contact Form & SMTP Plugin for WordPress by PirateForms is vulnerable to Stored Cross-Site Scripting attacks, which could be exploited by high privilege users, even in a multisite setup where unfiltered_html capability is disallowed. Users of this plugin should update to version 2.6.0 or higher to protect against this threat.",
    "software": [
      "Contact Form & SMTP Plugin for WordPress by PirateForms WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-11503",
    "description": "The WP Tabs  WordPress plugin before 2.2.7 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The WP Tabs WordPress plugin before version 2.2.7 is vulnerable to a Stored Cross-Site Scripting attack, which could allow high privilege users like admins to inject malicious code. This can impact WordPress websites that have this plugin installed, particularly in multisite setups. Users should update to version 2.2.7 or later to protect against this vulnerability.",
    "software": [
      "WP Tabs WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-12109",
    "description": "The Product Labels For Woocommerce (Sale Badges) WordPress plugin before 1.5.9 does not sanitize and escape a parameter before using it in a SQL statement, allowing admins to perform SQL injection attacks",
    "summary": "The Product Labels For Woocommerce WordPress plugin has a vulnerability that could allow hackers to perform SQL injection attacks. This could affect anyone using the plugin before version 1.5.9. It is recommended to update the plugin to the latest version to protect against this threat.",
    "software": [
      "Product Labels For Woocommerce (Sale Badges) WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-12682",
    "description": "The Smart Maintenance Mode WordPress plugin before 1.5.2 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Smart Maintenance Mode WordPress plugin is vulnerable to a Stored Cross-Site Scripting attack, which could allow admin users to inject malicious code into the website. Users of the plugin should update to version 1.5.2 or higher to protect against this threat.",
    "software": [
      "Smart Maintenance Mode WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-12769",
    "description": "The Simple Banner  WordPress plugin before 3.0.4 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Simple Banner WordPress plugin could allow high privilege users to insert harmful code into the plugin's settings, leading to a Stored Cross-Site Scripting attack. This could affect anyone using the plugin, particularly in a multisite setup. Users should update to version 3.0.4 or higher to protect against this threat.",
    "software": [
      "Simple Banner WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13118",
    "description": "The IP Based Login WordPress plugin before 2.4.1 does not have CSRF checks in some places, which could allow attackers to make logged in users delete all logs via a CSRF attack",
    "summary": "The IP Based Login WordPress plugin has a security vulnerability that could allow attackers to delete all logs by making a logged-in user unknowingly perform a malicious action. This affects users of the plugin before version 2.4.1. To protect against this threat, users should update the plugin to the latest version, which includes CSRF checks to prevent such attacks.",
    "software": [
      "IP Based Login WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13122",
    "description": "The AFI  WordPress plugin before 1.100.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The AFI WordPress plugin before version 1.100.0 is vulnerable to Stored Cross-Site Scripting attacks, which could be exploited by high privilege users like admins. This vulnerability could affect WordPress websites using this plugin, especially in a multisite setup. Users should update the plugin to version 1.100.0 or higher to protect against this threat.",
    "software": [
      "AFI WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13123",
    "description": "The AFI  WordPress plugin before 1.100.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The AFI WordPress plugin is vulnerable to Stored Cross-Site Scripting attacks, which could allow high privilege users, such as administrators, to inject malicious code into the plugin settings. This vulnerability affects users of the plugin version before 1.100.0, especially those using it in a multisite setup. Users should update to version 1.100.0 or later to protect against this threat.",
    "software": [
      "AFI WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13617",
    "description": "The aoa-downloadable WordPress plugin through 0.1.0 doesn't validate a parameter in its download function, allowing unauthenticated attackers to download arbitrary files from the server",
    "summary": ". This vulnerability affects users of the aoa-downloadable plugin for WordPress. Attackers can exploit this vulnerability to download sensitive files from the server without authentication. Users should update to a version higher than 0.1.0 to mitigate this threat.",
    "software": [
      "aoa-downloadable",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-13618",
    "description": "The aoa-downloadable WordPress plugin through 0.1.0 lacks authorization and authentication for requests to its download.php endpoint, allowing unauthenticated visitors to make requests to arbitrary URLs.",
    "summary": "The aoa-downloadable WordPress plugin version 0.1.0 has a security vulnerability that allows unauthorized users to make requests to any URL through its download.php endpoint. This can potentially lead to data theft or unauthorized access to sensitive information. Users of this plugin should update to the latest version or consider disabling it until a fix is available.",
    "software": [
      "aoa-downloadable",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-13863",
    "description": "The Stylish Google Sheet Reader 4.0  WordPress plugin before 4.1 does not sanitise and escape a parameter before outputting it back in the page, leading to a Reflected Cross-Site Scripting which could be used against high privilege users such as admin",
    "summary": "The Stylish Google Sheet Reader 4.0 WordPress plugin has a security vulnerability that allows for a Reflected Cross-Site Scripting attack. This could affect high privilege users, such as admins of websites using this plugin. To mitigate this threat, it is recommended to update the plugin to version 4.1 or higher, which includes a fix for this issue.",
    "software": [
      "Stylish Google Sheet Reader 4.0 WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-44903",
    "description": "SQL Injection can occur in the SirsiDynix Horizon Information Portal (IPAC20) through 3.25_9382; however, a patch is available from the vendor. This is in ipac.jsp in a SELECT WHERE statement, in a part of the uri= variable in the second part of the full= inner variable.",
    "summary": "This CVE is about a vulnerability in SirsiDynix Horizon Information Portal that allows hackers to perform SQL Injection attacks. This can affect users of the IPAC20 version 3.25_9382. To protect against this threat, users should apply the patch provided by the vendor.",
    "software": [
      "SirsiDynix Horizon Information Portal"
    ]
  },
  {
    "cve_id": "CVE-2024-9770",
    "description": "The WP-Recall  WordPress plugin before 16.26.12 does not sanitize and escape a parameter before using it in a SQL statement, allowing admins to perform SQL injection attacks",
    "summary": "A vulnerability in the WP-Recall WordPress plugin allows hackers to perform SQL injection attacks due to lack of proper sanitization of data. This could affect users of the plugin who have not updated to version 16.26.12. Users should update to the latest version to protect against this threat.",
    "software": [
      "WP-Recall WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-0717",
    "description": "To exploit the vulnerability, it is necessary:",
    "summary": "CVE-2021-44228 is a vulnerability in the Apache Log4j software library that could allow attackers to remotely execute code on affected systems. This vulnerability affects any organization or individual using a product or service that utilizes the Apache Log4j library. To mitigate the risk, users should update to the latest version of the Apache Log4j library and monitor for any suspicious activity on their systems.",
    "software": [
      "Bison",
      "Flex"
    ]
  },
  {
    "cve_id": "CVE-2025-0845",
    "description": "The DesignThemes Core Features plugin for WordPress is vulnerable to Stored Cross-Site Scripting via shortcodes in versions up to, and including, 4.8 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers with contributor-level and above permissions to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The DesignThemes Core Features plugin for WordPress has a security vulnerability that allows attackers with contributor-level permissions or higher to inject harmful scripts into web pages. This could affect anyone using this plugin on their WordPress site. Users should update to version 4.9 or higher to protect against this threat.",
    "software": [
      "DesignThemes Core Features plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-1452",
    "description": "The Favorites WordPress plugin before 2.3.5 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Favorites WordPress plugin could allow high privilege users to insert harmful code into the website, potentially affecting all users. To protect against this, users should update the plugin to version 2.3.5 or higher.",
    "software": [
      "Favorites WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1798",
    "description": "The  does not sanitise and escape some parameters when outputting them back in a page, allowing unauthenticated users the ability to perform stored Cross-Site Scripting attacks.",
    "summary": "This vulnerability allows unauthorized users to execute malicious scripts on a web page, posing a security threat. It affects users who are not authenticated on the website. To mitigate this risk, it is recommended to implement proper sanitization and escape mechanisms for output parameters on the page.",
    "software": [
      "The"
    ]
  },
  {
    "cve_id": "CVE-2025-27809",
    "description": "Mbed TLS before 2.28.10 and 3.x before 3.6.3, on the client side, accepts servers that have trusted certificates for arbitrary hostnames unless the TLS client application calls mbedtls_ssl_set_hostname.",
    "summary": "A vulnerability in Mbed TLS allows malicious servers to use trusted certificates for any hostname without proper verification. This affects Mbed TLS versions before 2.28.10 and 3.x before 3.6.3 on the client-side. To mitigate this threat, TLS client applications should call mbedtls_ssl_set_hostname to ensure proper hostname verification.",
    "software": [
      "Mbed TLS"
    ]
  },
  {
    "cve_id": "CVE-2025-27810",
    "description": "Mbed TLS before 2.28.10 and 3.x before 3.6.3, in some cases of failed memory allocation or hardware errors, uses uninitialized stack memory to compose the TLS Finished message, potentially leading to authentication bypasses such as replays.",
    "summary": "This security vulnerability in Mbed TLS can allow attackers to bypass authentication and potentially carry out replays by exploiting uninitialized stack memory when composing the TLS Finished message. It affects versions before 2.28.10 and 3.x before 3.6.3. Users should update to the latest version of Mbed TLS to mitigate this risk.",
    "software": [
      "Mbed TLS"
    ]
  },
  {
    "cve_id": "CVE-2025-2224",
    "description": "The Directorist: AI-Powered Business Directory Plugin with Classified Ads Listings plugin for WordPress is vulnerable to unauthorized access  and modification of data due to a missing capability check on the 'parse_query' function in all versions up to, and including, 8.2. This makes it possible for unauthenticated attackers to update the post_status of any post to 'publish'.",
    "summary": "The Directorist plugin for WordPress is at risk of unauthorized access and data modification. This vulnerability could affect any website using this plugin up to version 8.2. Website owners should update to the latest version of the plugin to protect against potential attacks.",
    "software": [
      "Directorist: AI-Powered Business Directory Plugin with Classified Ads Listings"
    ]
  },
  {
    "cve_id": "CVE-2025-2737",
    "description": "A vulnerability was found in PHPGurukul Old Age Home Management System 1.0. It has been classified as critical. This affects an unknown part of the file /admin/contactus.php. The manipulation of the argument pagetitle leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "A critical vulnerability was found in the PHPGurukul Old Age Home Management System 1.0, where manipulation of a specific argument can lead to a SQL injection attack. This vulnerability can be exploited remotely. Users of this system should update to a patched version to protect against potential attacks.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2738",
    "description": "A vulnerability was found in PHPGurukul Old Age Home Management System 1.0. It has been declared as critical. This vulnerability affects unknown code of the file /admin/manage-scdetails.php. The manipulation of the argument namesc leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability found in PHPGurukul Old Age Home Management System 1.0 allows attackers to remotely inject SQL commands through a specific file. It affects users of this particular version of the software. Users should update to a patched version or take other security measures to protect against potential attacks.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2739",
    "description": "A vulnerability was found in PHPGurukul Old Age Home Management System 1.0. It has been rated as critical. This issue affects some unknown processing of the file /admin/manage-services.php. The manipulation of the argument sertitle leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "A critical vulnerability has been found in the PHPGurukul Old Age Home Management System 1.0, a flaw in how a specific file is processed which could allow for SQL injection. This could be exploited remotely, affecting users of this software. Users should update to a patched version to protect against potential attacks.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2024-12623",
    "description": "The DICOM Support plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's 'dcm' shortcode in all versions up to, and including, 0.10.6 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The DICOM Support plugin for WordPress has a security flaw that allows attackers with contributor-level access or higher to inject harmful scripts onto web pages using the plugin. This could potentially lead to malicious actions being taken by the attacker when a user accesses the affected pages. Users of this plugin should update to version 0.10.7 or later to protect against this threat.",
    "software": [
      "DICOM Support plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-1320",
    "description": "The teachPress plugin for WordPress is vulnerable to Cross-Site Request Forgery in all versions up to, and including, 9.0.9. This is due to missing or incorrect nonce validation on the import.php page. This makes it possible for unauthenticated attackers to delete imports via a forged request granted they can trick a site administrator into performing an action such as clicking on a link.",
    "summary": "The teachPress plugin for WordPress is at risk of attackers tricking site administrators into unintentionally deleting imports. This affects all versions up to 9.0.9. Site administrators should update the plugin to the latest version to prevent this vulnerability.",
    "software": [
      "teachPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-2252",
    "description": "The Easy Digital Downloads – eCommerce Payments and Subscriptions made easy plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 3.3.6.1 via the edd_ajax_get_download_title() function. This makes it possible for unauthenticated attackers to extract private post titles of downloads. The impact here is minimal.",
    "summary": "The Easy Digital Downloads plugin for WordPress has a vulnerability that allows hackers to access private post titles of downloads. This may not have a significant impact, but it is still a security risk for users. Users should update to version 3.3.7 or later to protect their private information.",
    "software": [
      "Easy Digital Downloads – eCommerce Payments and Subscriptions made easy plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-2740",
    "description": "A vulnerability classified as critical has been found in PHPGurukul Old Age Home Management System 1.0. Affected is an unknown function of the file /admin/eligibility.php. The manipulation of the argument pagetitle leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Old Age Home Management System 1.0 has a critical vulnerability that can be exploited through a SQL injection attack by manipulating the argument pagetitle in the file /admin/eligibility.php. This vulnerability can be exploited remotely and has been made public, increasing the risk of attacks. Users of this system should take immediate action to patch the vulnerability and prevent potential exploitation.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2742",
    "description": "A vulnerability classified as critical was found in zhijiantianya ruoyi-vue-pro 2.4.1. This vulnerability affects unknown code of the file /admin-api/mp/material/upload-permanent of the component Material Upload Interface. The manipulation of the argument File leads to path traversal. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This critical vulnerability found in zhijiantianya ruoyi-vue-pro 2.4.1 allows for remote attackers to manipulate a file argument, leading to path traversal. This can affect anyone using the Material Upload Interface component. The vendor has been notified but has not responded. Users should update their software as soon as a patch becomes available to protect against potential attacks.",
    "software": [
      "zhijiantianya ruoyi-vue-pro"
    ]
  },
  {
    "cve_id": "CVE-2025-2743",
    "description": "A vulnerability, which was classified as problematic, has been found in zhijiantianya ruoyi-vue-pro 2.4.1. This issue affects some unknown processing of the file /admin-api/mp/material/upload-temporary of the component Material Upload Interface. The manipulation of the argument File leads to path traversal. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A vulnerability has been found in zhijiantianya ruoyi-vue-pro 2.4.1 that allows for remote attackers to perform path traversal by manipulating a specific file. This issue affects the Material Upload Interface component. The vendor has been made aware of the problem, but has not responded. Users should be cautious and take necessary precautions to protect their systems from potential attacks exploiting this vulnerability.",
    "software": [
      "zhijiantianya ruoyi-vue-pro"
    ]
  },
  {
    "cve_id": "CVE-2025-2744",
    "description": "A vulnerability, which was classified as critical, was found in zhijiantianya ruoyi-vue-pro 2.4.1. Affected is an unknown function of the file /admin-api/mp/material/upload-news-image of the component Material Upload Interface. The manipulation of the argument File leads to path traversal. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "There is a critical vulnerability found in zhijiantianya ruoyi-vue-pro 2.4.1, specifically in the Material Upload Interface component. This vulnerability allows remote attackers to manipulate files, leading to path traversal. The exploit has been made public and can be used by anyone. Users of this component should take action immediately to protect their systems, as the vendor has not responded to the disclosure of this vulnerability.",
    "software": [
      "zhijiantianya ruoyi-vue-pro"
    ]
  },
  {
    "cve_id": "CVE-2025-2750",
    "description": "A vulnerability, which was classified as critical, was found in Open Asset Import Library Assimp 5.4.3. This affects the function Assimp::CSMImporter::InternReadFile of the file code/AssetLib/CSM/CSMLoader.cpp of the component CSM File Handler. The manipulation leads to out-of-bounds write. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The Open Asset Import Library Assimp version 5.4.3 has a critical vulnerability that allows remote attackers to carry out out-of-bounds write attacks through the CSM File Handler component. This could affect users of this library who have not updated to the latest version. Users should update to the latest version of the library to mitigate the threat of potential attacks.",
    "software": [
      "Open Asset Import Library Assimp"
    ]
  },
  {
    "cve_id": "CVE-2025-2751",
    "description": "A vulnerability has been found in Open Asset Import Library Assimp 5.4.3 and classified as problematic. This vulnerability affects the function Assimp::CSMImporter::InternReadFile of the file code/AssetLib/CSM/CSMLoader.cpp of the component CSM File Handler. The manipulation of the argument na leads to out-of-bounds read. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The Open Asset Import Library Assimp 5.4.3 has a vulnerability that could allow remote attackers to execute an out-of-bounds read attack by manipulating a specific argument. This affects users of this library and the CSM File Handler component. To mitigate this threat, users should update to the latest version of the software or apply any patches provided by the developers.",
    "software": [
      "Open Asset Import Library Assimp"
    ]
  },
  {
    "cve_id": "CVE-2025-2752",
    "description": "A vulnerability was found in Open Asset Import Library Assimp 5.4.3 and classified as problematic. This issue affects the function fast_atoreal_move in the library include/assimp/fast_atof.h of the component CSM File Handler. The manipulation leads to out-of-bounds read. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in Open Asset Import Library Assimp 5.4.3 can be exploited remotely, potentially leading to an out-of-bounds read. It affects users of the CSM File Handler component. To protect against this threat, users should update to a fixed version of the library when available and exercise caution when handling CSM files.",
    "software": [
      "Open Asset Import Library Assimp",
      "CSM File Handler"
    ]
  },
  {
    "cve_id": "CVE-2024-13690",
    "description": "The WP Church Donation plugin for WordPress is vulnerable to Stored Cross-Site Scripting via several donation form submission parameters in all versions up to, and including, 1.7 due to insufficient input sanitization and output escaping. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The WP Church Donation plugin for WordPress is at risk of a Cross-Site Scripting attack, where attackers can inject harmful scripts into the plugin. This vulnerability affects all versions up to 1.7 and could be exploited by unauthenticated users. Website owners should update the plugin to the latest version to protect against this threat.",
    "software": [
      "WP Church Donation plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-13710",
    "description": "The Estatebud – Properties & Listings plugin for WordPress is vulnerable to Cross-Site Request Forgery in all versions up to, and including, 5.5.0. This is due to missing or incorrect nonce validation on the 'estatebud_settings' page. This makes it possible for unauthenticated attackers to update the plugin's settings via a forged request granted they can trick a site administrator into performing an action such as clicking on a link.",
    "summary": "This vulnerability in the Estatebud plugin for WordPress allows attackers to manipulate settings on a website without proper validation, potentially causing harm. This affects users of the plugin up to version 5.5.0. To stay safe, users should update their plugin to the latest version as soon as possible.",
    "software": [
      "Estatebud – Properties & Listings plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13731",
    "description": "The Alert Box Block – Display notice/alerts in the front end. plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's Alert Box block in all versions up to, and including, 1.1.2 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The Alert Box Block WordPress plugin is at risk of a security vulnerability that allows authenticated attackers with contributor-level access or higher to inject harmful scripts into web pages. This can affect anyone using the plugin version 1.1.2 or earlier. To prevent this threat, users should update the plugin to the latest version as soon as possible.",
    "software": [
      "Alert Box Block"
    ]
  },
  {
    "cve_id": "CVE-2025-2319",
    "description": "The EZ SQL Reports Shortcode Widget and DB Backup plugin for WordPress is vulnerable to Cross-Site Request Forgery in versions 4.11.13 to 5.25.08. This is due to missing or incorrect nonce validation on the 'ELISQLREPORTS_menu' function. This makes it possible for unauthenticated attackers to execute code on the server via a forged request granted they can trick a site administrator into performing an action such as clicking on a link. Version 5.25.10 adds a nonce check, which makes this vulnerability exploitable by admins only.",
    "summary": "The EZ SQL Reports Shortcode Widget and DB Backup plugin for WordPress has a vulnerability that allows unauthenticated attackers to execute code on the server if they can trick a site administrator into clicking on a link. This affects versions 4.11.13 to 5.25.08. Site administrators should update to version 5.25.10 which adds a nonce check to prevent this vulnerability from being exploited by admins only.",
    "software": [
      "EZ SQL Reports Shortcode Widget",
      "DB Backup plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-2510",
    "description": "The Frndzk Expandable Bottom Bar plugin for WordPress is vulnerable to Stored Cross-Site Scripting via 'text' parameter in all versions up to, and including, 1.0 due to insufficient input sanitization and output escaping. This makes it possible for authenticated attackers, with administrator-level permissions and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page. This only affects multi-site installations and installations where unfiltered_html has been disabled.",
    "summary": "The Frndzk Expandable Bottom Bar plugin for WordPress has a security vulnerability that allows authenticated attackers with high-level permissions to inject harmful scripts on web pages. This vulnerability specifically affects multi-site installations and installations where certain security features are disabled. Users should update the plugin to the latest version to prevent potential attacks.",
    "software": [
      "Frndzk Expandable Bottom Bar",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2559",
    "description": "A flaw was found in Keycloak. When the configuration uses JWT tokens for authentication, the tokens are cached until expiration. If a client uses JWT tokens with an excessively long expiration time, for example, 24 or 48 hours, the cache can grow indefinitely, leading to an OutOfMemoryError. This issue could result in a denial of service condition, preventing legitimate users from accessing the system.",
    "summary": "The CVE is a vulnerability in Keycloak that affects systems using JWT tokens for authentication. If a client sets a very long expiration time for the tokens, the cache can grow indefinitely and cause an OutOfMemoryError, leading to denial of service for legitimate users. To mitigate this threat, users should limit the expiration time of JWT tokens to prevent excessive cache growth.",
    "software": [
      "Keycloak"
    ]
  },
  {
    "cve_id": "CVE-2025-2753",
    "description": "A vulnerability was found in Open Asset Import Library Assimp 5.4.3. It has been classified as critical. Affected is the function SceneCombiner::MergeScenes of the file code/AssetLib/LWS/LWSLoader.cpp of the component LWS File Handler. The manipulation leads to out-of-bounds read. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in Open Asset Import Library Assimp 5.4.3 can allow attackers to perform out-of-bounds read attacks remotely. It affects users of this library, particularly those utilizing the SceneCombiner::MergeScenes function in the LWS File Handler component. To protect against potential attacks, users should update to a secure version of the software and implement any recommended patches or fixes.",
    "software": [
      "Open Asset Import Library Assimp",
      "LWS File Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2754",
    "description": "A vulnerability was found in Open Asset Import Library Assimp 5.4.3. It has been declared as critical. Affected by this vulnerability is the function Assimp::AC3DImporter::ConvertObjectSection of the file code/AssetLib/AC/ACLoader.cpp of the component AC3D File Handler. The manipulation of the argument it leads to heap-based buffer overflow. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in Open Asset Import Library Assimp 5.4.3 allows for remote attackers to execute a heap-based buffer overflow by manipulating a specific argument in the AC3D File Handler component. This can impact users of Assimp and potentially allow attackers to launch attacks remotely. It is critical to update to a patched version of Assimp to protect against this threat.",
    "software": [
      "Open Asset Import Library Assimp",
      "AC3DImporter",
      "ACLoader.cpp",
      "AC3D File Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2755",
    "description": "A vulnerability was found in Open Asset Import Library Assimp 5.4.3. It has been rated as critical. Affected by this issue is the function Assimp::AC3DImporter::ConvertObjectSection of the file code/AssetLib/AC/ACLoader.cpp of the component AC3D File Handler. The manipulation of the argument src.entries leads to out-of-bounds read. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The Open Asset Import Library (Assimp) version 5.4.3 has a critical vulnerability that could allow remote attackers to launch an out-of-bounds read attack through the AC3D File Handler component. This vulnerability affects users of Assimp version 5.4.3. To protect against this threat, users should update to a patched version of the software as soon as possible.",
    "software": [
      "Open Asset Import Library Assimp",
      "AC3DImporter",
      "ACLoader.cpp",
      "AC3D File Handler"
    ]
  },
  {
    "cve_id": "CVE-2024-53678",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Apache VCL. Users can modify form data submitted when requesting a new Block Allocation such that a SELECT SQL statement is modified. The data returned by the SELECT statement is not viewable by the attacker.\n\nThis issue affects all versions of Apache VCL from 2.2 through 2.5.1.\n\nUsers are recommended to upgrade to version 2.5.2, which fixes the issue.",
    "summary": "The CVE is a vulnerability in Apache VCL that allows users to manipulate form data to modify an SQL command. This could potentially lead to unauthorized access to data. The issue affects versions 2.2 through 2.5.1 of Apache VCL. Users should update to version 2.5.2 to address this vulnerability.",
    "software": [
      "Apache VCL"
    ]
  },
  {
    "cve_id": "CVE-2024-53679",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Apache VCL in the User Lookup form. A user with sufficient rights to be able to view this part of the site can craft a URL or be tricked in to clicking a URL that will give a specified user elevated rights.\n\n\n\nThis issue affects all versions of Apache VCL through 2.5.1.\n\n\n\nUsers are recommended to upgrade to version 2.5.2, which fixes the issue.",
    "summary": "The Apache VCL software has a vulnerability that could allow a user to gain elevated rights by manipulating URLs. This affects all versions of Apache VCL up to 2.5.1. Users should upgrade to version 2.5.2 to fix this issue and prevent any potential security threats.",
    "software": [
      "Apache VCL"
    ]
  },
  {
    "cve_id": "CVE-2025-2542",
    "description": "The Your Simple SVG Support plugin for WordPress is vulnerable to Stored Cross-Site Scripting via SVG File uploads in all versions up to, and including, 1.0.1 due to insufficient input sanitization and output escaping. This makes it possible for authenticated attackers, with Author-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses the SVG file.",
    "summary": "This vulnerability in the Your Simple SVG Support plugin for WordPress allows attackers with Author-level or higher access to upload SVG files containing malicious scripts, which can then be executed when a user accesses the file. All versions up to 1.0.1 are affected. Website administrators should update the plugin to the latest version to protect against this threat.",
    "software": [
      "Your Simple SVG Support plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2635",
    "description": "The Digital License Manager plugin for WordPress is vulnerable to Reflected Cross-Site Scripting due to the use of remove_query_arg() function without appropriate escaping on the URL in all versions up to, and including, 1.7.3. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that execute if they can successfully trick a user into performing an action such as clicking on a link.",
    "summary": "The Digital License Manager plugin for WordPress is at risk of allowing attackers to inject malicious scripts onto websites by exploiting a vulnerability in the plugin. This can affect websites using this plugin on WordPress versions up to 1.7.3. Website owners should update the plugin to the latest version to protect against this threat.",
    "software": [
      "Digital License Manager plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2756",
    "description": "A vulnerability classified as critical has been found in Open Asset Import Library Assimp 5.4.3. This affects the function Assimp::AC3DImporter::ConvertObjectSection of the file code/AssetLib/AC/ACLoader.cpp of the component AC3D File Handler. The manipulation of the argument tmp leads to heap-based buffer overflow. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The critical vulnerability in Open Asset Import Library Assimp 5.4.3 allows for a heap-based buffer overflow through the AC3D File Handler component, which can be exploited remotely. This threat could affect users of this library. To protect against potential attacks, it is recommended to update to a version of the library that has patched this vulnerability.",
    "software": [
      "Open Asset Import Library Assimp",
      "AC3DImporter",
      "ACLoader.cpp",
      "AC3D File Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2757",
    "description": "A vulnerability classified as critical was found in Open Asset Import Library Assimp 5.4.3. This vulnerability affects the function AI_MD5_PARSE_STRING_IN_QUOTATION of the file code/AssetLib/MD5/MD5Parser.cpp of the component MD5 File Handler. The manipulation of the argument data leads to heap-based buffer overflow. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "A critical vulnerability was found in Open Asset Import Library (Assimp) version 5.4.3, which could allow remote attackers to initiate a heap-based buffer overflow through manipulation of argument data. This vulnerability affects users of the MD5 File Handler component. Users should update to a patched version of Assimp to prevent potential attacks.",
    "software": [
      "Open Asset Import Library Assimp"
    ]
  },
  {
    "cve_id": "CVE-2025-2109",
    "description": "The WP Compress – Instant Performance & Speed Optimization plugin for WordPress is vulnerable to Server-Side Request Forgery in all versions up to, and including, 6.30.15 via the init() function. This makes it possible for unauthenticated attackers to make web requests to arbitrary locations originating from the web application and can be used to query information from internal services.",
    "summary": "The WP Compress plugin for WordPress has a vulnerability that allows attackers to make web requests to different locations from the web application without authentication. This could potentially expose sensitive information from internal services. Users should update to version 6.30.16 or later to fix this issue and protect their websites.",
    "software": [
      "WP Compress"
    ]
  },
  {
    "cve_id": "CVE-2022-1804",
    "description": "accountsservice no longer drops permissions when writting .pam_environment",
    "summary": "This vulnerability in accountsservice allows a user to write to the .pam_environment file without dropping permissions, potentially allowing them to escalate their privileges. This issue affects users of the accountsservice program. To mitigate the risk, users should update their accountsservice program to the latest version that includes a fix for this vulnerability.",
    "software": [
      "accountsservice"
    ]
  },
  {
    "cve_id": "CVE-2024-10037",
    "description": "A vulnerability exists in the RTU500 web server component that can cause a denial of service to the RTU500 CMU application if a specially crafted message sequence is executed on a WebSocket connection.\nAn attacker must be properly authenticated and the test mode function of RTU500 must be enabled to exploit this vulnerability.\n\nThe affected CMU will automatically recover itself if an attacker successfully exploits this vulnerability.",
    "summary": "The vulnerability in the RTU500 web server component could allow an attacker to cause a denial of service to the RTU500 CMU application through a specially crafted message on a WebSocket connection. This only affects systems with the test mode function enabled and requires the attacker to be properly authenticated. If attacked, the affected CMU will automatically recover. To mitigate this vulnerability, ensure test mode is disabled and monitor network traffic for any suspicious activity.",
    "software": [
      "RTU500"
    ]
  },
  {
    "cve_id": "CVE-2024-11499",
    "description": "A vulnerability exists in RTU500 IEC 60870-4-104 controlled station functionality, that allows an authenticated and authorized attacker to perform a CMU restart. The vulnerability can be triggered if certificates are updated while in use on active connections.\n\nThe affected CMU will automatically recover itself if an attacker successfully exploits this vulnerability.",
    "summary": "This CVE is about a vulnerability in the RTU500 IEC 60870-4-104 controlled station that allows an attacker to perform a CMU restart. This vulnerability affects those using this specific technology and can be triggered if certificates are updated on active connections. If this vulnerability is exploited, the affected CMU will recover on its own. Users should be cautious when updating certificates on active connections to prevent potential attacks.",
    "software": [
      "RTU500"
    ]
  },
  {
    "cve_id": "CVE-2024-12169",
    "description": "A vulnerability exists in RTU500 IEC 60870-5-104 controlled station functionality and IEC 61850 functionality, that allows an attacker performing a specific attack sequence to restart the affected CMU. This vulnerability only applies, if secure communication using IEC 62351-3 (TLS) is enabled.",
    "summary": "This vulnerability affects the RTU500 IEC 60870-5-104 controlled station and IEC 61850 functionality, allowing an attacker to restart the affected CMU if secure communication using IEC 62351-3 (TLS) is enabled. Users should disable secure communication to mitigate this threat.",
    "software": [
      "RTU500"
    ]
  },
  {
    "cve_id": "CVE-2025-1445",
    "description": "A vulnerability exists in RTU IEC 61850 client and server functionality that could impact the availability if renegotiation of an open IEC61850 TLS connection takes place in specific timing situations, when IEC61850 communication is active.\n\nPrecondition is that IEC61850 as client or server are configured using TLS on RTU500 device. It affects the CMU the IEC61850 stack is configured on.",
    "summary": "This vulnerability affects RTU500 devices using IEC 61850 communication protocol with TLS encryption. If a renegotiation of the TLS connection occurs at a specific time while communication is active, it could impact availability. Users should update their devices with the latest security patches to protect against this vulnerability.",
    "software": [
      "RTU IEC 61850",
      "RTU500",
      "CMU"
    ]
  },
  {
    "cve_id": "CVE-2025-27631",
    "description": "The TRMTracker web application is vulnerable to LDAP injection attack potentially allowing an attacker to inject code into a query and execute remote commands that can read and update data on the website.",
    "summary": "The TRMTracker web application is at risk of a LDAP injection attack, which could allow a hacker to insert code into a query and execute commands remotely. This could lead to unauthorized access to and manipulation of data on the website. Users of TRMTracker should ensure they have implemented security measures to prevent such attacks, such as input validation and using parameterized queries.",
    "software": [
      "TRMTracker web application",
      "LDAP"
    ]
  },
  {
    "cve_id": "CVE-2025-27632",
    "description": "A Host Header Injection vulnerability in TRMTracker application may allow an attacker by modifying the host header value in an HTTP request to leverage multiple attack vectors, including defacing the site content through web-cache poisoning.",
    "summary": "This vulnerability in the TRMTracker application allows attackers to modify the host header in an HTTP request, which can be used for various malicious actions such as defacing a website through web-cache poisoning. This vulnerability affects users of TRMTracker. To protect against this threat, users should apply all available patches and updates provided by the software vendor.",
    "software": [
      "TRMTracker"
    ]
  },
  {
    "cve_id": "CVE-2025-27633",
    "description": "The TRMTracker web application is vulnerable to reflected Cross-site scripting attack. The application allows client-side code injection that might be used to compromise the confidentiality and integrity of the system.",
    "summary": "TRMTracker, a web application, is at risk of a reflected Cross-site scripting attack which could allow hackers to compromise the confidentiality and integrity of the system. Users of TRMTracker are affected by this vulnerability. To mitigate this threat, users should update their web application and be cautious of clicking on suspicious links.",
    "software": [
      "TRMTracker web application"
    ]
  },
  {
    "cve_id": "CVE-2025-29932",
    "description": "In JetBrains GoLand before 2025.1 an XXE during debugging was possible",
    "summary": "A vulnerability was found in JetBrains GoLand software before version 2025.1, allowing for an XML External Entity (XXE) attack during the debugging process. This could be exploited by an attacker to gain unauthorized access to sensitive information or execute malicious code. Users of JetBrains GoLand should update to version 2025.1 or later to protect against this vulnerability.",
    "software": [
      "JetBrains GoLand"
    ]
  },
  {
    "cve_id": "CVE-2024-42533",
    "description": "SQL injection vulnerability in the authentication module in Convivance StandVoice 4.5 through 6.2 allows remote attackers to execute arbitrary code via the GEST_LOGIN parameter.",
    "summary": "A SQL injection vulnerability in Convivance StandVoice versions 4.5 through 6.2 allows hackers to run their code by manipulating a certain parameter. This vulnerability poses a threat to users of Convivance StandVoice. Users should update their software to the latest version to protect themselves from potential attacks.",
    "software": [
      "Convivance StandVoice"
    ]
  },
  {
    "cve_id": "CVE-2025-22230",
    "description": "VMware Tools for Windows contains an authentication bypass vulnerability due to improper access control. A malicious actor with non-administrative privileges on a guest VM may gain ability to perform certain high privilege operations within that VM.",
    "summary": "The CVE is a vulnerability in VMware Tools for Windows that allows a malicious actor with non-administrative privileges on a guest virtual machine to perform high privilege operations within that virtual machine. This vulnerability affects users of VMware Tools for Windows. To protect against this threat, users should update VMware Tools to the latest version and ensure proper access controls are in place.",
    "software": [
      "VMware Tools for Windows"
    ]
  },
  {
    "cve_id": "CVE-2025-29635",
    "description": "A command injection vulnerability in D-Link DIR-823X 240126 and 240802 allows an authorized attacker to execute arbitrary commands on remote devices by sending a POST request to /goform/set_prohibiting via the corresponding function, triggering remote command execution.",
    "summary": "This vulnerability in D-Link DIR-823X routers allows an attacker to execute commands on the device remotely. Anyone with access to the router could potentially exploit this flaw. To protect against this threat, users should update their router's firmware to the latest version provided by D-Link.",
    "software": [
      "D-Link DIR-823X 240126",
      "D-Link DIR-823X 240802"
    ]
  },
  {
    "cve_id": "CVE-2025-30091",
    "description": "In Tiny MoxieManager PHP before 4.0.0, remote code execution can occur in the installer command. This vulnerability allows unauthenticated attackers to inject and execute arbitrary code. Attacker-controlled data to InstallCommand can be inserted into config.php, and InstallCommand is available after an installation has completed.",
    "summary": "A vulnerability in Tiny MoxieManager PHP before version 4.0.0 allows remote attackers to execute arbitrary code on a system without authentication. This affects users of the software who have not updated to the latest version. To mitigate this threat, users should update to version 4.0.0 or newer to protect against potential remote code execution attacks.",
    "software": [
      "Tiny MoxieManager PHP"
    ]
  },
  {
    "cve_id": "CVE-2024-55604",
    "description": "Appsmith is a platform to build admin panels, internal tools, and dashboards. Users invited as \"App Viewer\" should not have access to development information of a workspace. Datasources are such a component in a workspace. Yet, in versions of Appsmith prior to 1.51, app viewers are able to get a list of datasources in a workspace they're a member of. This information disclosure does NOT expose sensitive data in the datasources, such as database passwords and API Keys. The attacker needs to have been invited to a workspace as a \"viewer\", by someone in that workspace with access to invite. The attacker then needs to be able to signup/login to that Appsmith instance. The issue is patched in version 1.51. No known workarounds are available.",
    "summary": "A vulnerability in Appsmith prior to version 1.51 allows unauthorized users invited as \"App Viewers\" to access a list of datasources in a workspace they are a member of, potentially exposing development information. This does not include sensitive data such as passwords or API keys. Users should update to version 1.51 to patch this issue as there are no known workarounds.",
    "software": [
      "Appsmith"
    ]
  },
  {
    "cve_id": "CVE-2025-26742",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in GhozyLab Gallery for Social Photo allows Stored XSS.This issue affects Gallery for Social Photo: from n/a through 1.0.0.35.",
    "summary": "This vulnerability in GhozyLab Gallery for Social Photo allows for a stored cross-site scripting (XSS) attack, which could be used by malicious actors to execute code on a user's browser when they visit a compromised website. This affects Gallery for Social Photo versions from n/a through 1.0.0.35. Users should update to the latest version of the software to patch this vulnerability and protect against potential attacks.",
    "software": [
      "GhozyLab Gallery for Social Photo"
    ]
  },
  {
    "cve_id": "CVE-2025-27147",
    "description": "The GLPI Inventory Plugin handles various types of tasks for GLPI agents, including network discovery and inventory (SNMP), software deployment, VMWare ESX host remote inventory, and data collection (files, Windows registry, WMI). Versions prior to 1.5.0 have an improper access control vulnerability. Version 1.5.0 fixes the vulnerability.",
    "summary": "The GLPI Inventory Plugin, used for tasks like network discovery and inventory, had a security flaw in versions before 1.5.0 that could allow unauthorized access. Users of versions prior to 1.5.0 should update to version 1.5.0 to mitigate the vulnerability.",
    "software": [
      "GLPI Inventory Plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-2530",
    "description": "Luxion KeyShot DAE File Parsing Access of Uninitialized Pointer Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Luxion KeyShot. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of dae files. The issue results from the lack of proper initialization of a pointer prior to accessing it. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-23698.",
    "summary": "This vulnerability in Luxion KeyShot software allows remote attackers to run their code on affected systems. Users need to be cautious to only visit trusted websites and not open any suspicious files to avoid exploitation. Luxion KeyShot users should update their software to the latest version to mitigate this threat.",
    "software": [
      "Luxion KeyShot"
    ]
  },
  {
    "cve_id": "CVE-2025-2531",
    "description": "Luxion KeyShot DAE File Parsing Heap-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Luxion KeyShot. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of dae files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a heap-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-23704.",
    "summary": "This is a vulnerability found in the Luxion KeyShot software, where remote attackers can execute malicious code on a user's computer by tricking them into visiting a malicious website or opening a harmful file. This vulnerability affects installations of Luxion KeyShot. To prevent exploitation of this vulnerability, users should make sure to avoid clicking on suspicious links or opening unexpected files, especially from unknown sources.",
    "software": [
      "Luxion KeyShot"
    ]
  },
  {
    "cve_id": "CVE-2025-2532",
    "description": "Luxion KeyShot USDC File Parsing Use-After-Free Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of Luxion KeyShot. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of usdc files. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-23709.",
    "summary": "The Luxion KeyShot software is vulnerable to a remote code execution attack through malicious files. Users of the software should be cautious when opening files or visiting websites to avoid potential exploitation. It is recommended to update the software to the latest version to protect against this vulnerability.",
    "software": [
      "Luxion KeyShot"
    ]
  },
  {
    "cve_id": "CVE-2025-30212",
    "description": "Frappe is a full-stack web application framework. An SQL Injection vulnerability has been identified in Frappe Framework prior to versions 14.89.0 and 15.51.0 which could allow a malicious actor to access sensitive information. Versions 14.89.0 and 15.51.0 fix the issue. Upgrading is required; no other workaround is present.",
    "summary": "There is a security flaw in the Frappe Framework that could allow hackers to access sensitive information through SQL Injection. This vulnerability affects versions of Frappe Framework prior to 14.89.0 and 15.51.0. To protect against potential attacks, users should upgrade to the fixed versions 14.89.0 and 15.51.0 immediately as there are no other workarounds available.",
    "software": [
      "Frappe Framework"
    ]
  },
  {
    "cve_id": "CVE-2025-30213",
    "description": "Frappe is a full-stack web application framework. Prior to versions 14.91.0 and 15.52.0, a system user was able to create certain documents in a specific way that could lead to remote code execution. Versions 14.9.1 and 15.52.0 contain a patch for the vulnerability. There's no workaround; an upgrade is required.",
    "summary": "This vulnerability in the Frappe web application framework allowed system users to create documents in a way that could lead to remote code execution. This could affect users of Frappe versions prior to 14.91.0 and 15.52.0. To protect against this threat, users should upgrade to the patched versions 14.9.1 or 15.52.0 as there is no workaround available.",
    "software": [
      "Frappe"
    ]
  },
  {
    "cve_id": "CVE-2025-30214",
    "description": "Frappe is a full-stack web application framework. Prior to versions 14.89.0 and 15.51.0, making crafted requests could lead to information disclosure that could further lead to account takeover. Versions 14.89.0 and 15.51.0 fix the issue. There's no workaround to fix this without upgrading.",
    "summary": "The vulnerability in the Frappe web application framework allows hackers to access sensitive information and potentially take over user accounts. Users of versions prior to 14.89.0 and 15.51.0 are affected. To protect against this threat, users should upgrade to the latest versions to ensure their information is secure.",
    "software": [
      "Frappe"
    ]
  },
  {
    "cve_id": "CVE-2024-58104",
    "description": "A vulnerability  in the Trend Micro Apex One Security Agent Plug-in User Interface Manager could allow a local attacker to bypass existing security and execute arbitrary code on affected installations. \r\n\r\nPlease note: an attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.",
    "summary": "This vulnerability in Trend Micro's Apex One Security Agent Plug-in User Interface Manager allows a local attacker to bypass security measures and run harmful code on affected systems. To mitigate this threat, users should ensure that only trusted individuals have access to run code on their systems.",
    "software": [
      "Trend Micro Apex One Security Agent Plug-in User Interface Manager"
    ]
  },
  {
    "cve_id": "CVE-2024-58105",
    "description": "A vulnerability  in the Trend Micro Apex One Security Agent Plug-in User Interface Manager could allow a local attacker to bypass existing security and execute arbitrary code on affected installations. \r\n\r\nThis CVE address an addtional bypass not covered in CVE-2024-58104.\r\n\r\nPlease note: an attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.",
    "summary": "The Trend Micro Apex One Security Agent Plug-in User Interface Manager has a vulnerability that could allow a local attacker to bypass security measures and run any code they want on affected devices. This vulnerability affects users of Trend Micro Apex One Security Agent. To protect against this, users should update their software to the latest version. It's important to note that the attacker would need some level of access to the target system already to exploit this vulnerability.",
    "software": [
      "Trend Micro Apex One Security Agent"
    ]
  },
  {
    "cve_id": "CVE-2025-2312",
    "description": "A flaw was found in cifs-utils. When trying to obtain Kerberos credentials, the cifs.upcall program from the cifs-utils package makes an upcall to the wrong namespace in containerized environments. This issue may lead to disclosing sensitive data from the host's Kerberos credentials cache.",
    "summary": "The vulnerability in cifs-utils allows attackers to access sensitive data in a host's Kerberos credentials cache. This affects users of cifs-utils in containerized environments. To mitigate this issue, users should update to the latest version of cifs-utils and regularly check for security patches.",
    "software": [
      "cifs-utils",
      "cifs.upcall"
    ]
  },
  {
    "cve_id": "CVE-2024-31896",
    "description": "IBM SPSS Statistics 26.0, 27.0.1, 28.0.1, and 29.0.2 uses weaker than expected cryptographic algorithms that could allow an attacker to decrypt highly sensitive information.",
    "summary": "This vulnerability in IBM SPSS Statistics software could allow attackers to decrypt important information. It affects users of versions 26.0, 27.0.1, 28.0.1, and 29.0.2. Users should update their software to the latest version to safeguard their data.",
    "software": [
      "IBM SPSS Statistics"
    ]
  },
  {
    "cve_id": "CVE-2025-28904",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Shamalli Web Directory Free allows Blind SQL Injection. This issue affects Web Directory Free: from n/a through 1.7.6.",
    "summary": "This vulnerability in Shamalli Web Directory Free allows attackers to inject malicious SQL commands, potentially gaining unauthorized access to the database. This affects users of Web Directory Free versions from n/a to 1.7.6. To protect against this threat, users should update to the latest version of the software.",
    "software": [
      "Shamalli Web Directory Free"
    ]
  },
  {
    "cve_id": "CVE-2025-30567",
    "description": "Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal') vulnerability in wp01ru WP01 allows Path Traversal. This issue affects WP01: from n/a through 2.6.2.",
    "summary": "This vulnerability in wp01ru WP01 allows attackers to access files outside of the restricted directory, potentially exposing sensitive information. It affects WP01 versions from n/a through 2.6.2. Users should update to the latest version of WP01 to patch this vulnerability and secure their data.",
    "software": [
      "wp01ru WP01"
    ]
  },
  {
    "cve_id": "CVE-2024-48818",
    "description": "An issue in IIT Bombay, Mumbai, India Bodhitree of cs101 version allows a remote attacker to execute arbitrary code.",
    "summary": "A vulnerability in the cs101 version of Bodhitree software used at IIT Bombay in India allows hackers to remotely execute unauthorized code. This vulnerability affects users of this software. To protect against potential attacks, individuals should update to the latest version of the software as soon as possible.",
    "software": [
      "IIT Bombay",
      "Bodhitree",
      "cs101"
    ]
  },
  {
    "cve_id": "CVE-2025-30118",
    "description": "An issue was discovered on the Audi Universal Traffic Recorder 2.88. It has Susceptibility to denial of service. It uses the same default credentials for all devices and does not implement proper multi-device authentication, allowing attackers to deny the owner access by occupying the only available connection. The SSID remains broadcast at all times, increasing exposure to potential attacks.",
    "summary": "The Audi Universal Traffic Recorder 2.88 is at risk of denial of service attacks due to using default credentials and lacking proper authentication. This vulnerability affects all owners of this device. Users should update their device with the latest security patches and change the default credentials to reduce the risk of a denial of service attack.",
    "software": [
      "Audi Universal Traffic Recorder"
    ]
  },
  {
    "cve_id": "CVE-2025-30216",
    "description": "CryptoLib provides a software-only solution using the CCSDS Space Data Link Security Protocol - Extended Procedures (SDLS-EP) to secure communications between a spacecraft running the core Flight System (cFS) and a ground station. In versions 1.3.3 and prior, a Heap Overflow vulnerability occurs in the `Crypto_TM_ProcessSecurity` function (`crypto_tm.c:1735:8`). When processing the Secondary Header Length of a TM protocol packet, if the Secondary Header Length exceeds the packet's total length, a heap overflow is triggered during the memcpy operation that copies packet data into the dynamically allocated buffer `p_new_dec_frame`. This allows an attacker to overwrite adjacent heap memory, potentially leading to arbitrary code execution or system instability. A patch is available at commit 810fd66d592c883125272fef123c3240db2f170f.",
    "summary": "A vulnerability in CryptoLib version 1.3.3 and earlier can be exploited by an attacker to trigger a heap overflow, potentially leading to arbitrary code execution or system instability. This affects spacecraft using the CCSDS Space Data Link Security Protocol - Extended Procedures (SDLS-EP) to communicate with ground stations. Users should apply the patch available at commit 810fd66d592c883125272fef123c3240db2f170f to mitigate this threat.",
    "software": [
      "CryptoLib",
      "CCSDS Space Data Link Security Protocol",
      "SDLS-EP",
      "cFS"
    ]
  },
  {
    "cve_id": "CVE-2024-55028",
    "description": "A template injection vulnerability in the Dashboard of NASA Fprime v3.4.3 allows attackers to execute arbitrary code via uploading a crafted Vue file.",
    "summary": "The CVE describes a security vulnerability in the Dashboard of NASA Fprime v3.4.3 that allows attackers to upload a malicious Vue file, which can then be used to execute arbitrary code on the system. This vulnerability can affect users of NASA Fprime v3.4.3. Users should update to a patched version of the software to prevent exploitation of this vulnerability.",
    "software": [
      "NASA Fprime v3.4.3",
      "Vue"
    ]
  },
  {
    "cve_id": "CVE-2024-55029",
    "description": "NASA Fprime v3.4.3 was discovered to contain multiple cross-site scripting (XSS) vulnerabilities.",
    "summary": "These vulnerabilities in NASA Fprime v3.4.3 could allow malicious actors to inject and execute malicious scripts in the web browser of users who interact with the application. This affects anyone who uses NASA Fprime v3.4.3. To mitigate the risk, users should update to a patched version of the software as soon as possible.",
    "software": [
      "NASA Fprime v3.4.3"
    ]
  },
  {
    "cve_id": "CVE-2024-55030",
    "description": "A command injection vulnerability in the Command Dispatcher Service of NASA Fprime v3.4.3 allows attackers to execute arbitrary commands.",
    "summary": "This vulnerability in NASA Fprime v3.4.3 allows hackers to run unauthorized commands on the system. This affects users of this specific version of the software. To protect against this, users should update to a patched version or implement security measures to prevent unauthorized commands from being executed.",
    "software": [
      "NASA Fprime v3.4.3"
    ]
  },
  {
    "cve_id": "CVE-2025-25371",
    "description": "NASA cFS (Core Flight System) Aquila is vulnerable to path traversal in the OSAL module, allowing the override of any arbitrary file on the system.",
    "summary": "A vulnerability in NASA's cFS Aquila system allows attackers to access and modify any file on the system by exploiting a path traversal issue in the OSAL module. This vulnerability affects users of the cFS Aquila software. It is recommended that users update their software to the latest version and limit access to the system to prevent unauthorized modifications to files.",
    "software": [
      "NASA cFS",
      "Core Flight System",
      "Aquila",
      "OSAL module"
    ]
  },
  {
    "cve_id": "CVE-2025-25372",
    "description": "NASA cFS (Core Flight System) Aquila is vulnerable to segmentation fault via sending a malicious telecommand to the Memory Management Module.",
    "summary": "The NASA cFS Aquila software is at risk of being disrupted by a malicious command that can cause a segmentation fault in the Memory Management Module. This vulnerability could potentially affect any system using this software. To prevent this threat, users should ensure that their systems are updated with the latest security patches and monitor for any suspicious activity.",
    "software": [
      "NASA cFS",
      "Aquila",
      "Memory Management Module"
    ]
  },
  {
    "cve_id": "CVE-2025-25373",
    "description": "The Memory Management Module of NASA cFS (Core Flight System) Aquila has insecure permissions, which can be exploited to gain an RCE on the platform.",
    "summary": "This vulnerability in the Memory Management Module of NASA cFS Aquila allows attackers to remotely execute code on the platform. It affects users of the cFS Aquila system. To mitigate the risk, users should apply the necessary patches and updates provided by NASA.",
    "software": [
      "NASA cFS (Core Flight System) Aquila"
    ]
  },
  {
    "cve_id": "CVE-2025-25374",
    "description": "In NASA cFS (Core Flight System) Aquila, it is possible to put the onboard software in a state that will prevent the launch of any external application, causing a platform denial of service.",
    "summary": "This vulnerability in NASA's cFS can allow hackers to prevent the launch of external applications on the system, causing a denial of service. This affects anyone using the cFS platform. Users should apply the necessary security patches or updates to prevent this vulnerability from being exploited.",
    "software": [
      "NASA cFS",
      "Core Flight System",
      "Aquila"
    ]
  },
  {
    "cve_id": "CVE-2025-27830",
    "description": "An issue was discovered in Artifex Ghostscript before 10.05.0. A buffer overflow occurs during serialization of DollarBlend in a font, for base/write_t1.c and psi/zfapi.c.",
    "summary": "This vulnerability in Artifex Ghostscript allows for a buffer overflow attack, which could potentially be exploited by hackers to execute malicious code on a system. This affects users running Ghostscript versions before 10.05.0. Users should update to the latest version of Ghostscript to mitigate the risk of this security issue.",
    "software": [
      "Artifex Ghostscript"
    ]
  },
  {
    "cve_id": "CVE-2025-27831",
    "description": "An issue was discovered in Artifex Ghostscript before 10.05.0. The DOCXWRITE TXTWRITE device has a text buffer overflow via long characters to devices/vector/doc_common.c.",
    "summary": "This vulnerability in Artifex Ghostscript before version 10.05.0 allows an attacker to potentially execute malicious code by sending long characters to certain devices. This could affect users of the software who may be at risk of remote code execution. To protect against this threat, users should update to the latest version of Artifex Ghostscript available.",
    "software": [
      "Artifex Ghostscript",
      "DOCXWRITE TXTWRITE",
      "devices/vector/doc_common.c"
    ]
  },
  {
    "cve_id": "CVE-2025-27832",
    "description": "An issue was discovered in Artifex Ghostscript before 10.05.0. The NPDL device has a Compression buffer overflow for contrib/japanese/gdevnpdl.c.",
    "summary": "This vulnerability in Artifex Ghostscript could be exploited by attackers to cause a buffer overflow, potentially leading to arbitrary code execution. This vulnerability affects users of Ghostscript versions before 10.05.0. To mitigate this risk, users should update Ghostscript to version 10.05.0 or later.",
    "software": [
      "Artifex Ghostscript"
    ]
  },
  {
    "cve_id": "CVE-2025-27833",
    "description": "An issue was discovered in Artifex Ghostscript before 10.05.0. A buffer overflow occurs for a long TTF font name to pdf/pdf_fmap.c.",
    "summary": "This vulnerability in Artifex Ghostscript software could be exploited by an attacker by using a long TTF font name to perform a buffer overflow, potentially allowing them to execute malicious code on the affected system. This vulnerability affects users of Ghostscript versions before 10.05.0. Users should update their software to version 10.05.0 or newer to mitigate this threat.",
    "software": [
      "Artifex Ghostscript"
    ]
  },
  {
    "cve_id": "CVE-2025-27834",
    "description": "An issue was discovered in Artifex Ghostscript before 10.05.0. A buffer overflow occurs via an oversized Type 4 function in a PDF document to pdf/pdf_func.c.",
    "summary": "This vulnerability in Artifex Ghostscript allows for a buffer overflow to occur via an oversized Type 4 function in a PDF document. This affects users of Ghostscript versions prior to 10.05.0. To mitigate this threat, users should update their Ghostscript software to the latest version.",
    "software": [
      "Artifex Ghostscript"
    ]
  },
  {
    "cve_id": "CVE-2025-27835",
    "description": "An issue was discovered in Artifex Ghostscript before 10.05.0. A buffer overflow occurs when converting glyphs to Unicode in psi/zbfont.c.",
    "summary": "This vulnerability in Artifex Ghostscript software could allow an attacker to execute arbitrary code on the affected system by exploiting a buffer overflow issue. This affects users of Ghostscript versions before 10.05.0. To protect against this threat, users should update their software to the latest version available.",
    "software": [
      "Artifex Ghostscript"
    ]
  },
  {
    "cve_id": "CVE-2025-27836",
    "description": "An issue was discovered in Artifex Ghostscript before 10.05.0. The BJ10V device has a Print buffer overflow in contrib/japanese/gdev10v.c.",
    "summary": "This vulnerability in Artifex Ghostscript software allows an attacker to cause a print buffer overflow specifically in the BJ10V device. This affects users of Ghostscript versions before 10.05.0. Users should update their software to the latest version to mitigate the risk of exploitation by an attacker.",
    "software": [
      "Artifex Ghostscript",
      "BJ10V"
    ]
  },
  {
    "cve_id": "CVE-2025-27837",
    "description": "An issue was discovered in Artifex Ghostscript before 10.05.0. Access to arbitrary files can occur through a truncated path with invalid UTF-8 characters, for base/gp_mswin.c and base/winrtsup.cpp.",
    "summary": "This vulnerability in Artifex Ghostscript before version 10.05.0 allows attackers to access arbitrary files using invalid UTF-8 characters in file paths. This could potentially affect users of Ghostscript who are not using the latest version. To protect against this issue, users should update Ghostscript to version 10.05.0 or later to mitigate the risk of unauthorized file access.",
    "software": [
      "Artifex Ghostscript"
    ]
  },
  {
    "cve_id": "CVE-2025-29789",
    "description": "OpenEMR is a free and open source electronic health records and medical practice management application. Versions prior to 7.3.0 are vulnerable to Directory Traversal in the Load Code feature. Version 7.3.0 contains a patch for the issue.",
    "summary": "The vulnerability in OpenEMR allows attackers to access sensitive files on a system through the Load Code feature. This affects users of OpenEMR versions prior to 7.3.0. Users should upgrade to version 7.3.0 to protect against this threat.",
    "software": [
      "OpenEMR"
    ]
  },
  {
    "cve_id": "CVE-2025-30741",
    "description": "Pixelfed before 0.12.5 allows anyone to follow private accounts and see private posts on other Fediverse servers. This affects users elsewhere in the Fediverse, if they otherwise have any followers from a Pixelfed instance.",
    "summary": "A security vulnerability in Pixelfed before version 0.12.5 allows unauthorized users to follow and view private accounts and posts on other social media servers connected to the Fediverse. This could potentially impact users who have followers from a Pixelfed instance. Users of Pixelfed should update to version 0.12.5 or later to protect their privacy and prevent unauthorized access to their private content.",
    "software": [
      "Pixelfed"
    ]
  },
  {
    "cve_id": "CVE-2025-30219",
    "description": "RabbitMQ is a messaging and streaming broker. Versions prior to 4.0.3 are vulnerable to a sophisticated attack that could modify virtual host name on disk and then make it unrecoverable (with other on disk file modifications) can lead to arbitrary JavaScript code execution in the browsers of management UI users. When a virtual host on a RabbitMQ node fails to start, recent versions\nwill display an error message (a notification) in the management UI. The error message includes virtual host name, which was not escaped prior to open source RabbitMQ 4.0.3 and Tanzu RabbitMQ 4.0.3, 3.13.8. An attack that both makes a virtual host fail to start and creates a new virtual host name with an XSS code snippet or changes the name of an existing virtual host on disk could trigger arbitrary JavaScript code execution in the management UI (the user's browser). Open source RabbitMQ `4.0.3` and Tanzu RabbitMQ `4.0.3` and `3.13.8` patch the issue.",
    "summary": "A vulnerability has been discovered in RabbitMQ versions prior to 4.0.3 that could allow an attacker to execute arbitrary JavaScript code in the browsers of management UI users by modifying virtual host names. This affects users of RabbitMQ who have not updated to version 4.0.3 or higher. Users should update to Open source RabbitMQ 4.0.3 or Tanzu RabbitMQ 4.0.3 / 3.13.8 to patch the issue.",
    "software": []
  },
  {
    "cve_id": "CVE-2025-30222",
    "description": "Shescape is a simple shell escape library for JavaScript. Versions 1.7.2 through 2.1.1 are vulnerable to potential environment variable exposure on Windows with CMD. This impact users of Shescape on Windows that explicitly configure `shell: 'cmd.exe'` or `shell: true` using any of `quote`/`quoteAll`/`escape`/`escapeAll`. An attacker may be able to get read-only access to environment variables. This bug has been patched in v2.1.2. For those who are already using v2 of Shescape, no further changes are required. Those who are are using v1 of Shescape should follow the migration guide to upgrade to v2. There is no plan to release a patch compatible with v1 of Shescape. As a workaround, users can remove all instances of `%` from user input before using Shescape.",
    "summary": "The CVE relates to a vulnerability in the Shescape shell escape library for JavaScript versions 1.7.2 through 2.1.1 on Windows with CMD. This may expose environment variables to attackers who could gain read-only access. The issue has been fixed in version 2.1.2, so users are advised to update to this version. Users on version 1 should follow the migration guide to upgrade to version 2, as no patch will be released for version 1. As a temporary solution, users can remove all instances of `%` from user input before using Shescape.",
    "software": [
      "Shescape"
    ]
  },
  {
    "cve_id": "CVE-2024-47516",
    "description": "A vulnerability was found in Pagure. An argument injection in Git during retrieval of the repository history leads to remote code execution on the Pagure instance.",
    "summary": "The vulnerability found in Pagure allows attackers to remotely execute code on the Pagure instance by injecting malicious arguments during the retrieval of repository history in Git. This vulnerability affects all users of Pagure. To mitigate this threat, users should apply the latest security patches and updates provided by Pagure.",
    "software": [
      "Pagure",
      "Git"
    ]
  },
  {
    "cve_id": "CVE-2025-2276",
    "description": "The Ultimate Dashboard – Custom WordPress Dashboard plugin for WordPress is vulnerable to unauthorized modification of data due to a missing capability check on the handle_module_actions function in all versions up to, and including, 3.8.7. This makes it possible for authenticated attackers, with Subscriber-level access and above, to activate/deactivate plugin modules.",
    "summary": "The Ultimate Dashboard plugin for WordPress is at risk of being exploited by attackers with Subscriber-level access or higher, allowing them to make unauthorized changes to plugin modules. Users of this plugin should update to version 3.8.8 or later to fix this issue and prevent unauthorized modifications.",
    "software": [
      "Ultimate Dashboard",
      "Custom WordPress Dashboard plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-2302",
    "description": "The Advanced Woo Search plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's aws_search_terms shortcode in all versions up to, and including, 3.28 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The Advanced Woo Search plugin for WordPress has a security issue that allows attackers with contributor-level access or higher to inject harmful scripts on certain pages. To mitigate this threat, users should update the plugin to version 3.29 or later.",
    "software": [
      "Advanced Woo Search plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1490",
    "description": "The Smart Maintenance Mode plugin for WordPress is vulnerable to Reflected Cross-Site Scripting via the ‘setstatus’ parameter in all versions up to, and including, 1.5.2 due to insufficient input sanitization and output escaping. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that execute if they can successfully trick a user into performing an action such as clicking on a link.",
    "summary": "The Smart Maintenance Mode plugin for WordPress is at risk of a security vulnerability that could allow attackers to inject harmful scripts into web pages. This can affect all users of the plugin, up to version 1.5.2. To protect against this threat, users should update to the latest version of the plugin to ensure proper input sanitization and output escaping.",
    "software": [
      "Smart Maintenance Mode plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2165",
    "description": "The SH Email Alert plugin for WordPress is vulnerable to Reflected Cross-Site Scripting via the 'mid' parameter in all versions up to, and including, 1.0 due to insufficient input sanitization and output escaping. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that execute if they can successfully trick a user into performing an action such as clicking on a link.",
    "summary": "The SH Email Alert plugin for WordPress is at risk of a security issue called Reflected Cross-Site Scripting, which can allow attackers to inject harmful scripts into web pages. This affects all versions up to 1.0. To protect against this threat, users should update the plugin to the latest version as soon as possible.",
    "software": [
      "SH Email Alert plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-2573",
    "description": "The Amazing service box Addons For WPBakery Page Builder (formerly Visual Composer) plugin for WordPress is vulnerable to Stored Cross-Site Scripting via SVG File uploads in all versions up to, and including, 2.0.0 due to insufficient input sanitization and output escaping. This makes it possible for authenticated attackers, with Author-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses the SVG file.",
    "summary": "The Amazing service box Addons For WPBakery Page Builder plugin for WordPress is at risk of a Stored Cross-Site Scripting threat, which could allow authorized attackers to insert harmful scripts into web pages. This vulnerability affects all versions up to 2.0.0. Users with Author-level access or higher are at risk. To mitigate this threat, users should update the plugin to the latest version and exercise caution when uploading SVG files.",
    "software": [
      "WPBakery Page Builder",
      "Visual Composer",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2576",
    "description": "The Ayyash Studio — The kick-start kit plugin for WordPress is vulnerable to Stored Cross-Site Scripting via SVG File uploads in all versions up to, and including, 1.0.3 due to insufficient input sanitization and output escaping. This makes it possible for authenticated attackers, with Author-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses the SVG file.",
    "summary": "The Ayyash Studio plugin for WordPress is at risk of a Stored Cross-Site Scripting threat from SVG file uploads. This vulnerability affects all versions up to 1.0.3 and allows attackers with Author-level access or higher to inject harmful scripts that can run when users view the SVG file. Users should update to a secure version of the plugin and avoid uploading SVG files from untrusted sources.",
    "software": [
      "Ayyash Studio — The kick-start kit plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-30742",
    "description": "httpd.c in atophttpd 2.8.0 has an off-by-one error and resultant out-of-bounds read because a certain 1024-character req string would not have a final '\\0' character.",
    "summary": "Vulnerable version of atophttpd has an off-by-one error that can lead to an out-of-bounds read due to missing a final '\\0' character in a certain request string. This can potentially be exploited by attackers to execute arbitrary code or cause the service to crash. Users of atophttpd 2.8.0 should update to a patched version as soon as possible to mitigate the risk.",
    "software": [
      "atophttpd"
    ]
  },
  {
    "cve_id": "CVE-2024-11847",
    "description": "The wp-svg-upload WordPress plugin through 1.0.0 does not sanitize SVG file contents, which enables users with at least the author role to SVG with malicious JavaScript to conduct Stored XSS attacks.",
    "summary": "The wp-svg-upload WordPress plugin allows users to upload SVG files, but it does not properly check for malicious code within these files, making it vulnerable to Stored Cross-Site Scripting (XSS) attacks. This affects users with at least the author role. To protect against this threat, users should update to version 1.0.1 of the plugin or disable it until a patch is available.",
    "software": [
      "wp-svg-upload WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-12683",
    "description": "The Smart Maintenance Mode WordPress plugin before 1.5.2 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Smart Maintenance Mode WordPress plugin could allow high privilege users, like admin, to insert malicious code into the website through stored cross-site scripting attacks. This could affect users with the plugin installed, particularly in a multisite setup. To protect against this, users should update to version 1.5.2 or higher of the plugin.",
    "software": [
      "Smart Maintenance Mode WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13146",
    "description": "The Booknetic WordPress plugin before 4.1.5 does not have CSRF check when creating Staff accounts, which could allow attackers to make logged in admin add arbitrary Staff members via a CSRF attack",
    "summary": "A vulnerability in the Booknetic WordPress plugin allows attackers to add unauthorized staff members through a CSRF attack. This could affect any website using the plugin before version 4.1.5. Website administrators should update the plugin to version 4.1.5 or later to mitigate this threat.",
    "software": [
      "Booknetic WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1784",
    "description": "The Spectra – WordPress Gutenberg Blocks plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the uagb block in all versions up to, and including, 2.19.0 due to insufficient input sanitization and output escaping. This makes it possible for authenticated attackers, with Contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The Spectra – WordPress Gutenberg Blocks plugin for WordPress has a security issue where authenticated attackers with Contributor-level access or above can inject harmful web scripts into pages, putting website users at risk. To protect against this vulnerability, users should update the plugin to version 2.19.1 or newer.",
    "software": [
      "Spectra – WordPress Gutenberg Blocks"
    ]
  },
  {
    "cve_id": "CVE-2023-52972",
    "description": "Huawei PCs have a vulnerability that allows low-privilege users to bypass SDDL permission checks . Successful exploitation this vulnerability could lead to termination of some system processes.",
    "summary": "A vulnerability has been found in Huawei PCs that allows low-privilege users to bypass security checks, potentially leading to the termination of system processes. This vulnerability affects Huawei PC users. To protect against this threat, users should update their systems with the latest security patches provided by Huawei.",
    "software": [
      "Huawei PCs"
    ]
  },
  {
    "cve_id": "CVE-2024-30155",
    "description": "HCL SX does not set the secure attribute on authorization tokens or session cookies. Attackers may potentially be able to obtain access to the cookie values via a Cross-Site-Forgery-Request (CSRF).",
    "summary": "This vulnerability in HCL SX allows attackers to potentially access authorization tokens or session cookies by using a Cross-Site-Forgery-Request (CSRF) attack. This could affect any users of HCL SX systems. To protect against this threat, users should make sure that secure attributes are set on authorization tokens and session cookies.",
    "software": [
      "HCL SX"
    ]
  },
  {
    "cve_id": "CVE-2024-13702",
    "description": "The CRM and Lead Management by vcita plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's 'vCitaMeetingScheduler' and 'vCitaSchedulingCalendar' shortcodes in all versions up to, and including, 2.7.4 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The CRM and Lead Management by vcita plugin for WordPress is at risk of a stored cross-site scripting vulnerability, allowing attackers with contributor-level access or higher to inject harmful scripts into web pages. This could affect anyone using the plugin with versions up to 2.7.4. To protect against this threat, users should update their plugin to version 2.7.5 or later.",
    "software": [
      "CRM and Lead Management by vcita plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-13801",
    "description": "The BWL Advanced FAQ Manager plugin for WordPress is vulnerable to unauthorized modification of data that can lead to a denial of service due to a missing capability check on the 'baf_set_notice_status' AJAX action in all versions up to, and including, 2.1.4. This makes it possible for authenticated attackers, with Subscriber-level access and above, to update option values to '1' on the WordPress site. This can be leveraged to update an option that would create an error on the site and deny service to legitimate users or be used to set some values to true such as registration.",
    "summary": "The BWL Advanced FAQ Manager plugin for WordPress has a vulnerability that allows authenticated attackers, with Subscriber-level access and above, to modify data on the WordPress site, potentially causing a denial of service. This affects all versions up to 2.1.4. Website owners should update to the latest version of the plugin to fix this issue and prevent unauthorized modification of data.",
    "software": [
      "BWL Advanced FAQ Manager plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1514",
    "description": "The Active Products Tables for WooCommerce. Use constructor to create tables plugin for WordPress is vulnerable to unauthorized filter calling due to insufficient restrictions on the get_smth() function in all versions up to, and including, 1.0.6.7. This makes it possible for unauthenticated attackers to call arbitrary WordPress filters with a single parameter.",
    "summary": "This vulnerability in the Active Products Tables for WooCommerce WordPress plugin allows attackers to call WordPress filters without authorization, potentially leading to unauthorized access or other security issues. Users of all versions up to 1.0.6.7 should update to the latest version of the plugin to patch this vulnerability and prevent potential attacks.",
    "software": [
      "Active Products Tables for WooCommerce",
      "constructor to create tables plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2009",
    "description": "The Newsletters plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the logging functionality in all versions up to, and including, 4.9.9.7 due to insufficient input sanitization and output escaping. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The Newsletters plugin for WordPress has a security issue that allows hackers to inject harmful scripts into website pages. This affects all versions up to 4.9.9.7. Website owners should update to the latest version of the plugin to protect against this vulnerability.",
    "software": [
      "Newsletters plugin",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2167",
    "description": "The Event post plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's 'events_list' shortcodes in all versions up to, and including, 5.9.9 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The Event post plugin for WordPress has a security flaw that allows attackers with contributor level access or higher to inject harmful web scripts into pages using the 'events_list' shortcode. Users of this plugin up to version 5.9.9 are affected. To protect against this vulnerability, users should update their plugin to the latest version as soon as possible.",
    "software": [
      "Event post plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2257",
    "description": "The Total Upkeep – WordPress Backup Plugin plus Restore & Migrate by BoldGrid plugin for WordPress is vulnerable to Remote Code Execution in all versions up to, and including, 1.16.10 via the compression_level setting. This is due to the plugin using the compression_level setting in proc_open() without any validation. This makes it possible for authenticated attackers, with administrator-level access and above, to execute code on the server.",
    "summary": "The Total Upkeep WordPress Backup Plugin is vulnerable to a threat that allows attackers with administrator-level access to execute code on the server. This affects all versions up to 1.16.10. Users of this plugin should update to the latest version to protect against this vulnerability.",
    "software": [
      "Total Upkeep"
    ]
  },
  {
    "cve_id": "CVE-2025-1310",
    "description": "The Jobs for WordPress plugin for WordPress is vulnerable to Directory Traversal in all versions up to, and including, 2.7.11 via the 'job_postings_get_file' parameter. This makes it possible for authenticated attackers, with Subscriber-level access and above, to read the contents of arbitrary files on the server, which can contain sensitive information.",
    "summary": "CVE Summary:\nA security vulnerability in the Jobs for WordPress plugin allows authenticated attackers with Subscriber-level access or higher to read sensitive information from arbitrary files on the server. This affects all versions up to 2.7.11. Users should update the plugin to the latest version to protect their data from unauthorized access.",
    "software": [
      "Jobs for WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1437",
    "description": "The Advanced iFrame plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's 'advanced_iframe' shortcode in all versions up to, and including, 2024.5 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The Advanced iFrame plugin for WordPress has a security flaw that allows attackers with certain access levels to inject harmful code into pages using the plugin's shortcode. This can affect any website using this plugin up to version 2024.5. To prevent this, users should update the plugin to the latest version and be cautious with contributor-level access permissions.",
    "software": [
      "Advanced iFrame plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-1439",
    "description": "The Advanced iFrame plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's 'advanced_iframe' shortcode in all versions up to, and including, 2024.5 due to insufficient input sanitization and output escaping on user supplied attributes through the 'src' attribute when the src supplied returns a header with an injected value . This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The Advanced iFrame plugin for WordPress has a security vulnerability that allows authenticated attackers with contributor-level access and above to inject harmful scripts into pages. This can affect anyone who uses the plugin up to version 2024.5. To protect against this threat, users should update the plugin to the latest version available.",
    "software": [
      "Advanced iFrame plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-1440",
    "description": "The Advanced iFrame plugin for WordPress is vulnerable to unauthorized excessive creation of options on the aip_map_url_callback() function in all versions up to, and including, 2024.5 due to insufficient restrictions. This makes it possible for unauthenticated attackers to update the advancediFrameParameterData option with an excessive amount of unvalidated data.",
    "summary": "The Advanced iFrame plugin for WordPress has a security vulnerability that allows attackers to update the plugin's options with unvalidated data. This could potentially be exploited by unauthenticated attackers to cause excess creation of options and lead to security risks for the affected website. Website administrators using this plugin should update to version 2024.6 or later to mitigate this risk.",
    "software": [
      "Advanced iFrame plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-1703",
    "description": "The Ultimate Blocks plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the ‘content’ parameter in all versions up to, and including, 3.2.7 due to insufficient input sanitization and output escaping. This makes it possible for authenticated attackers, with Contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The Ultimate Blocks plugin for WordPress has a security vulnerability that allows attackers with Contributor-level access and above to inject malicious scripts into web pages. This can affect websites using this plugin up to version 3.2.7. Website administrators should update to the latest version of the plugin to mitigate this risk.",
    "software": [
      "Ultimate Blocks plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-1542",
    "description": "Improper permission control vulnerability in the OXARI ServiceDesk application could allow an attacker using a guest access or an unprivileged account to gain additional administrative permissions in the application.This issue affects OXARI ServiceDesk in versions before 2.0.324.0.",
    "summary": "There is a security flaw in the OXARI ServiceDesk application that could allow an attacker with limited access to gain administrative permissions in the application. This vulnerability affects OXARI ServiceDesk versions before 2.0.324.0. Users of this application should update to the latest version to protect against this threat.",
    "software": [
      "OXARI ServiceDesk"
    ]
  },
  {
    "cve_id": "CVE-2025-27551",
    "description": "DBIx::Class::EncodedColumn use the rand() function, which is not cryptographically secure to salt password hashes.\n\nThis vulnerability is associated with program files lib/DBIx/Class/EncodedColumn/Digest.pm.\n\nThis issue affects DBIx::Class::EncodedColumn until 0.00032.",
    "summary": "The issue involves a vulnerability in the DBIx::Class::EncodedColumn program, which uses the insecure rand() function to salt password hashes. This can make password hashes easier to crack for attackers. Users of DBIx::Class::EncodedColumn up to version 0.00032 are affected. Users should update to a newer version of the program to address this vulnerability.",
    "software": [
      "DBIx::Class::EncodedColumn"
    ]
  },
  {
    "cve_id": "CVE-2025-27552",
    "description": "DBIx::Class::EncodedColumn use the rand() function, which is not cryptographically secure to salt password hashes.\n\nThis vulnerability is associated with program files Crypt/Eksblowfish/Bcrypt.pm.\n\nThis issue affects DBIx::Class::EncodedColumn until 0.00032.",
    "summary": "The CVE poses a security threat for users of DBIx::Class::EncodedColumn, as it uses an insecure function to salt password hashes, making them vulnerable to attacks. Users of DBIx::Class::EncodedColumn versions up to 0.00032 should update to a newer version that addresses this vulnerability.",
    "software": [
      "DBIx::Class::EncodedColumn",
      "Crypt/Eksblowfish/Bcrypt.pm"
    ]
  },
  {
    "cve_id": "CVE-2025-2596",
    "description": "Session logout could be overwritten in Checkmk GmbH's Checkmk versions <2.3.0p30, <2.2.0p41, and 2.1.0p49 (EOL)",
    "summary": "A vulnerability in Checkmk software allows hackers to overwrite session logouts in older versions. This could lead to unauthorized access to sensitive data. Users of Checkmk versions <2.3.0p30, <2.2.0p41, and 2.1.0p49 are affected. To protect against this threat, users should update to the latest version of the software.",
    "software": [
      "Checkmk"
    ]
  },
  {
    "cve_id": "CVE-2024-13411",
    "description": "The Zapier for WordPress plugin for WordPress is vulnerable to Server-Side Request Forgery in all versions up to, and including, 1.5.1 via the updated_user() function. This makes it possible for authenticated attackers, with Subscriber-level access and above, to make web requests to arbitrary locations originating from the web application which can be used to query and modify information from internal services.",
    "summary": "The Zapier for WordPress plugin has a security flaw that allows attackers with certain levels of access to make web requests to any location, potentially accessing and modifying sensitive information. Users of this plugin should update to version 1.5.2 or higher to protect against this vulnerability.",
    "software": [
      "Zapier for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-13889",
    "description": "The WordPress Importer plugin for WordPress is vulnerable to PHP Object Injection in all versions up to, and including, 0.8.3 via deserialization of untrusted input in the 'maybe_unserialize' function. This makes it possible for authenticated attackers, with Administrator-level access and above, to inject a PHP Object. No known POP chain is present in the vulnerable software, which means this vulnerability has no impact unless another plugin or theme containing a POP chain is installed on the site. If a POP chain is present via an additional plugin or theme installed on the target system, it may allow the attacker to perform actions like delete arbitrary files, retrieve sensitive data, or execute code depending on the POP chain present.",
    "summary": "The WordPress Importer plugin is vulnerable to a PHP Object Injection attack, which could allow authenticated attackers with Administrator-level access to inject a PHP Object. This vulnerability only affects versions up to 0.8.3. If another plugin or theme containing a POP chain is installed on the site, the attacker may be able to delete files, access sensitive data, or execute code. Users should update the WordPress Importer plugin to the latest version to protect against this vulnerability.",
    "software": [
      "WordPress Importer plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1312",
    "description": "The Ultimate Blocks – WordPress Blocks Plugin plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the 'buttonTextColor’ parameter in all versions up to, and including, 3.2.7 due to insufficient input sanitization and output escaping. This makes it possible for authenticated attackers, with Contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "This vulnerability in the Ultimate Blocks WordPress plugin allows authenticated attackers with Contributor-level access or higher to inject harmful web scripts into pages on a website. This can affect any WordPress site using this plugin up to version 3.2.7. To protect against this threat, users should update the plugin to the latest version and monitor for any unauthorized changes to website content.",
    "software": [
      "Ultimate Blocks – WordPress Blocks Plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1769",
    "description": "The Product Import Export for WooCommerce – Import Export Product CSV Suite plugin for WordPress is vulnerable to Directory Traversal in all versions up to, and including, 2.5.0 via the download_file() function. This makes it possible for authenticated attackers, with Administrator-level access and above, to read the contents of arbitrary log files on the server, which can contain sensitive information.",
    "summary": "The Product Import Export for WooCommerce plugin for WordPress is at risk of a Directory Traversal vulnerability, allowing authorized attackers with Administrator-level access to view potentially sensitive information in server log files. Users of this plugin should update to version 2.5.1 or later to patch this security issue.",
    "software": [
      "Product Import Export for WooCommerce – Import Export Product CSV Suite plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-1911",
    "description": "The Product Import Export for WooCommerce – Import Export Product CSV Suite plugin for WordPress is vulnerable to arbitrary file deletion due to insufficient file path validation in the admin_log_page() function in all versions up to, and including, 2.5.0. This makes it possible for authenticated attackers, with Administrator-level access and above, to delete arbitrary log files on the server.",
    "summary": "This plugin for WordPress allows attackers with high-level access to delete important files on the server. If you use this plugin, make sure to update it to version 2.5.1 or newer to prevent this vulnerability from being exploited.",
    "software": [
      "Product Import Export for WooCommerce – Import Export Product CSV Suite plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1912",
    "description": "The Product Import Export for WooCommerce – Import Export Product CSV Suite plugin for WordPress is vulnerable to Server-Side Request Forgery in all versions up to, and including, 2.5.0 via the validate_file() Function. This makes it possible for authenticated attackers, with Administrator-level access and above, to make web requests to arbitrary locations originating from the web application and can be used to query and modify information from internal services.",
    "summary": "This CVE (Common Vulnerabilities and Exposures) affects the Product Import Export plugin for WordPress, allowing attackers with Administrator-level access to make unauthorized web requests. This could lead to exposing sensitive information or modifying internal services. Users should update the plugin to version 2.5.1 or higher to patch this vulnerability and secure their website.",
    "software": [
      "Product Import Export for WooCommerce – Import Export Product CSV Suite"
    ]
  },
  {
    "cve_id": "CVE-2025-1913",
    "description": "The Product Import Export for WooCommerce – Import Export Product CSV Suite plugin for WordPress is vulnerable to PHP Object Injection in all versions up to, and including, 2.5.0 via deserialization of untrusted input from the 'form_data' parameter This makes it possible for authenticated attackers, with Administrator-level access and above, to inject a PHP Object. No known POP chain is present in the vulnerable software, which means this vulnerability has no impact unless another plugin or theme containing a POP chain is installed on the site. If a POP chain is present via an additional plugin or theme installed on the target system, it may allow the attacker to perform actions like delete arbitrary files, retrieve sensitive data, or execute code depending on the POP chain present.",
    "summary": "The Product Import Export for WooCommerce plugin for WordPress is susceptible to a PHP Object Injection vulnerability, which can allow authenticated attackers with Administrator-level access to inject malicious PHP Objects. This vulnerability only poses a threat if another plugin or theme containing a certain type of exploit is also installed on the site. To protect against this vulnerability, users should update the affected plugin to version 2.5.1 or higher.",
    "software": [
      "Product Import Export for WooCommerce – Import Export Product CSV Suite plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-2110",
    "description": "The WP Compress – Instant Performance & Speed Optimization plugin for WordPress is vulnerable to unauthorized access, modification, and loss of data due to missing capability checks on its on its AJAX functions in all versions up to, and including, 6.30.15. This makes it possible for authenticated attackers, with Subscriber-level access and above, to compromise the site in various ways depending on the specific function exploited - for example, by retrieving sensitive settings and configuration details, or by altering and deleting them, thereby disclosing sensitive information, disrupting the plugin’s functionality, and potentially impacting overall site performance.",
    "summary": "The WP Compress plugin for WordPress is at risk of being accessed and modified by attackers, potentially leading to loss of data and disclosure of sensitive information. This vulnerability affects all versions up to 6.30.15 and can be exploited by authenticated attackers with Subscriber-level access or higher. Users should update the plugin to the latest version to protect their site from potential compromise.",
    "software": [
      "WP Compress – Instant Performance & Speed Optimization"
    ]
  },
  {
    "cve_id": "CVE-2025-2228",
    "description": "The Responsive Addons for Elementor – Free Elementor Addons Plugin and Elementor Templates plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 1.6.8 the 'register_user' function. This makes it possible for authenticated attackers, with Contributor-level access and above, to extract sensitive data including usernames and passwords of any users who register via the Edit Login | Registration Form widget, as long as that user opens the email notification for successful registration.",
    "summary": "The Responsive Addons for Elementor plugin for WordPress is at risk of exposing sensitive information, such as usernames and passwords, to authenticated attackers with Contributor-level access or higher. All versions up to 1.6.8 are affected. Users of this plugin should take action to update to the latest version to protect against this vulnerability.",
    "software": [
      "Responsive Addons for Elementor",
      "Free Elementor Addons Plugin",
      "Elementor Templates plugin for WordPress"
    ]
  }
]