[
  {
    "cve_id": "CVE-2025-2673",
    "description": "A vulnerability classified as problematic has been found in code-projects Payroll Management System 1.0. Affected is an unknown function of the file /home_employee.php. The manipulation of the argument division leads to cross site scripting. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. Other parameters might be affected as well.",
    "summary": "This vulnerability in the Payroll Management System 1.0 allows attackers to execute cross-site scripting attacks remotely by manipulating a specific function in the file \"home_employee.php.\" This could affect any users of the Payroll Management System 1.0. It is recommended to immediately update the system to the latest version and monitor for any suspicious activity.",
    "software": [
      "Payroll Management System 1.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2674",
    "description": "A vulnerability classified as critical was found in PHPGurukul Bank Locker Management System 1.0. Affected by this vulnerability is an unknown functionality of the file /aboutus.php. The manipulation of the argument pagetitle leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul Bank Locker Management System 1.0 allows for remote attackers to launch SQL injection attacks by manipulating certain arguments in the /aboutus.php file. This could potentially be used by malicious individuals to gain unauthorized access to sensitive information. Users of the system should take immediate action to install any patches or updates provided by the software vendor to fix this critical vulnerability and prevent potential attacks.",
    "software": [
      "PHPGurukul Bank Locker Management System 1.0",
      "/aboutus.php"
    ]
  },
  {
    "cve_id": "CVE-2025-2675",
    "description": "A vulnerability, which was classified as critical, has been found in PHPGurukul Bank Locker Management System 1.0. Affected by this issue is some unknown functionality of the file /add-lockertype.php. The manipulation of the argument lockerprice leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Bank Locker Management System 1.0 has a critical vulnerability that can be exploited through a SQL injection attack. This vulnerability affects anyone using the system and can be exploited remotely. To mitigate the risk, users should update the system to a patched version as soon as possible.",
    "software": [
      "PHPGurukul Bank Locker Management System 1.0",
      "/add-lockertype.php"
    ]
  },
  {
    "cve_id": "CVE-2025-2676",
    "description": "A vulnerability, which was classified as critical, was found in PHPGurukul Bank Locker Management System 1.0. This affects an unknown part of the file /add-subadmin.php. The manipulation of the argument sadminusername leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul Bank Locker Management System 1.0 allows attackers to remotely initiate a SQL injection attack by manipulating a specific file. This could potentially affect anyone using the system. Users should update the system to the latest version or implement appropriate security measures to mitigate the risk of exploitation.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2677",
    "description": "A vulnerability has been found in PHPGurukul Bank Locker Management System 1.0 and classified as critical. This vulnerability affects unknown code of the file /changeidproof.php. The manipulation of the argument editid leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Bank Locker Management System 1.0 has a critical vulnerability that allows for SQL injection through the \"editid\" argument in the file /changeidproof.php. This vulnerability can be exploited remotely, and it is recommended that users update their software or patch it to prevent any potential attacks.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2678",
    "description": "A vulnerability was found in PHPGurukul Bank Locker Management System 1.0 and classified as critical. This issue affects some unknown processing of the file /changeimage1.php. The manipulation of the argument editid leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Bank Locker Management System 1.0 has a critical vulnerability that allows attackers to perform a SQL injection attack by manipulating certain file arguments. This vulnerability can be exploited remotely and is a serious threat to the security of the system. Users of this system should take immediate action to patch or update the software to prevent potential attacks.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2679",
    "description": "A vulnerability was found in PHPGurukul Bank Locker Management System 1.0. It has been classified as critical. Affected is an unknown function of the file /contact-us.php. The manipulation of the argument pagetitle leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This CVE is about a critical vulnerability in the PHPGurukul Bank Locker Management System 1.0. The vulnerability allows for SQL injection through manipulation of the pagetitle argument in the contact-us.php file, which can be exploited remotely. Users of this system should take immediate action to update or patch the software to prevent any potential attacks.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2680",
    "description": "A vulnerability was found in PHPGurukul Bank Locker Management System 1.0. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file /edit-assign-locker.php?ltid=1. The manipulation of the argument mobilenumber leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Bank Locker Management System 1.0 has a critical vulnerability that allows for a SQL injection attack through manipulation of the file /edit-assign-locker.php?ltid=1. This vulnerability can be exploited remotely, putting any user of the system at risk. To mitigate this threat, users should update their software to a version that addresses this vulnerability as soon as possible.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2681",
    "description": "A vulnerability was found in PHPGurukul Bank Locker Management System 1.0. It has been rated as critical. Affected by this issue is some unknown functionality of the file /edit-locker.php?ltid=6. The manipulation of the argument lockersize leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "A critical vulnerability has been found in the PHPGurukul Bank Locker Management System 1.0, which can be exploited through a SQL injection attack by manipulating the argument lockersize in the file /edit-locker.php?ltid=6. This vulnerability can be exploited remotely and the exploit has been made public, putting all users of the system at risk. Users should take immediate action to patch this vulnerability to prevent any potential attacks.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2682",
    "description": "A vulnerability classified as critical has been found in PHPGurukul Bank Locker Management System 1.0. This affects an unknown part of the file /edit-subadmin.php?said=3. The manipulation of the argument mobilenumber leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Bank Locker Management System 1.0 has a critical vulnerability that allows for SQL injection through the manipulation of the mobilenumber argument in the /edit-subadmin.php file. This vulnerability can be exploited remotely and has been made public, making it a serious threat. Users of this system should update to a patched version as soon as possible to protect against potential attacks.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2683",
    "description": "A vulnerability classified as critical was found in PHPGurukul Bank Locker Management System 1.0. This vulnerability affects unknown code of the file /profile.php. The manipulation of the argument mobilenumber leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "A critical vulnerability was found in PHPGurukul Bank Locker Management System 1.0, allowing for remote SQL injection attacks through manipulation of the mobilenumber argument in the /profile.php file. This vulnerability poses a threat to users of the system and their data. To protect against this threat, users should update to a patched version of the software as soon as possible.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2684",
    "description": "A vulnerability, which was classified as critical, has been found in PHPGurukul Bank Locker Management System 1.0. This issue affects some unknown processing of the file /search-report-details.php. The manipulation of the argument searchinput leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This is a critical vulnerability found in the PHPGurukul Bank Locker Management System 1.0 that can be exploited through SQL injection by manipulating a specific file. It can be initiated remotely and may already be known to attackers. Users of this system should update to a patched version to protect against potential attacks.",
    "software": [
      "PHPGurukul Bank Locker Management System"
    ]
  },
  {
    "cve_id": "CVE-2024-10558",
    "description": "The Form Maker by 10Web  WordPress plugin before 1.15.30 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Form Maker plugin for WordPress allows high privilege users to carry out Stored Cross-Site Scripting attacks, even if certain capabilities are restricted. This could affect websites using the vulnerable plugin, particularly in a multisite setup. Users should update to version 1.15.30 or later to protect against this issue.",
    "software": [
      "Form Maker by 10Web"
    ]
  },
  {
    "cve_id": "CVE-2024-13124",
    "description": "The Photo Gallery by 10Web  WordPress plugin before 1.8.33 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Photo Gallery by 10Web WordPress plugin allows high privilege users to perform Stored Cross-Site Scripting attacks, even if certain permissions are restricted. This could affect websites using the plugin, potentially giving hackers unauthorized access to sensitive information. Users should update the plugin to version 1.8.33 or higher to protect against this threat.",
    "software": [
      "Photo Gallery by 10Web WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1062",
    "description": "The Slider, Gallery, and Carousel by MetaSlider  WordPress plugin before 3.95.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Slider, Gallery, and Carousel by MetaSlider WordPress plugin allows high privilege users to execute stored cross-site scripting attacks, even if certain capabilities are restricted. Users should update their plugin to version 3.95.0 or higher to protect against this threat.",
    "software": [
      "Slider",
      "Gallery",
      "Carousel by MetaSlider",
      "WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1203",
    "description": "The Slider, Gallery, and Carousel by MetaSlider  WordPress plugin before 3.95.0 does not sanitise and escape some of its settings, which could allow high privilege users such as editor to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Slider, Gallery, and Carousel by MetaSlider WordPress plugin is vulnerable to Stored Cross-Site Scripting attacks, which could allow high privilege users to insert malicious code into a website. This affects users of the plugin before version 3.95.0, particularly those using multisite setups. To protect against this threat, users should update to version 3.95.0 or later.",
    "software": [
      "MetaSlider"
    ]
  },
  {
    "cve_id": "CVE-2025-2686",
    "description": "A vulnerability has been found in mingyuefusu 明月复苏 tushuguanlixitong 图书管理系统 up to d4836f6b49cd0ac79a4021b15ce99ff7229d4694 and classified as critical. Affected by this vulnerability is the function doFilter of the file /admin/ of the component Backend. The manipulation of the argument Request leads to improper access controls. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in the mingyuefusu library management system can be exploited by attackers to gain unauthorized access to system functions. It can affect users of the system up to a certain version. It is recommended to update the system to the latest version to patch this vulnerability and prevent potential attacks.",
    "software": [
      "mingyuefusu 明月复苏",
      "tushuguanlixitong 图书管理系统"
    ]
  },
  {
    "cve_id": "CVE-2025-2687",
    "description": "A vulnerability classified as critical has been found in PHPGurukul eLearning System 1.0. Affected is an unknown function of the file /user/index.php of the component Image Handler. The manipulation leads to unrestricted upload. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul eLearning System 1.0 has a critical vulnerability that allows for unrestricted file uploads through the Image Handler component, which could be exploited remotely. This vulnerability affects users of this system, and action should be taken immediately to update the software to a patched version to prevent the exploit from being used.",
    "software": [
      "PHPGurukul eLearning System",
      "Image Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2688",
    "description": "A vulnerability classified as problematic was found in TOTOLINK A3000RU up to 5.9c.5185. Affected by this vulnerability is an unknown functionality of the file /cgi-bin/ExportSyslog.sh of the component Syslog Configuration File Handler. The manipulation leads to improper access controls. The attack needs to be done within the local network. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in the TOTOLINK A3000RU router allows attackers within the local network to manipulate files and gain improper access controls. Users should update their router's firmware to the latest version to protect against this exploit.",
    "software": [
      "TOTOLINK A3000RU",
      "Syslog Configuration File Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2689",
    "description": "A vulnerability, which was classified as critical, has been found in yiisoft Yii2 up to 2.0.45. Affected by this issue is the function getIterator of the file symfony\\finder\\Iterator\\SortableIterator.php. The manipulation leads to deserialization. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This CVE is a critical vulnerability found in yiisoft Yii2 up to version 2.0.45. The issue affects the getIterator function in the file symfony\\finder\\Iterator\\SortableIterator.php, allowing for remote attacks that could lead to deserialization. Users of this software should update to a patched version as soon as possible to protect against potential exploits.",
    "software": [
      "yiisoft Yii2"
    ]
  },
  {
    "cve_id": "CVE-2025-2690",
    "description": "A vulnerability, which was classified as critical, was found in yiisoft Yii2 up to 2.0.39. This affects the function Generate of the file phpunit\\src\\Framework\\MockObject\\MockClass.php. The manipulation leads to deserialization. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "A critical vulnerability was found in yiisoft Yii2 up to version 2.0.39, which allows attackers to remotely initiate a deserialization attack by manipulating the Generate function in the file MockClass.php. This vulnerability affects users of Yii2. Action should be taken to update to a patched version of Yii2 to protect against this exploit.",
    "software": [
      "yiisoft Yii2"
    ]
  },
  {
    "cve_id": "CVE-2025-2699",
    "description": "A vulnerability was found in GetmeUK ContentTools up to 1.6.16. It has been rated as problematic. Affected by this issue is some unknown functionality of the component Image Handler. The manipulation of the argument onload leads to cross site scripting. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A vulnerability has been found in GetmeUK ContentTools up to version 1.6.16 that allows for cross-site scripting attacks through the Image Handler component. This issue affects users of the ContentTools software. To mitigate this threat, users should update their software to the latest version and take precautionary measures to prevent potential attacks. It is concerning that the vendor has not responded to the disclosure of this exploit.",
    "software": [
      "GetmeUK ContentTools",
      "Image Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2700",
    "description": "A vulnerability classified as problematic has been found in michelson Dante Editor up to 0.4.4. This affects an unknown part of the component Insert Link Handler. The manipulation leads to cross site scripting. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The Dante Editor software up to version 0.4.4 has a vulnerability that could allow attackers to conduct cross-site scripting attacks. This could affect anyone using this software. To protect against this threat, users should update to the latest version of the software if one becomes available and be cautious of clicking on unknown links.",
    "software": [
      "michelson Dante Editor"
    ]
  },
  {
    "cve_id": "CVE-2025-2701",
    "description": "A vulnerability classified as critical was found in AMTT Hotel Broadband Operation System 1.0. This vulnerability affects the function popen of the file /manager/network/port_setup.php. The manipulation of the argument SwitchVersion/SwitchWrite/SwitchIP/SwitchIndex/SwitchState leads to os command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability found in the AMTT Hotel Broadband Operation System can be exploited by a remote attacker through manipulating certain arguments in a specific file, allowing for os command injection. This could potentially affect users of this system and their sensitive data. It is advised to update the system as soon as possible to mitigate the risk of being exploited.",
    "software": [
      "AMTT Hotel Broadband Operation System"
    ]
  },
  {
    "cve_id": "CVE-2025-2702",
    "description": "A vulnerability, which was classified as critical, has been found in Softwin WMX3 3.1. This issue affects the function ImageAdd of the file /ImageAdd.ashx. The manipulation of the argument File leads to unrestricted upload. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This critical vulnerability in Softwin WMX3 3.1 allows for unrestricted file uploads through the ImageAdd function in the /ImageAdd.ashx file. This can be exploited remotely and has been publicly disclosed. Users of Softwin WMX3 3.1 should take immediate action by disabling or securing the ImageAdd function until a patch or fix is available.",
    "software": [
      "Softwin WMX3 3.1"
    ]
  },
  {
    "cve_id": "CVE-2025-0478",
    "description": "Software installed and run as a non-privileged user may conduct improper GPU system calls to issue reads and writes to arbitrary physical memory pages.\n\nUnder certain circumstances this exploit could be used to corrupt data pages not allocated by the GPU driver but memory pages in use by the kernel and drivers running on the platform, altering their behaviour.",
    "summary": "This vulnerability allows software being used by a regular user to improperly access and manipulate the memory of the computer's GPU, potentially causing data corruption and altering the behavior of the system. It affects any system running software with GPU access privileges. To mitigate this risk, users should install security updates provided by the software vendor to patch the vulnerability.",
    "software": [
      "GPU driver"
    ]
  },
  {
    "cve_id": "CVE-2025-0835",
    "description": "Software installed and run as a non-privileged user may conduct improper GPU system calls to corrupt kernel heap memory.",
    "summary": "This vulnerability allows software running as a regular user to exploit the GPU system calls in a way that can corrupt the kernel heap memory. This could potentially lead to a system crash or other malicious activities. Users of systems with GPUs should make sure to apply any patches or updates provided by their software vendors to mitigate this risk.",
    "software": [
      "GPU system calls"
    ]
  },
  {
    "cve_id": "CVE-2024-8773",
    "description": "SIMPLE.ERP client is vulnerable to MS SQL protocol downgrade request from a server side, what could lead to an unencrypted communication vulnerable to data interception and modification.\n\nThis issue affect SIMPLE.ERP from 6.20 to 6.30. Only the 6.30 version received a patch 6.30@a03.9, which make it possible for an administrator to enforce encrypted communication. Versions 6.20 and 6.25 remain unpatched.",
    "summary": "The vulnerability in SIMPLE.ERP allows for unencrypted communication, making data interception and modification possible. This affects versions 6.20 to 6.30, with only version 6.30 receiving a patch to enforce encrypted communication. Users of versions 6.20 and 6.25 should take action by updating to the patched version or implementing additional security measures to protect their data.",
    "software": [
      "SIMPLE.ERP"
    ]
  },
  {
    "cve_id": "CVE-2024-8774",
    "description": "The SIMPLE.ERP client stores superuser password in a recoverable format, allowing any authenticated SIMPLE.ERP user to escalate privileges to a database administrator.\n\nThis issue affect SIMPLE.ERP from 6.20 through 6.30. Only the 6.30 version received a patch 6.30@a03.9, which removed the vulnerability. Versions 6.20 and 6.25 remain unpatched.",
    "summary": "The vulnerability in SIMPLE.ERP allows any authenticated user to escalate their privileges to a database administrator by accessing the stored superuser password. This affects versions 6.20 and 6.25 of the software, as only version 6.30 has received a patch to fix the vulnerability. Users of affected versions should update to version 6.30@a03.9 to protect against this threat.",
    "software": [
      "SIMPLE.ERP"
    ]
  },
  {
    "cve_id": "CVE-2025-30521",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in giangmd93 GP Back To Top allows Cross Site Request Forgery. This issue affects GP Back To Top: from n/a through 3.0.",
    "summary": "This vulnerability in GP Back To Top allows for Cross-Site Request Forgery (CSRF) attacks, where unauthorized commands can be executed on behalf of a user. It affects versions of GP Back To Top up to 3.0. Users should update to the latest version of GP Back To Top to protect against this threat.",
    "software": [
      "GP Back To Top"
    ]
  },
  {
    "cve_id": "CVE-2025-30522",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Damian Orzol Contact Form 7 Material Design allows Stored XSS. This issue affects Contact Form 7 Material Design: from n/a through 1.0.0.",
    "summary": "This vulnerability in Damian Orzol Contact Form 7 Material Design allows attackers to execute malicious scripts on a user's browser, affecting anyone using the Contact Form 7 Material Design plugin version up to 1.0.0. Users should update their plugin to version 1.0.1 or higher to protect themselves from this threat.",
    "software": [
      "Contact Form 7 Material Design"
    ]
  },
  {
    "cve_id": "CVE-2025-30523",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Marcel-NL Super Simple Subscriptions allows SQL Injection. This issue affects Super Simple Subscriptions: from n/a through 1.1.0.",
    "summary": "This vulnerability in Marcel-NL Super Simple Subscriptions allows attackers to inject malicious SQL commands, potentially gaining unauthorized access to sensitive data. It affects versions from n/a through 1.1.0. Users should update to the latest version to mitigate this threat.",
    "software": [
      "Marcel-NL Super Simple Subscriptions"
    ]
  },
  {
    "cve_id": "CVE-2025-30525",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in ProfitShare.ro WP Profitshare allows SQL Injection. This issue affects WP Profitshare: from n/a through 1.4.9.",
    "summary": "This vulnerability in the ProfitShare.ro WP Profitshare plugin allows attackers to execute malicious SQL commands, potentially gaining unauthorized access to the website's database. This security flaw affects WP Profitshare versions from n/a through 1.4.9. It is recommended that users update to the latest version of the plugin to mitigate the risk of exploitation.",
    "software": [
      "ProfitShare.ro WP Profitshare"
    ]
  },
  {
    "cve_id": "CVE-2025-30526",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in lucksy Typekit plugin for WordPress allows Cross Site Request Forgery. This issue affects Typekit plugin for WordPress: from n/a through 1.2.3.",
    "summary": "The lucksy Typekit plugin for WordPress has a vulnerability that allows for Cross-Site Request Forgery (CSRF) attacks. This means that attackers can potentially execute unauthorized actions on behalf of users. Users who have the Typekit plugin installed on their WordPress site between versions n/a and 1.2.3 are at risk. To protect against this threat, users should update their Typekit plugin to the latest version available.",
    "software": [
      "lucksy Typekit plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-30527",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in codetoolbox My Bootstrap Menu allows Stored XSS. This issue affects My Bootstrap Menu: from n/a through 1.2.1.",
    "summary": "This vulnerability in codetoolbox My Bootstrap Menu allows an attacker to insert malicious code into a web page, potentially affecting users who visit the infected site. To mitigate this threat, users should update My Bootstrap Menu to version 1.2.2 or later.",
    "software": [
      "My Bootstrap Menu"
    ]
  },
  {
    "cve_id": "CVE-2025-30528",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in wpshopee Awesome Logos allows SQL Injection. This issue affects Awesome Logos: from n/a through 1.2.",
    "summary": "This vulnerability in Awesome Logos plugin for WordPress can allow an attacker to inject malicious code, potentially leading to unauthorized access to the website's database. Website owners using Awesome Logos version n/a through 1.2 should update to the latest version to prevent this security threat.",
    "software": [
      "wpshopee Awesome Logos"
    ]
  },
  {
    "cve_id": "CVE-2025-30529",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Sébastien Dumont Auto Load Next Post allows Cross Site Request Forgery. This issue affects Auto Load Next Post: from n/a through 1.5.14.",
    "summary": "The CSRF vulnerability in Sébastien Dumont Auto Load Next Post allows for unauthorized requests to be made on behalf of a user. This vulnerability affects versions of Auto Load Next Post from n/a through 1.5.14. Users should update to the latest version of the plugin to protect against this threat.",
    "software": [
      "Sébastien Dumont Auto Load Next Post"
    ]
  },
  {
    "cve_id": "CVE-2025-30530",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Atikul AI Preloader allows Stored XSS. This issue affects AI Preloader: from n/a through 1.0.2.",
    "summary": "This vulnerability in Atikul AI Preloader allows for a type of cyber attack known as Cross-site Scripting, which can be used by attackers to inject malicious code into web pages. This vulnerability affects versions of AI Preloader from n/a through 1.0.2. Users of AI Preloader should update to the latest version to patch this vulnerability and protect against potential attacks.",
    "software": [
      "Atikul AI Preloader"
    ]
  },
  {
    "cve_id": "CVE-2025-30531",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in GBS Developer WP Ride Booking allows Cross Site Request Forgery. This issue affects WP Ride Booking: from n/a through 2.4.",
    "summary": "This vulnerability in GBS Developer WP Ride Booking permits Cross-Site Request Forgery attacks. It affects WP Ride Booking versions from n/a through 2.4. Users should update to the latest version of the plugin to protect against this threat.",
    "software": [
      "GBS Developer WP Ride Booking",
      "WP Ride Booking"
    ]
  },
  {
    "cve_id": "CVE-2025-30532",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in MorganF Weather Layer allows Stored XSS. This issue affects Weather Layer: from n/a through 4.2.1.",
    "summary": "This vulnerability in MorganF Weather Layer allows for a type of cyber attack called Cross-site Scripting (XSS), specifically Stored XSS. This vulnerability affects Weather Layer versions from n/a through 4.2.1. Users should update their Weather Layer to the latest version to protect against this vulnerability.",
    "software": [
      "MorganF Weather Layer"
    ]
  },
  {
    "cve_id": "CVE-2025-30533",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in gopiplus Message ticker allows Stored XSS. This issue affects Message ticker: from n/a through 9.3.",
    "summary": "This vulnerability in gopiplus Message ticker allows for a type of cyber attack known as Cross-site Scripting (XSS), which could allow an attacker to inject malicious code into a website and potentially steal sensitive information from users. It affects versions of Message ticker from n/a through 9.3. Users should update to the latest version of Message ticker to protect against this vulnerability.",
    "software": [
      "gopiplus Message ticker"
    ]
  },
  {
    "cve_id": "CVE-2025-30534",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in captcha.soft Image Captcha allows Cross Site Request Forgery. This issue affects Image Captcha: from n/a through 1.2.",
    "summary": "This vulnerability in Image Captcha software allows attackers to trick users into unknowingly submitting malicious requests by bypassing security measures. It affects users of Image Captcha versions up to 1.2. To prevent exploitation, users should update to the latest version of Image Captcha or consider using an alternative security solution.",
    "software": [
      "captcha.soft Image Captcha"
    ]
  },
  {
    "cve_id": "CVE-2025-30535",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in muro External image replace allows Cross Site Request Forgery. This issue affects External image replace: from n/a through 1.0.8.",
    "summary": "This vulnerability in the muro External image replace plugin allows for Cross-Site Request Forgery (CSRF) attacks. It affects versions from n/a through 1.0.8. CSRF attacks can allow hackers to perform actions on behalf of the user without their consent. To protect against this threat, users should update the plugin to the latest version as soon as possible.",
    "software": [
      "muro External image replace"
    ]
  },
  {
    "cve_id": "CVE-2025-30536",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in zeitwesentech Beautiful Link Preview allows Stored XSS. This issue affects Beautiful Link Preview: from n/a through 1.5.0.",
    "summary": "This vulnerability in zeitwesentech Beautiful Link Preview allows attackers to inject malicious code into web pages, which can then affect users who visit those pages. The vulnerability affects Beautiful Link Preview versions from n/a through 1.5.0. Users should update to the latest version of the software to protect against this threat.",
    "software": [
      "Beautiful Link Preview"
    ]
  },
  {
    "cve_id": "CVE-2025-30537",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Cristian Sarov Upload Quota per User allows Stored XSS. This issue affects Upload Quota per User: from n/a through 1.3.",
    "summary": "This vulnerability in Cristian Sarov Upload Quota per User allows for a type of attack called Stored Cross-site Scripting, which could allow an attacker to execute malicious scripts in a user's web browser. This vulnerability affects Upload Quota per User versions from n/a through 1.3. Users should update to the latest version of the software to mitigate the risk of this vulnerability.",
    "software": [
      "Cristian Sarov Upload Quota per User"
    ]
  },
  {
    "cve_id": "CVE-2025-30538",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in ChrisHurst Simple Optimizer allows Cross Site Request Forgery. This issue affects Simple Optimizer: from n/a through 1.2.7.",
    "summary": "This vulnerability in ChrisHurst Simple Optimizer allows attackers to perform Cross-Site Request Forgery attacks. It affects all versions of Simple Optimizer up to 1.2.7. Users of Simple Optimizer should update to the latest version to protect against this threat.",
    "software": [
      "ChrisHurst Simple Optimizer"
    ]
  },
  {
    "cve_id": "CVE-2025-30539",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Benedikt Mo BMo Expo allows Stored XSS. This issue affects BMo Expo: from n/a through 1.0.15.",
    "summary": "This vulnerability in Benedikt Mo BMo Expo allows hackers to inject harmful code into web pages, potentially leading to attacks on users who visit those pages. It affects BMo Expo versions from n/a through 1.0.15. Users should update the software to version 1.0.16 or higher to protect against this threat.",
    "software": [
      "BMo Expo"
    ]
  },
  {
    "cve_id": "CVE-2025-30540",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in avaibook AvaiBook allows Stored XSS. This issue affects AvaiBook: from n/a through 1.2.",
    "summary": "This vulnerability in AvaiBook allows for a type of cyber attack known as cross-site scripting, which can lead to injecting malicious code into web pages. This affects AvaiBook versions from n/a through 1.2. Users should update to the latest version of AvaiBook to mitigate this threat.",
    "software": [
      "avaibook"
    ]
  },
  {
    "cve_id": "CVE-2025-30541",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in OTWthemes Info Boxes Shortcode and Widget allows Cross Site Request Forgery. This issue affects Info Boxes Shortcode and Widget: from n/a through 1.15.",
    "summary": "This vulnerability in Info Boxes Shortcode and Widget allows for Cross-Site Request Forgery attacks. It affects versions from n/a through 1.15. Users should update to the latest version of the plugin to protect against this threat.",
    "software": [
      "OTWthemes Info Boxes Shortcode",
      "Widget"
    ]
  },
  {
    "cve_id": "CVE-2025-30542",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in wpsolutions SoundCloud Ultimate allows Cross Site Request Forgery. This issue affects SoundCloud Ultimate: from n/a through 1.5.",
    "summary": "This vulnerability in the SoundCloud Ultimate plugin allows attackers to manipulate a user's actions on the website without their knowledge. It affects users of SoundCloud Ultimate versions from n/a to 1.5. Users should update the plugin to the latest version to protect against this threat.",
    "software": [
      "SoundCloud Ultimate"
    ]
  },
  {
    "cve_id": "CVE-2025-30543",
    "description": "Missing Authorization vulnerability in swayam.tejwani Menu Duplicator allows Exploiting Incorrectly Configured Access Control Security Levels. This issue affects Menu Duplicator: from n/a through 1.0.",
    "summary": "The Missing Authorization vulnerability in the Menu Duplicator plugin allows attackers to exploit incorrectly configured access control security levels. This vulnerability affects Menu Duplicator versions from n/a through 1.0. Users should update to the latest version of Menu Duplicator to patch this security flaw and prevent potential unauthorized access to their website.",
    "software": [
      "Menu Duplicator"
    ]
  },
  {
    "cve_id": "CVE-2025-30545",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in pixeline issuuPress allows Stored XSS. This issue affects issuuPress: from n/a through 1.3.2.",
    "summary": "This vulnerability in pixeline issuuPress allows for stored cross-site scripting, which could allow attackers to inject malicious code into web pages. This affects all versions of issuuPress up to 1.3.2. Users should update to the latest version of issuuPress to protect against this vulnerability.",
    "software": [
      "issuuPress"
    ]
  },
  {
    "cve_id": "CVE-2025-30546",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in boroV Cackle allows Cross Site Request Forgery. This issue affects Cackle: from n/a through 4.33.",
    "summary": "The CSRF vulnerability in boroV Cackle allows attackers to perform unauthorized actions on behalf of a logged-in user. This vulnerability affects Cackle versions from n/a through 4.33. Users should update to the latest version of Cackle to mitigate this threat.",
    "software": [
      "boroV Cackle"
    ]
  },
  {
    "cve_id": "CVE-2025-30549",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Yummly Yummly Rich Recipes allows Cross Site Request Forgery. This issue affects Yummly Rich Recipes: from n/a through 4.2.",
    "summary": "A Cross-Site Request Forgery (CSRF) vulnerability in Yummly Yummly Rich Recipes could allow attackers to make unauthorized requests on behalf of a user. This vulnerability affects Yummly Rich Recipes versions from n/a through 4.2. Users should update to the latest version of the app to mitigate the risk of CSRF attacks.",
    "software": [
      "Yummly Yummly Rich Recipes"
    ]
  },
  {
    "cve_id": "CVE-2025-30550",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in WPShop.ru CallPhone'r allows Stored XSS. This issue affects CallPhone'r: from n/a through 1.1.1.",
    "summary": "This vulnerability in WPShop.ru CallPhone'r allows attackers to perform malicious actions on behalf of a logged-in user, potentially leading to data theft or unauthorized actions. It affects versions of CallPhone'r from n/a through 1.1.1. Users should update to the latest version of the software to protect against this threat.",
    "software": [
      "WPShop.ru CallPhone'r"
    ]
  },
  {
    "cve_id": "CVE-2025-30551",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in smartredfox Pretty file links allows Stored XSS. This issue affects Pretty file links: from n/a through 0.9.",
    "summary": "A vulnerability in smartredfox Pretty file links allows for a type of cyber attack known as Cross-site Scripting (XSS). This vulnerability affects Pretty file links versions up to 0.9. Users are advised to update to the latest version of Pretty file links to protect against this vulnerability.",
    "software": [
      "smartredfox Pretty file links"
    ]
  },
  {
    "cve_id": "CVE-2025-30552",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Donald Gilbert WordPress Admin Bar Improved allows Stored XSS. This issue affects WordPress Admin Bar Improved: from n/a through 3.3.5.",
    "summary": "This vulnerability in the WordPress Admin Bar Improved plugin allows for a Cross-Site Request Forgery attack, potentially leading to a Stored XSS attack. This affects users of the plugin version n/a through 3.3.5. To address this issue, users should update to the latest version of the plugin as soon as possible to protect against potential attacks.",
    "software": [
      "WordPress Admin Bar Improved"
    ]
  },
  {
    "cve_id": "CVE-2025-30553",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Z.com byGMO GMO Font Agent allows Stored XSS. This issue affects GMO Font Agent: from n/a through 1.6.",
    "summary": "This vulnerability in Z.com's GMO Font Agent software allows for a type of cyber attack known as Stored Cross-Site Scripting (XSS). It can affect any users of GMO Font Agent versions n/a through 1.6. To protect against this threat, users should update their GMO Font Agent software to the latest version available.",
    "software": [
      "Z.com byGMO GMO Font Agent"
    ]
  },
  {
    "cve_id": "CVE-2025-30555",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in iiiryan WordPres 同步微博 allows Stored XSS. This issue affects WordPres 同步微博: from n/a through 1.1.0.",
    "summary": "This vulnerability in the WordPres 同步微博 plugin allows for Cross-Site Request Forgery (CSRF) attacks and Stored Cross-Site Scripting (XSS) attacks. This can affect users of WordPres 同步微博 versions from n/a to 1.1.0. Users should update to the latest version of the plugin to protect against these types of attacks.",
    "software": [
      "iiiryan WordPres 同步微博"
    ]
  },
  {
    "cve_id": "CVE-2025-30556",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in flyaga Fix Rss Feeds allows Cross Site Request Forgery. This issue affects Fix Rss Feeds: from n/a through 3.1.",
    "summary": "This vulnerability in Fix Rss Feeds allows attackers to send unauthorized requests on behalf of a user, potentially leading to actions being taken without the user's consent. It affects users of Fix Rss Feeds up to version 3.1. Users should update their software to the latest version to patch this vulnerability and protect against CSRF attacks.",
    "software": [
      "flyaga Fix Rss Feeds"
    ]
  },
  {
    "cve_id": "CVE-2025-30557",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in odihost Easy 301 Redirects allows Cross Site Request Forgery. This issue affects Easy 301 Redirects: from n/a through 1.33.",
    "summary": "This vulnerability in Easy 301 Redirects allows attackers to forge requests, potentially leading to unauthorized actions being taken on behalf of the victim. This issue affects Easy 301 Redirects versions from n/a through 1.33. Users should update to the latest version of the software to mitigate this threat and protect their systems from potential attacks.",
    "software": [
      "odihost Easy 301 Redirects"
    ]
  },
  {
    "cve_id": "CVE-2025-30558",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in EnzoCostantini55 ANAC XML Render allows Stored XSS. This issue affects ANAC XML Render: from n/a through 1.5.7.",
    "summary": "This vulnerability in EnzoCostantini55 ANAC XML Render could allow an attacker to carry out Cross-Site Request Forgery (CSRF) attacks and potentially execute stored cross-site scripting (XSS) on the affected system. It affects versions of ANAC XML Render from n/a through 1.5.7. Users should update their software to the latest version to protect against this threat.",
    "software": [
      "EnzoCostantini55 ANAC XML Render"
    ]
  },
  {
    "cve_id": "CVE-2025-30560",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Sana Ullah jQuery Dropdown Menu allows Stored XSS. This issue affects jQuery Dropdown Menu: from n/a through 3.0.",
    "summary": "This vulnerability in the Sana Ullah jQuery Dropdown Menu allows attackers to execute malicious scripts on a website, potentially leading to unauthorized actions being taken on behalf of the user. It affects versions of the jQuery Dropdown Menu up to 3.0. Website administrators should update to the latest version of the dropdown menu to prevent this vulnerability from being exploited.",
    "software": [
      "Sana Ullah jQuery Dropdown Menu"
    ]
  },
  {
    "cve_id": "CVE-2025-30561",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Henrique Mouta CAS Maestro allows Stored XSS. This issue affects CAS Maestro: from n/a through 1.1.3.",
    "summary": "This vulnerability in Henrique Mouta CAS Maestro allows attackers to perform Cross-Site Request Forgery and Stored XSS attacks. It affects CAS Maestro versions from n/a through 1.1.3. To mitigate this threat, users should update to the latest version of CAS Maestro as soon as possible.",
    "software": [
      "Henrique Mouta CAS Maestro"
    ]
  },
  {
    "cve_id": "CVE-2025-30564",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in wpwox Custom Script Integration allows Stored XSS. This issue affects Custom Script Integration: from n/a through 2.1.",
    "summary": "This vulnerability in wpwox Custom Script Integration allows for Cross-Site Request Forgery (CSRF) attacks which can lead to Stored Cross-Site Scripting (XSS) attacks. This can affect users of Custom Script Integration versions from n/a through 2.1. Users should update to the latest version of Custom Script Integration to protect against this threat.",
    "software": [
      "wpwox Custom Script Integration"
    ]
  },
  {
    "cve_id": "CVE-2025-30565",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in karrikas banner-manager allows Stored XSS. This issue affects banner-manager: from n/a through 16.04.19.",
    "summary": "This vulnerability in karrikas banner-manager allows attackers to perform unauthorized actions on behalf of an authenticated user, potentially leading to the theft of sensitive information or account takeover. This issue affects all versions of banner-manager up to 16.04.19. Users should update to the latest version of banner-manager to patch this vulnerability and protect their systems from potential attacks.",
    "software": [
      "karrikas banner-manager"
    ]
  },
  {
    "cve_id": "CVE-2025-30566",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Aryan Themes Clink allows DOM-Based XSS. This issue affects Clink: from n/a through 1.2.2.",
    "summary": "This vulnerability in Aryan Themes Clink allows attackers to execute malicious scripts on a user's web browser, leading to possible theft of sensitive information or unauthorized actions. It affects all versions of Clink up to 1.2.2. Users should update to the latest version of Clink to protect against this threat.",
    "software": [
      "Aryan Themes Clink"
    ]
  },
  {
    "cve_id": "CVE-2025-30568",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in hitoy Super Static Cache allows Cross Site Request Forgery. This issue affects Super Static Cache: from n/a through 3.3.5.",
    "summary": "This vulnerability in hitoy Super Static Cache allows attackers to make unauthorized requests on behalf of a user. It affects Super Static Cache versions from n/a to 3.3.5. Users should update to the latest version of the software to protect against this threat.",
    "software": [
      "hitoy Super Static Cache"
    ]
  },
  {
    "cve_id": "CVE-2025-30569",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Jahertor WP Featured Entries allows SQL Injection. This issue affects WP Featured Entries: from n/a through 1.0.",
    "summary": "This vulnerability in Jahertor WP Featured Entries allows attackers to inject harmful SQL commands, potentially gaining unauthorized access to the website. It affects versions of WP Featured Entries from n/a through 1.0. Users should update to the latest version of the plugin to protect against this threat.",
    "software": [
      "Jahertor WP Featured Entries"
    ]
  },
  {
    "cve_id": "CVE-2025-30570",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in AliRezaMohammadi دکمه، شبکه اجتماعی خرید allows SQL Injection. This issue affects دکمه، شبکه اجتماعی خرید: from n/a through 2.0.6.",
    "summary": "This vulnerability in AliRezaMohammadi دکمه، شبکه اجتماعی خرید allows attackers to execute SQL commands, potentially leading to data theft or manipulation. It affects versions from n/a through 2.0.6 of دکمه، شبکه اجتماعی خرید. Users should update to the latest version to mitigate this risk.",
    "software": [
      "AliRezaMohammadi دکمه",
      "شبکه اجتماعی خرید"
    ]
  },
  {
    "cve_id": "CVE-2025-30571",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in STEdb Corp. STEdb Forms allows SQL Injection. This issue affects STEdb Forms: from n/a through 1.0.4.",
    "summary": "A vulnerability has been found in STEdb Corp. STEdb Forms that allows hackers to execute malicious SQL commands, known as SQL injection. This vulnerability affects versions of STEdb Forms from n/a to 1.0.4. Users of STEdb Forms should update to the latest version to address this security threat.",
    "software": [
      "STEdb Forms"
    ]
  },
  {
    "cve_id": "CVE-2025-30572",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Igor Yavych Simple Rating allows Stored XSS. This issue affects Simple Rating: from n/a through 1.4.",
    "summary": "This vulnerability in Simple Rating plugin allows attackers to perform unauthorized actions on behalf of a logged-in user. This can potentially lead to sensitive information being exposed or malicious code being executed on the affected website. Users of Simple Rating plugin version n/a through 1.4 should update to the latest version to mitigate this threat.",
    "software": [
      "Simple Rating"
    ]
  },
  {
    "cve_id": "CVE-2025-30573",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in mrdenny My Default Post Content allows Stored XSS. This issue affects My Default Post Content: from n/a through 0.7.3.",
    "summary": "This vulnerability in the My Default Post Content plugin allows for Stored Cross-site Scripting (XSS) attacks. It affects versions n/a through 0.7.3 of the plugin. Users should update to the latest version of the plugin to protect against this threat.",
    "software": [
      "My Default Post Content"
    ]
  },
  {
    "cve_id": "CVE-2025-30574",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Jenst Mobile Navigation allows Stored XSS. This issue affects Mobile Navigation: from n/a through 1.5.",
    "summary": "This vulnerability in Jenst Mobile Navigation allows attackers to insert malicious code into web pages, causing harm to users who visit those pages. It affects versions from n/a through 1.5. Users should update their software to version 1.6 or higher to protect against this threat.",
    "software": [
      "Jenst Mobile Navigation"
    ]
  },
  {
    "cve_id": "CVE-2025-30575",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Arefly Login Redirect allows Stored XSS. This issue affects Login Redirect: from n/a through 1.0.5.",
    "summary": "This vulnerability in Arefly Login Redirect allows attackers to execute malicious scripts on a web page, which can potentially steal sensitive information or take control of the user's account. It affects versions of Login Redirect from n/a through 1.0.5. To protect against this threat, users should update their software to the latest version and avoid clicking on suspicious links.",
    "software": [
      "Arefly Login Redirect"
    ]
  },
  {
    "cve_id": "CVE-2025-30576",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in HuangYe WuDeng Hacklog Remote Image Autosave allows Cross Site Request Forgery. This issue affects Hacklog Remote Image Autosave: from n/a through 2.1.0.",
    "summary": "This vulnerability in HuangYe WuDeng Hacklog Remote Image Autosave allows attackers to execute unauthorized actions on behalf of a user. It affects versions from n/a through 2.1.0 of Hacklog Remote Image Autosave. To protect against this threat, users should update to the latest version of the software as soon as possible.",
    "software": [
      "Hacklog Remote Image Autosave"
    ]
  },
  {
    "cve_id": "CVE-2025-30577",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in mendibass Browser Address Bar Color allows Stored XSS. This issue affects Browser Address Bar Color: from n/a through 3.3.",
    "summary": "This CVE is a vulnerability in the Browser Address Bar Color plugin that allows for Cross-Site Request Forgery (CSRF) attacks and Stored XSS. This vulnerability affects versions of Browser Address Bar Color up to 3.3. Users of this plugin should update to the latest version to protect against potential attacks.",
    "software": [
      "mendibass Browser Address Bar Color"
    ]
  },
  {
    "cve_id": "CVE-2025-30578",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in hotvanrod AdSense Privacy Policy allows Stored XSS. This issue affects AdSense Privacy Policy: from n/a through 1.1.1.",
    "summary": "This vulnerability in AdSense Privacy Policy could allow an attacker to execute malicious code on a user's browser, potentially stealing sensitive information or taking unauthorized actions on their behalf. Users of AdSense Privacy Policy versions n/a through 1.1.1 are at risk. It is recommended to update to a patched version of AdSense Privacy Policy to mitigate the threat.",
    "software": [
      "AdSense Privacy Policy"
    ]
  },
  {
    "cve_id": "CVE-2025-30581",
    "description": "Missing Authorization vulnerability in PluginOps Top Bar allows Exploiting Incorrectly Configured Access Control Security Levels. This issue affects Top Bar: from n/a through 3.3.",
    "summary": "This vulnerability in PluginOps Top Bar allows attackers to exploit incorrectly configured access control security levels. It affects Top Bar versions from n/a through 3.3. Users should update to the latest version of Top Bar to mitigate the risk of unauthorized access to sensitive information.",
    "software": [
      "PluginOps Top Bar"
    ]
  },
  {
    "cve_id": "CVE-2025-30583",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in ProRankTracker Pro Rank Tracker allows Stored XSS. This issue affects Pro Rank Tracker: from n/a through 1.0.0.",
    "summary": "This vulnerability in ProRankTracker allows hackers to perform Cross-Site Request Forgery attacks and Stored Cross-Site Scripting attacks. It affects all versions of Pro Rank Tracker up to 1.0.0. Users should update their Pro Rank Tracker software to the latest version to protect against these attacks.",
    "software": [
      "ProRankTracker",
      "Pro Rank Tracker"
    ]
  },
  {
    "cve_id": "CVE-2025-30584",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in alphaomegaplugins AlphaOmega Captcha &amp; Anti-Spam Filter allows Stored XSS. This issue affects AlphaOmega Captcha &amp; Anti-Spam Filter: from n/a through 3.3.",
    "summary": "This vulnerability in the AlphaOmega Captcha & Anti-Spam Filter plugin allows attackers to launch Cross-Site Request Forgery attacks, potentially leading to Stored XSS attacks. This affects users of the plugin version n/a through 3.3. Users should update to the latest version of the plugin to protect against this threat.",
    "software": [
      "alphaomegaplugins AlphaOmega Captcha & Anti-Spam Filter"
    ]
  },
  {
    "cve_id": "CVE-2025-30585",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in marynixie Generate Post Thumbnails allows Cross Site Request Forgery. This issue affects Generate Post Thumbnails: from n/a through 0.8.",
    "summary": "This vulnerability allows attackers to trick users into unknowingly sending unauthorized requests to a website. It affects users of the Generate Post Thumbnails plugin version 0.8 and below. Users should update to the latest version of the plugin to protect against this threat.",
    "software": [
      "marynixie Generate Post Thumbnails"
    ]
  },
  {
    "cve_id": "CVE-2025-30586",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in bbodine1 cTabs allows Stored XSS. This issue affects cTabs: from n/a through 1.3.",
    "summary": "This vulnerability in cTabs allows hackers to make unauthorized requests on behalf of a user, potentially leading to stored cross-site scripting (XSS) attacks. It affects all versions of cTabs up to 1.3. Users should update to the latest version of cTabs to avoid exploitation by malicious actors.",
    "software": [
      "cTabs"
    ]
  },
  {
    "cve_id": "CVE-2025-30587",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in shawfactor LH OGP Meta allows Stored XSS. This issue affects LH OGP Meta: from n/a through 1.73.",
    "summary": "This vulnerability in LH OGP Meta allows attackers to perform malicious actions on behalf of website users, such as changing account settings or making unauthorized transactions. It affects versions from n/a through 1.73. Users should update to the latest version of LH OGP Meta to prevent potential exploitation.",
    "software": [
      "shawfactor LH OGP Meta"
    ]
  },
  {
    "cve_id": "CVE-2025-30588",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in ryan_xantoo Map Contact allows Stored XSS. This issue affects Map Contact: from n/a through 3.0.4.",
    "summary": "This vulnerability in ryan_xantoo Map Contact allows an attacker to send unauthorized requests on behalf of a user, potentially leading to the execution of malicious code. It affects versions of Map Contact up to 3.0.4. Users should update to the latest version to protect against this threat.",
    "software": [
      "ryan_xantoo Map Contact"
    ]
  },
  {
    "cve_id": "CVE-2025-30590",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Dourou Flickr set slideshows allows SQL Injection. This issue affects Flickr set slideshows: from n/a through 0.9.",
    "summary": "This vulnerability in Dourou Flickr set slideshows allows attackers to execute SQL commands, which can lead to unauthorized access to the database and potentially compromising sensitive information. This issue affects versions from n/a through 0.9. Users should update to the latest version to prevent exploitation of this vulnerability.",
    "software": [
      "Dourou Flickr set slideshows"
    ]
  },
  {
    "cve_id": "CVE-2025-30591",
    "description": "Missing Authorization vulnerability in tuyennv Music Press Pro allows Exploiting Incorrectly Configured Access Control Security Levels. This issue affects Music Press Pro: from n/a through 1.4.6.",
    "summary": "This vulnerability in Music Press Pro can allow malicious users to access or modify sensitive information due to incorrectly configured access control security levels. This affects users of Music Press Pro versions from n/a through 1.4.6. It is recommended to update to the latest version of Music Press Pro to address this issue and ensure proper authorization controls are in place.",
    "software": [
      "Music Press Pro"
    ]
  },
  {
    "cve_id": "CVE-2025-30592",
    "description": "Missing Authorization vulnerability in westerndeal Advanced Dewplayer allows Exploiting Incorrectly Configured Access Control Security Levels. This issue affects Advanced Dewplayer: from n/a through 1.6.",
    "summary": "This vulnerability in the Westerndeal Advanced Dewplayer software allows malicious actors to exploit incorrectly configured access control security levels. This issue affects all versions of Advanced Dewplayer up to 1.6. Users should update to the latest version of the software to patch this vulnerability and ensure their data is secure.",
    "software": [
      "Advanced Dewplayer"
    ]
  },
  {
    "cve_id": "CVE-2025-30593",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in samsk Include URL allows Stored XSS. This issue affects Include URL: from n/a through 0.3.5.",
    "summary": "This vulnerability in the samsk Include URL allows for Stored Cross-site Scripting, which can potentially be exploited by attackers to inject malicious scripts into a website and steal sensitive information. It affects versions from n/a through 0.3.5. Users should update to the latest version of Include URL to mitigate this security risk.",
    "software": [
      "samsk Include URL"
    ]
  },
  {
    "cve_id": "CVE-2025-30595",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in tstafford include-file allows Stored XSS. This issue affects include-file: from n/a through 1.",
    "summary": "This vulnerability in tstafford include-file allows attackers to inject malicious code into a website, potentially leading to the theft of sensitive information or unauthorized actions on the website. This vulnerability affects versions of include-file from n/a through 1. Users should update to a patched version of include-file to mitigate the risk of exploitation.",
    "software": [
      "tstafford include-file"
    ]
  },
  {
    "cve_id": "CVE-2025-30597",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in iografica IG Shortcodes allows DOM-Based XSS. This issue affects IG Shortcodes: from n/a through 3.1.",
    "summary": "This vulnerability in iografica IG Shortcodes allows attackers to execute malicious scripts on a victim's web browser, leading to potential data theft or account compromise. It affects all versions of IG Shortcodes up to 3.1. Users should update to the latest version of the software to protect against this threat.",
    "software": [
      "iografica IG Shortcodes"
    ]
  },
  {
    "cve_id": "CVE-2025-30598",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Link OSS Upload allows Cross Site Request Forgery. This issue affects OSS Upload: from n/a through 4.8.9.",
    "summary": "A Cross-Site Request Forgery (CSRF) vulnerability in Link OSS Upload allows attackers to perform actions on behalf of users without their consent. This vulnerability affects versions of OSS Upload from n/a through 4.8.9. Users should update to the latest version of OSS Upload to protect against this threat.",
    "software": [
      "Link OSS Upload"
    ]
  },
  {
    "cve_id": "CVE-2025-30599",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in wp-maverick WP Parallax Content Slider allows Stored XSS. This issue affects WP Parallax Content Slider: from n/a through 0.9.8.",
    "summary": "This vulnerability in WP Parallax Content Slider allows attackers to inject malicious code into web pages, potentially compromising users who visit those pages. Users of WP Parallax Content Slider versions from n/a through 0.9.8 could be affected. To protect against this threat, users should update their WP Parallax Content Slider to the latest version and be cautious when visiting unknown websites.",
    "software": [
      "wp-maverick WP Parallax Content Slider"
    ]
  },
  {
    "cve_id": "CVE-2025-30600",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in thiagogsrwp WP Hotjar allows Stored XSS. This issue affects WP Hotjar: from n/a through 0.0.3.",
    "summary": "This vulnerability in the WP Hotjar plugin allows attackers to inject malicious code into websites that use the plugin, potentially leading to unauthorized access or data theft. Users of WP Hotjar versions between n/a and 0.0.3 should update to the latest version to protect against this threat.",
    "software": [
      "WP Hotjar"
    ]
  },
  {
    "cve_id": "CVE-2025-30601",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in flipdish Flipdish Ordering System allows Cross Site Request Forgery. This issue affects Flipdish Ordering System: from n/a through 1.4.16.",
    "summary": "This vulnerability in the Flipdish Ordering System allows attackers to make unauthorized requests on behalf of a user, potentially leading to actions being taken without the user's consent. It affects users of Flipdish Ordering System versions from n/a through 1.4.16. Users should update to the latest version of the software to prevent potential attacks.",
    "software": [
      "flipdish Flipdish Ordering System"
    ]
  },
  {
    "cve_id": "CVE-2025-30602",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in alphasis Related Posts via Categories allows Stored XSS. This issue affects Related Posts via Categories: from n/a through 2.1.2.",
    "summary": "This security vulnerability, known as Cross-site Scripting (XSS), affects the Related Posts via Categories plugin versions up to 2.1.2. It allows attackers to inject malicious code into web pages, potentially compromising the security of users accessing those pages. Users of this plugin should update to the latest version available to patch this vulnerability and stay protected from potential attacks.",
    "software": [
      "alphasis Related Posts via Categories"
    ]
  },
  {
    "cve_id": "CVE-2025-30603",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in DEJAN CopyLink allows Stored XSS. This issue affects CopyLink: from n/a through 1.1.",
    "summary": "A Cross-Site Request Forgery (CSRF) vulnerability in DEJAN CopyLink allows attackers to execute a Stored XSS attack. This vulnerability affects CopyLink versions ranging from n/a through 1.1. Users of CopyLink should update to the latest version to protect against this threat.",
    "software": [
      "DEJAN CopyLink"
    ]
  },
  {
    "cve_id": "CVE-2025-30604",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in jiangqie JiangQie Official Website Mini Program allows Blind SQL Injection. This issue affects JiangQie Official Website Mini Program: from n/a through 1.8.2.",
    "summary": "This vulnerability in the JiangQie Official Website Mini Program allows attackers to execute a type of cyber attack called SQL Injection, which can potentially lead to unauthorized access to databases and sensitive information. It affects versions of the program up to 1.8.2. Users should update their program to the latest version to protect against this threat.",
    "software": [
      "jiangqie JiangQie Official Website Mini Program"
    ]
  },
  {
    "cve_id": "CVE-2025-30605",
    "description": "Missing Authorization vulnerability in ldwin79 sourceplay-navermap allows Exploiting Incorrectly Configured Access Control Security Levels. This issue affects sourceplay-navermap: from n/a through 0.0.2.",
    "summary": "This vulnerability in the ldwin79 sourceplay-navermap software allows attackers to exploit incorrectly configured access control security levels. It affects versions from n/a through 0.0.2 of the software. Users should update to a patched version of the software to prevent unauthorized access to sensitive information.",
    "software": [
      "ldwin79 sourceplay-navermap"
    ]
  },
  {
    "cve_id": "CVE-2025-30606",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Logan Carlile Easy Page Transition allows Stored XSS. This issue affects Easy Page Transition: from n/a through 1.0.1.",
    "summary": "There is a security vulnerability in Logan Carlile Easy Page Transition that allows attackers to inject malicious code into web pages, potentially affecting users who visit these compromised pages. Users of Easy Page Transition versions from n/a through 1.0.1 should update to the latest version to protect against this vulnerability.",
    "software": [
      "Logan Carlile Easy Page Transition"
    ]
  },
  {
    "cve_id": "CVE-2025-30608",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Anthony WordPress SQL Backup allows Stored XSS. This issue affects WordPress SQL Backup: from n/a through 3.5.2.",
    "summary": "This vulnerability in a WordPress plugin allows malicious hackers to perform actions on a website on behalf of a user without their knowledge. It affects users of the WordPress SQL Backup plugin versions from n/a through 3.5.2. Users should update to the latest version of the plugin to prevent malicious attacks.",
    "software": [
      "Anthony WordPress SQL Backup"
    ]
  },
  {
    "cve_id": "CVE-2025-30609",
    "description": "Insertion of Sensitive Information Into Sent Data vulnerability in AppExperts AppExperts – WordPress to Mobile App – WooCommerce to iOs and Android Apps allows Retrieve Embedded Sensitive Data. This issue affects AppExperts – WordPress to Mobile App – WooCommerce to iOs and Android Apps: from n/a through 1.4.3.",
    "summary": "This vulnerability in the AppExperts WordPress to Mobile App plugin allows attackers to retrieve sensitive information that is embedded in the sent data. This affects users of the plugin version from n/a through 1.4.3. Users should update their plugin to the latest version to fix this issue and protect their sensitive data.",
    "software": [
      "AppExperts AppExperts – WordPress to Mobile App – WooCommerce to iOs and Android Apps"
    ]
  },
  {
    "cve_id": "CVE-2025-30610",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in catchsquare WP Social Widget allows Stored XSS. This issue affects WP Social Widget: from n/a through 2.2.6.",
    "summary": "This vulnerability in the catchsquare WP Social Widget allows attackers to inject malicious code into web pages, leading to potential attacks on users who visit the affected website. Users of WP Social Widget version n/a through 2.2.6 are at risk. To protect against this threat, it is recommended to update the plugin to the latest version available.",
    "software": [
      "WP Social Widget"
    ]
  },
  {
    "cve_id": "CVE-2025-30612",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in mandegarweb Replace Default Words allows Stored XSS. This issue affects Replace Default Words: from n/a through 1.3.",
    "summary": "This vulnerability in the mandegarweb Replace Default Words plugin can allow attackers to execute malicious scripts on a website, potentially affecting users who visit the site. Users should update the plugin to version 1.4 or higher to protect against this threat.",
    "software": [
      "mandegarweb Replace Default Words"
    ]
  },
  {
    "cve_id": "CVE-2025-30615",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in Jacob Schwartz WP e-Commerce Style Email allows Code Injection. This issue affects WP e-Commerce Style Email: from n/a through 0.6.2.",
    "summary": "This vulnerability allows attackers to inject code into WP e-Commerce Style Email plugin, potentially compromising the website. It affects users of WP e-Commerce Style Email versions from n/a through 0.6.2. To mitigate the risk, users should update the plugin to the latest version as soon as possible.",
    "software": [
      "WP e-Commerce Style Email"
    ]
  },
  {
    "cve_id": "CVE-2025-30617",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in takien Rewrite allows Cross Site Request Forgery. This issue affects Rewrite: from n/a through 0.2.1.",
    "summary": "This vulnerability in the takien Rewrite software allows attackers to perform Cross-Site Request Forgery (CSRF) attacks. It affects versions of Rewrite from n/a through 0.2.1. To protect against this threat, users should update to the latest version of Rewrite as soon as possible.",
    "software": [
      "takien Rewrite"
    ]
  },
  {
    "cve_id": "CVE-2025-30619",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in SpeakPipe SpeakPipe allows Cross Site Request Forgery. This issue affects SpeakPipe: from n/a through 0.2.",
    "summary": "This vulnerability in SpeakPipe allows attackers to perform unauthorized actions on behalf of a user who is logged into the SpeakPipe platform. This vulnerability affects SpeakPipe versions from n/a through 0.2. Users of SpeakPipe should update to the latest version to protect against this vulnerability and prevent unauthorized actions from being performed on their accounts.",
    "software": [
      "SpeakPipe"
    ]
  },
  {
    "cve_id": "CVE-2025-30620",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in coderscom WP Odoo Form Integrator allows Stored XSS. This issue affects WP Odoo Form Integrator: from n/a through 1.1.0.",
    "summary": "This vulnerability in coderscom WP Odoo Form Integrator allows an attacker to execute malicious actions on behalf of a user by tricking them into clicking a link or visiting a website. It affects versions from n/a through 1.1.0 of WP Odoo Form Integrator. Users should update to the latest version of the software to protect against this threat.",
    "software": [
      "WP Odoo Form Integrator"
    ]
  },
  {
    "cve_id": "CVE-2025-30621",
    "description": "Cross-Site Request Forgery (CSRF) vulnerability in kornelly Translator allows Stored XSS. This issue affects Translator: from n/a through 0.3.",
    "summary": "This vulnerability in kornelly Translator could allow an attacker to perform malicious actions on behalf of a logged-in user. It affects users of Translator versions from n/a through 0.3. Users should update to the latest version of Translator to protect against this threat.",
    "software": [
      "kornelly Translator"
    ]
  },
  {
    "cve_id": "CVE-2025-30623",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Rachel Cherry wA11y – The Web Accessibility Toolbox allows Stored XSS. This issue affects wA11y – The Web Accessibility Toolbox: from n/a through 1.0.3.",
    "summary": "This vulnerability in the Rachel Cherry wA11y tool allows for a type of cyber attack called Cross-Site Scripting, which allows hackers to inject and execute malicious scripts on web pages. This affects users of the wA11y tool versions from n/a through 1.0.3. The recommended action is to update the wA11y tool to the latest version to fix this vulnerability and prevent potential attacks.",
    "software": [
      "wA11y – The Web Accessibility Toolbox"
    ]
  },
  {
    "cve_id": "CVE-2024-55279",
    "description": "Uguu through 1.8.9 allows Cross Site Scripting (XSS) via JavaScript in XML files.",
    "summary": "This vulnerability in Uguu version 1.8.9 and earlier allows attackers to execute Cross Site Scripting (XSS) attacks using JavaScript code within XML files. This can affect anyone using Uguu who interacts with XML files. To mitigate this threat, users should update Uguu to a version that patches this vulnerability and avoid opening XML files from untrusted sources.",
    "software": [
      "Uguu"
    ]
  },
  {
    "cve_id": "CVE-2025-1558",
    "description": "Mattermost Mobile Apps versions <=2.25.0 fail to properly validate GIF images prior to rendering which allows a malicious user to cause the Android application to crash via message containing a maliciously crafted GIF.",
    "summary": "A security vulnerability has been identified in Mattermost Mobile Apps versions <=2.25.0, which can be exploited by a malicious user by sending a specially crafted GIF image in a message to crash the Android application. Users of affected versions of Mattermost Mobile Apps should update to the latest version to protect against this threat.",
    "software": [
      "Mattermost Mobile Apps"
    ]
  },
  {
    "cve_id": "CVE-2025-2326",
    "description": "Rejected reason: ** REJECT ** DO NOT USE THIS CANDIDATE NUMBER. Reason: This candidate was issued in error. Notes: All references and descriptions in this candidate have been removed to prevent accidental usage.",
    "summary": "This CVE was issued in error and should not be used. There is no threat or information related to this candidate. It is recommended to disregard any information associated with this CVE.",
    "software": [
      "Microsoft Windows"
    ]
  },
  {
    "cve_id": "CVE-2021-26091",
    "description": "A use of a cryptographically weak pseudo-random number generator vulnerability in the authenticator of the Identity Based Encryption service of FortiMail 6.4.0 through 6.4.4, and 6.2.0 through 6.2.7 may allow an unauthenticated attacker to infer parts of users authentication tokens and reset their credentials.",
    "summary": "This vulnerability in FortiMail’s Identity Based Encryption service allows attackers to access users’ authentication tokens and reset their credentials. It affects versions 6.2.0 through 6.2.7 and 6.4.0 through 6.4.4. Users should update their software to the latest version to prevent the exploit.",
    "software": [
      "FortiMail"
    ]
  },
  {
    "cve_id": "CVE-2021-26105",
    "description": "A stack-based buffer overflow vulnerability (CWE-121) in the profile parser of FortiSandbox version 3.2.2 and below, version 3.1.4 and below may allow an authenticated attacker to potentially execute unauthorized code or commands via specifically crafted HTTP requests.",
    "summary": "This security vulnerability in FortiSandbox software could allow a hacker who is logged in to the system to run malicious code using specially designed HTTP requests. Users of FortiSandbox version 3.2.2 and below, and version 3.1.4 and below are affected. To protect against this threat, users should update their FortiSandbox software to the latest version available.",
    "software": [
      "FortiSandbox"
    ]
  },
  {
    "cve_id": "CVE-2023-25610",
    "description": "A buffer underwrite ('buffer underflow') vulnerability in the administrative interface of Fortinet FortiOS version 7.2.0 through 7.2.3, version 7.0.0 through 7.0.6, version 6.4.0 through 6.4.11 and version 6.2.12 and below, FortiProxy version 7.2.0 through 7.2.2, version 7.0.0 through 7.0.8, version 2.0.12 and below and FortiOS-6K7K version 7.0.5, version 6.4.0 through 6.4.10 and version 6.2.0 through 6.2.10 and below allows a remote unauthenticated attacker to execute arbitrary code or commands via specifically crafted requests.",
    "summary": "This CVE is a security vulnerability in various versions of Fortinet FortiOS, FortiProxy, and FortiOS-6K7K that could allow a remote attacker to execute arbitrary code or commands through the administrative interface. It affects users of these specific versions of these products. To mitigate this threat, users should update to the latest versions of these products as soon as possible.",
    "software": [
      "Fortinet FortiOS",
      "FortiProxy",
      "FortiOS-6K7K"
    ]
  },
  {
    "cve_id": "CVE-2024-9103",
    "description": "Improper Neutralization of Script in Attributes in a Web Page vulnerability in Forcepoint Email Security (Blocked Messages module) allows Stored XSS.\nThis issue affects Email Security through 8.5.5.",
    "summary": "This vulnerability in Forcepoint Email Security allows hackers to execute harmful scripts in web pages, known as Stored XSS. This puts individuals and organizations using Email Security versions up to 8.5.5 at risk of potential cyber attacks. To protect against this threat, it is recommended to update Forcepoint Email Security to the latest version available.",
    "software": [
      "Forcepoint Email Security"
    ]
  },
  {
    "cve_id": "CVE-2025-0256",
    "description": "HCL DevOps Deploy / HCL Launch could allow an authenticated user to obtain sensitive information about other users on the system due to missing authorization for a function.",
    "summary": "This vulnerability in HCL DevOps Deploy / HCL Launch could allow a logged-in user to access sensitive information about other users on the system. This could potentially affect anyone using these products. To mitigate this threat, users should ensure they have the latest updates installed and monitor their systems for any unauthorized access or suspicious activity.",
    "software": [
      "HCL DevOps Deploy",
      "HCL Launch"
    ]
  },
  {
    "cve_id": "CVE-2025-23204",
    "description": "API Platform Core is a system to create hypermedia-driven REST and GraphQL APIs. Starting in version 3.3.8, a security check that gets called after GraphQl resolvers is always replaced by another one as there's no break in a clause. As this falls back to `security`, the impact is there only when there's only a security after resolver and none inside security. Version 3.3.15 contains a patch for the issue.",
    "summary": "A security vulnerability has been identified in API Platform Core version 3.3.8 and older, which could potentially allow attackers to bypass security checks in GraphQL APIs. This vulnerability may affect users who have implemented GraphQL resolvers without proper security measures. Users are advised to update to version 3.3.15 or newer to patch this issue.",
    "software": [
      "API Platform Core"
    ]
  },
  {
    "cve_id": "CVE-2025-29294",
    "description": "Rejected reason: DO NOT USE THIS CVE RECORD. ConsultIDs: none. Reason: This record was withdrawn by its CNA. Further investigation showed that it was not a security issue. Notes: none.",
    "summary": "This CVE record has been rejected because further investigation showed that it was not a security issue. Therefore, there is no threat to worry about, and no action needs to be taken.",
    "software": []
  },
  {
    "cve_id": "CVE-2025-2705",
    "description": "A vulnerability classified as critical has been found in Digiwin ERP 5.1. Affected is the function DoUpload/DoWebUpload of the file /Api/FileUploadApi.ashx. The manipulation of the argument File leads to unrestricted upload. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A critical vulnerability has been discovered in Digiwin ERP 5.1, which allows for unrestricted file uploads through the DoUpload/DoWebUpload function. This vulnerability can be exploited remotely and has been made public, increasing the risk of attacks. Users of Digiwin ERP should take immediate action to secure their systems, as the vendor has not responded to the disclosure.",
    "software": [
      "Digiwin ERP 5.1"
    ]
  },
  {
    "cve_id": "CVE-2025-0255",
    "description": "HCL DevOps Deploy / HCL Launch could allow a remote privileged authenticated attacker to execute arbitrary commands on the system by sending specially crafted input containing special elements.",
    "summary": "A vulnerability has been found in HCL DevOps Deploy / HCL Launch that could allow a remote attacker with privileged access to execute arbitrary commands on the system by sending specially crafted input. This flaw could affect organizations using these software products for their DevOps processes. To mitigate this threat, it is recommended to update the software to the latest version or apply patches provided by the vendor.",
    "software": [
      "HCL DevOps Deploy",
      "HCL Launch"
    ]
  },
  {
    "cve_id": "CVE-2025-29778",
    "description": "Kyverno is a policy engine designed for cloud native platform engineering teams. Prior to version 1.14.0-alpha.1, Kyverno ignores subjectRegExp and IssuerRegExp while verifying artifact's sign with keyless mode. It allows the attacker to deploy kubernetes resources with the artifacts that were signed by unexpected certificate. Deploying these unauthorized kubernetes resources can lead to full compromise of kubernetes cluster. Version 1.14.0-alpha.1 contains a patch for the issue.",
    "summary": "A security vulnerability has been identified in the Kyverno policy engine prior to version 1.14.0-alpha.1. This vulnerability allows attackers to deploy unauthorized Kubernetes resources in a cluster, potentially leading to a full compromise. Users should update to version 1.14.0-alpha.1 or later to patch this issue and prevent unauthorized access to their Kubernetes clusters.",
    "software": [
      "Kyverno"
    ]
  },
  {
    "cve_id": "CVE-2025-30112",
    "description": "On 70mai Dash Cam 1S devices, by connecting directly to the dashcam's network and accessing the API on port 80 and RTSP on port 554, an attacker can bypass the device authorization mechanism from the official mobile app that requires a user to physically press on the power button during a connection.",
    "summary": "The CVE on 70mai Dash Cam 1S devices allows attackers to bypass the device authorization mechanism by connecting to the dashcam's network and accessing certain ports. This could potentially affect users of these devices. To mitigate the risk, users should update the device firmware to the latest version and avoid connecting to untrusted networks.",
    "software": [
      "70mai Dash Cam 1S"
    ]
  },
  {
    "cve_id": "CVE-2025-30205",
    "description": "kanidim-provision is a helper utility that uses kanidm's API to provision users, groups and oauth2 systems. Prior to version 1.2.0, a faulty function intrumentation in the (optional) kanidm patches provided by kandim-provision will cause the provisioned admin credentials to be leaked to the system log. This only impacts users which both use the provided patches and provision their `admin` or `idm_admin` account credentials this way. No other credentials are affected. Users should recompile kanidm with the newest patchset from tag `v1.2.0` or higher. As a workaround, the user can set the log level `KANIDM_LOG_LEVEL` to any level higher than `info`, for example `warn`.",
    "summary": "A vulnerability in kanidim-provision allows admin credentials to be leaked to the system log. This could affect users who use the provided patches and provision their `admin` or `idm_admin` account credentials this way. Users should update kanidm to version 1.2.0 or higher, or set the log level to a higher level as a temporary fix.",
    "software": [
      "kanidm",
      "kanidim-provision"
    ]
  },
  {
    "cve_id": "CVE-2025-30208",
    "description": "Vite, a provider of frontend development tooling, has a vulnerability in versions prior to 6.2.3, 6.1.2, 6.0.12, 5.4.15, and 4.5.10. `@fs` denies access to files outside of Vite serving allow list. Adding `?raw??` or `?import&raw??` to the URL bypasses this limitation and returns the file content if it exists. This bypass exists because trailing separators such as `?` are removed in several places, but are not accounted for in query string regexes. The contents of arbitrary files can be returned to the browser. Only apps explicitly exposing the Vite dev server to the network (using `--host` or `server.host` config option) are affected. Versions 6.2.3, 6.1.2, 6.0.12, 5.4.15, and 4.5.10 fix the issue.",
    "summary": "The vulnerability in Vite versions prior to 6.2.3, 6.1.2, 6.0.12, 5.4.15, and 4.5.10 allows for unauthorized access to files outside of the Vite serving allow list by adding specific query strings to the URL. This can result in the contents of arbitrary files being displayed in the browser. Only apps that expose the Vite dev server to the network are affected. Users should update to versions 6.2.3, 6.1.2, 6.0.12, 5.4.15, or 4.5.10 to address this vulnerability.",
    "software": [
      "Vite",
      "@fs"
    ]
  },
  {
    "cve_id": "CVE-2025-22223",
    "description": "Spring Security 6.4.0 - 6.4.3 may not correctly locate method security annotations on parameterized types or methods. This may cause an authorization bypass. \n\nYou are not affected if you are not using @EnableMethodSecurity, or\nyou do not have method security annotations on parameterized types or methods, or all method security annotations are attached to target methods",
    "summary": "The vulnerability in Spring Security versions 6.4.0 - 6.4.3 could allow an attacker to bypass authorization if method security annotations are not located correctly on certain types of methods. Users who do not use @EnableMethodSecurity or do not have specific method security annotations are not affected. It is recommended to ensure that all method security annotations are correctly applied to target methods to mitigate the risk of an authorization bypass.",
    "software": [
      "Spring Security"
    ]
  },
  {
    "cve_id": "CVE-2025-2706",
    "description": "A vulnerability classified as critical was found in Digiwin ERP 5.0.1. Affected by this vulnerability is an unknown functionality of the file /Api/TinyMce/UploadAjaxAPI.ashx. The manipulation of the argument File leads to unrestricted upload. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The vulnerability in Digiwin ERP 5.0.1 allows for unrestricted remote file upload, which can be exploited by attackers. Anyone using this software is potentially at risk. To protect against this threat, users should apply any patches or updates provided by the vendor, or consider discontinuing use of the affected software. Additionally, caution should be exercised when opening files or links from unknown or suspicious sources.",
    "software": [
      "Digiwin ERP 5.0.1",
      "/Api/TinyMce/UploadAjaxAPI.ashx"
    ]
  },
  {
    "cve_id": "CVE-2025-2707",
    "description": "A vulnerability, which was classified as critical, has been found in zhijiantianya ruoyi-vue-pro 2.4.1. Affected by this issue is some unknown functionality of the file /app-api/infra/file/upload of the component Front-End Store Interface. The manipulation of the argument path leads to path traversal. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This critical vulnerability in the zhijiantianya ruoyi-vue-pro 2.4.1 software allows remote attackers to perform a path traversal attack through the /app-api/infra/file/upload file of the Front-End Store Interface component. This could potentially affect any users of this software. To mitigate this threat, users should apply the patch provided by the vendor once it is made available, as the exploit has already been disclosed publicly.",
    "software": [
      "zhijiantianya ruoyi-vue-pro 2.4.1",
      "Front-End Store Interface"
    ]
  },
  {
    "cve_id": "CVE-2025-2746",
    "description": "An authentication bypass vulnerability in Kentico Xperience allows authentication bypass via the Staging Sync Server password handling of empty SHA1 usernames in digest authentication. Authentication bypass allows an attacker to control administrative objects.This issue affects Xperience through 13.0.172.",
    "summary": "A security flaw in Kentico Xperience allows attackers to bypass authentication and gain control of administrative objects. This vulnerability affects versions of Xperience up to 13.0.172. To protect against this threat, users should update to the latest version of Kentico Xperience and regularly monitor for security updates.",
    "software": [
      "Kentico Xperience"
    ]
  },
  {
    "cve_id": "CVE-2025-2747",
    "description": "An authentication bypass vulnerability in Kentico Xperience allows authentication bypass via the Staging Sync Server component password handling for the server defined None type. Authentication bypass allows an attacker to control administrative objects.This issue affects Xperience through 13.0.178.",
    "summary": "The CVE is a vulnerability in Kentico Xperience that allows an attacker to bypass authentication and gain control over administrative objects by exploiting the Staging Sync Server component password handling. This vulnerability impacts Xperience versions up to 13.0.178. To protect against this threat, users should update their Xperience software to the latest version available.",
    "software": [
      "Kentico Xperience"
    ]
  },
  {
    "cve_id": "CVE-2025-2748",
    "description": "The Kentico Xperience application does not fully validate or filter files uploaded via the multiple-file upload functionality, which allows for stored XSS.This issue affects Kentico Xperience through 13.0.178.",
    "summary": "This vulnerability in Kentico Xperience allows hackers to upload malicious files that can exploit the application and perform a stored cross-site scripting attack. Users of Kentico Xperience up to version 13.0.178 are affected. To protect against this threat, users should update to the latest version of Kentico Xperience and avoid uploading any suspicious files.",
    "software": [
      "Kentico Xperience"
    ]
  },
  {
    "cve_id": "CVE-2025-2749",
    "description": "An authenticated remote code execution in Kentico Xperience allows authenticated users Staging Sync Server to upload arbitrary data to path relative locations. This results in path traversal and arbitrary file upload, including content that can be executed server side leading to remote code execution.This issue affects Kentico Xperience through 13.0.178.",
    "summary": "This vulnerability in Kentico Xperience allows authenticated users to upload malicious files to the server, potentially leading to remote code execution. Users of Kentico Xperience up to version 13.0.178 are affected. To mitigate this threat, it is recommended to update Kentico Xperience to the latest version and monitor for any unauthorized file uploads.",
    "software": [
      "Kentico Xperience"
    ]
  },
  {
    "cve_id": "CVE-2025-30162",
    "description": "Cilium is a networking, observability, and security solution with an eBPF-based dataplane. For Cilium users who use Gateway API for Ingress for some services and use LB-IPAM or BGP for LB Service implementation and use network policies to block egress traffic from workloads in a namespace to workloads in other namespaces, egress traffic from workloads covered by such network policies to LoadBalancers configured by `Gateway` resources will incorrectly be allowed. LoadBalancer resources not deployed via a Gateway API configuration are not affected by this issue. This issue affects: Cilium v1.15 between v1.15.0 and v1.15.14 inclusive, v1.16 between v1.16.0 and v1.16.7 inclusive, and v1.17 between v1.17.0 and v1.17.1 inclusive. This issue is fixed in Cilium v1.15.15, v1.16.8, and v1.17.2. A Clusterwide Cilium Network Policy can be used to work around this issue for users who are unable to upgrade.",
    "summary": "A vulnerability has been identified in Cilium, a networking, observability, and security solution. This issue affects users who utilize Gateway API for Ingress, LB-IPAM or BGP for LB Service implementation, and network policies to block egress traffic from workloads in one namespace to another. Egress traffic from workloads covered by these network policies to LoadBalancers configured by Gateway resources will be incorrectly allowed. Users of Cilium versions 1.15 to 1.17 are affected, with the issue being fixed in versions 1.15.15, 1.16.8, and 1.17.2. A Clusterwide Cilium Network Policy can be used as a workaround for those who are unable to upgrade. Users should update to the fixed versions or apply the workaround to mitigate the risk.",
    "software": [
      "Cilium"
    ]
  },
  {
    "cve_id": "CVE-2025-30163",
    "description": "Cilium is a networking, observability, and security solution with an eBPF-based dataplane. Node based network policies (`fromNodes` and `toNodes`) will incorrectly permit traffic to/from non-node endpoints that share the labels specified in `fromNodes` and `toNodes` sections of network policies. Node based network policy is disabled by default in Cilium. This issue affects: Cilium v1.16 between v1.16.0 and v1.16.7 inclusive and v1.17 between v1.17.0 and v1.17.1 inclusive. This issue is fixed in Cilium v1.16.8 and v1.17.2. Users can work around this issue by ensuring that the labels used in `fromNodes` and `toNodes` fields are used exclusively by nodes and not by other endpoints.",
    "summary": "There is a vulnerability in Cilium, a networking, observability, and security solution, where node-based network policies may permit traffic to non-node endpoints that share the same labels. This affects Cilium versions v1.16.0 to v1.16.7 and v1.17.0 to v1.17.1. Users should upgrade to Cilium v1.16.8 or v1.17.2 to fix the issue. Until then, ensure that labels used in network policies are exclusive to nodes.",
    "software": []
  },
  {
    "cve_id": "CVE-2025-2231",
    "description": "PDF-XChange Editor RTF File Parsing Out-Of-Bounds Read Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file.\n\nThe specific flaw exists within the parsing of RTF files. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-25473.",
    "summary": "This CVE is a vulnerability in the PDF-XChange Editor software that allows remote attackers to execute harmful code on a user's computer by tricking them into opening a malicious file or visiting a malicious website. The flaw occurs in the parsing of RTF files, potentially leading to an out-of-bounds read issue. Users of PDF-XChange Editor should update their software to the latest version to protect against this vulnerability.",
    "software": [
      "PDF-XChange Editor"
    ]
  },
  {
    "cve_id": "CVE-2025-2708",
    "description": "A vulnerability, which was classified as critical, was found in zhijiantianya ruoyi-vue-pro 2.4.1. This affects an unknown part of the file /admin-api/infra/file/upload of the component Backend File Upload Interface. The manipulation of the argument path leads to path traversal. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in the zhijiantianya ruoyi-vue-pro 2.4.1 component allows remote attackers to manipulate file paths and potentially access sensitive information on a system. It is considered critical and affects users of the component's Backend File Upload Interface. To mitigate the risk, users should update to a secure version of the component if available, or implement additional security measures to protect against potential attacks targeting this vulnerability.",
    "software": [
      "zhijiantianya ruoyi-vue-pro"
    ]
  },
  {
    "cve_id": "CVE-2025-2709",
    "description": "A vulnerability has been found in Yonyou UFIDA ERP-NC 5.0 and classified as problematic. This vulnerability affects unknown code of the file /login.jsp. The manipulation of the argument key/redirect leads to cross site scripting. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The Yonyou UFIDA ERP-NC 5.0 software has a vulnerability that allows for cross-site scripting attacks through the /login.jsp file. This means that an attacker can remotely manipulate certain code to potentially steal data or take control of the system. The exploit has been made public and the vendor has not responded to the issue. Users of this software should be cautious and take necessary security measures to protect their systems.",
    "software": [
      "Yonyou UFIDA ERP-NC 5.0"
    ]
  },
  {
    "cve_id": "CVE-2025-29100",
    "description": "Tenda AC8 V16.03.34.06 is vulnerable to Buffer Overflow in the fromSetRouteStatic function via the parameter list.",
    "summary": "A vulnerability has been found in the Tenda AC8 router (version 16.03.34.06) that allows attackers to execute a Buffer Overflow attack through the fromSetRouteStatic function by exploiting the parameter list. This vulnerability can potentially affect any users of this particular router model. To protect against this threat, users should update their router to the latest firmware version provided by the manufacturer.",
    "software": [
      "Tenda AC8 V16.03.34.06"
    ]
  },
  {
    "cve_id": "CVE-2025-29135",
    "description": "A stack-based buffer overflow vulnerability in Tenda AC7 V15.03.06.44 allows a remote attacker to execute arbitrary code through a stack overflow attack using the security parameter of the formWifiBasicSet function.",
    "summary": "This CVE involves a security flaw in the Tenda AC7 V15.03.06.44 router that could be exploited by a hacker to run unauthorized code on the device. This vulnerability affects users of this specific router model. To protect against potential attacks, users should update the firmware of their Tenda AC7 router to a secure version.",
    "software": [
      "Tenda AC7 V15.03.06.44",
      "formWifiBasicSet function"
    ]
  },
  {
    "cve_id": "CVE-2025-29310",
    "description": "An issue in onos v2.7.0 allows attackers to trigger a packet deserialization problem when supplying a crafted LLDP packet. This vulnerability allows attackers to execute arbitrary commands or access network information.",
    "summary": "This vulnerability in onos v2.7.0 allows attackers to send a specially crafted LLDP packet to trigger a problem with packet deserialization. This can lead to attackers being able to run unauthorized commands or access network information. Users of onos v2.7.0 are affected by this threat and should apply the latest security patches or updates to prevent exploitation of this vulnerability.",
    "software": [
      "onos v2.7.0",
      "LLDP packet"
    ]
  },
  {
    "cve_id": "CVE-2025-29311",
    "description": "Limited secret space in LLDP packets used in onos v2.7.0 allows attackers to obtain the private key via a bruteforce attack. Attackers are able to leverage this vulnerability into creating crafted LLDP packets.",
    "summary": "In onos v2.7.0, there is a vulnerability that allows attackers to obtain the private key through a brute force attack by using limited secret space in LLDP packets. This can be used to create malicious LLDP packets. Users of onos v2.7.0 should take action to patch or update their systems to fix this vulnerability and prevent potential attacks.",
    "software": [
      "onos v2.7.0"
    ]
  },
  {
    "cve_id": "CVE-2025-29312",
    "description": "An issue in onos v2.7.0 allows attackers to trigger unexpected behavior within a device connected to a legacy switch via changing the link type from indirect to direct.",
    "summary": "A vulnerability in onos v2.7.0 allows attackers to cause unexpected behavior in a device connected to a legacy switch by changing the link type. This issue poses a threat to users of onos v2.7.0. To mitigate this threat, users should update to the latest version of onos and ensure proper security measures are in place.",
    "software": [
      "onos v2.7.0"
    ]
  },
  {
    "cve_id": "CVE-2025-29313",
    "description": "Use of incorrectly resolved name or reference in OpenDaylight Service Function Chaining (SFC) Subproject SFC Sodium-SR4 and below allows attackers to cause a Denial of Service (DoS).",
    "summary": "This vulnerability in OpenDaylight Service Function Chaining (SFC) Sodium-SR4 and older versions allows attackers to cause a Denial of Service (DoS) by using incorrectly resolved names or references. This can affect users of OpenDaylight SFC, potentially disrupting their services. Users should update to a newer version of OpenDaylight to patch this vulnerability and protect against potential attacks.",
    "software": [
      "OpenDaylight Service Function Chaining (SFC) Subproject SFC Sodium-SR4"
    ]
  },
  {
    "cve_id": "CVE-2025-29314",
    "description": "Insecure Shiro cookie configurations in OpenDaylight Service Function Chaining (SFC) Subproject SFC Sodium-SR4 and below allow attackers to access sensitive information via a man-in-the-middle attack.",
    "summary": "The CVE is about a security vulnerability in the OpenDaylight Service Function Chaining (SFC) subproject SFC Sodium-SR4 and below, which could allow attackers to access sensitive information through a man-in-the-middle attack. This threat affects users of this software version. To protect against this vulnerability, users should update to a secure version of the software and ensure proper cookie configurations in the Shiro security framework.",
    "software": [
      "OpenDaylight Service Function Chaining (SFC) Subproject SFC Sodium-SR4"
    ]
  },
  {
    "cve_id": "CVE-2025-29315",
    "description": "An issue in the Shiro-based RBAC (Role-based Access Control) mechanism of OpenDaylight Service Function Chaining (SFC) Subproject SFC Sodium-SR4 and below allows attackers to execute privileged operations via a crafted request.",
    "summary": "A vulnerability in the OpenDaylight Service Function Chaining software allows attackers to perform privileged operations by sending a specially crafted request. This could impact users of the SFC Sodium-SR4 and earlier versions. To mitigate the risk, users are advised to install the latest updates and patches for the software.",
    "software": [
      "OpenDaylight Service Function Chaining (SFC) Subproject SFC Sodium-SR4"
    ]
  },
  {
    "cve_id": "CVE-2025-2710",
    "description": "A vulnerability was found in Yonyou UFIDA ERP-NC 5.0 and classified as problematic. This issue affects some unknown processing of the file /menu.jsp. The manipulation of the argument flag leads to cross site scripting. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in Yonyou UFIDA ERP-NC 5.0 allows attackers to execute cross site scripting attacks by manipulating a specific file. This issue can be exploited remotely, and the vendor has not addressed it. Users of this software should be cautious and consider taking action to mitigate the risk of exploitation, such as implementing security best practices and monitoring for any signs of compromise.",
    "software": [
      "Yonyou UFIDA ERP-NC 5.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2711",
    "description": "A vulnerability was found in Yonyou UFIDA ERP-NC 5.0. It has been classified as problematic. Affected is an unknown function of the file /help/systop.jsp. The manipulation of the argument langcode leads to cross site scripting. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A vulnerability in Yonyou UFIDA ERP-NC 5.0 allows for cross-site scripting attacks by manipulating the langcode argument in the /help/systop.jsp file. This can be exploited remotely and the vulnerability has been made public. Users of this software should be aware of the issue and take appropriate precautions to protect their system. The vendor has been informed but has not responded to the disclosure.",
    "software": [
      "Yonyou UFIDA ERP-NC 5.0"
    ]
  },
  {
    "cve_id": "CVE-2025-26512",
    "description": "SnapCenter versions prior to \n6.0.1P1 and 6.1P1 are susceptible to a vulnerability which may allow an \nauthenticated SnapCenter Server user to become an admin user on a remote\n system where a SnapCenter plug-in has been installed.",
    "summary": "The vulnerability in SnapCenter allows an authenticated user to gain admin access on a remote system with a SnapCenter plug-in installed. This affects users of SnapCenter versions prior to 6.0.1P1 and 6.1P1. To protect against this threat, users should update to the latest version of SnapCenter.",
    "software": [
      "SnapCenter"
    ]
  },
  {
    "cve_id": "CVE-2025-2712",
    "description": "A vulnerability was found in Yonyou UFIDA ERP-NC 5.0. It has been declared as problematic. Affected by this vulnerability is an unknown functionality of the file /help/top.jsp. The manipulation of the argument langcode leads to cross site scripting. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This CVE (Common Vulnerabilities and Exposures) is a software vulnerability found in Yonyou UFIDA ERP-NC 5.0, which can be exploited by hackers to launch remote cross-site scripting attacks. This vulnerability affects users of this software and could potentially be used to compromise sensitive information. Users should take action by updating their software or implementing additional security measures to protect against this threat.",
    "software": [
      "Yonyou UFIDA ERP-NC 5.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2714",
    "description": "A vulnerability was found in JoomlaUX JUX Real Estate 3.4.0. It has been rated as problematic. Affected by this issue is some unknown functionality of the file /extensions/realestate/index.php/agents/agent-register/addagent. The manipulation of the argument plan_id leads to cross site scripting. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The vulnerability in JoomlaUX JUX Real Estate 3.4.0 allows for a cross-site scripting attack through manipulation of a specific file. This could potentially affect anyone using this software. It is recommended to update the software to a secure version as soon as possible to prevent any potential attacks. The vendor was notified about the issue but did not respond.",
    "software": [
      "JoomlaUX JUX Real Estate 3.4.0"
    ]
  },
  {
    "cve_id": "CVE-2025-2715",
    "description": "A vulnerability classified as problematic has been found in timschofield webERP up to 5.0.0.rc+13. This affects an unknown part of the file ConfirmDispatch_Invoice.php of the component Confirm Dispatch and Invoice Page. The manipulation of the argument Narrative leads to cross site scripting. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. It is recommended to apply a patch to fix this issue. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in timschofield webERP up to version 5.0.0.rc+13 allows for remote attackers to conduct cross-site scripting attacks through the manipulation of a specific file. This can affect those using the Confirm Dispatch and Invoice Page component. To mitigate this threat, users should apply the patch provided to fix the issue. It is important to note that the vendor was notified about this problem but did not respond to address it.",
    "software": [
      "timschofield webERP"
    ]
  },
  {
    "cve_id": "CVE-2025-2716",
    "description": "A vulnerability classified as problematic was found in China Mobile P22g-CIac 1.0.00.488. This vulnerability affects unknown code of the component Samba Path Handler. The manipulation leads to path traversal. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This CVE involves a security flaw in the China Mobile P22g-CIac 1.0.00.488 device, specifically in the Samba Path Handler component. This vulnerability could allow attackers to remotely manipulate paths and potentially access sensitive information. The exploit has been made public and could be used by malicious actors. It is recommended to take protective measures, such as implementing security patches or updates, to mitigate this threat.",
    "software": [
      "China Mobile P22g-CIac",
      "Samba Path Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-1097",
    "description": "A security issue was discovered in  ingress-nginx https://github.com/kubernetes/ingress-nginx  where the `auth-tls-match-cn` Ingress annotation can be used to inject configuration into nginx. This can lead to arbitrary code execution in the context of the ingress-nginx controller, and disclosure of Secrets accessible to the controller. (Note that in the default installation, the controller can access all Secrets cluster-wide.)",
    "summary": "The security issue found in ingress-nginx allows attackers to inject configuration into nginx using the `auth-tls-match-cn` Ingress annotation, which could result in arbitrary code execution and the disclosure of Secrets accessible to the controller. This affects users of the Kubernetes ingress-nginx controller. To mitigate this threat, users should update their ingress-nginx controller to the latest version.",
    "software": [
      "ingress-nginx"
    ]
  },
  {
    "cve_id": "CVE-2025-1098",
    "description": "A security issue was discovered in  ingress-nginx https://github.com/kubernetes/ingress-nginx  where the `mirror-target` and `mirror-host` Ingress annotations can be used to inject arbitrary configuration into nginx. This can lead to arbitrary code execution in the context of the ingress-nginx controller, and disclosure of Secrets accessible to the controller. (Note that in the default installation, the controller can access all Secrets cluster-wide.)",
    "summary": "This security issue in ingress-nginx allows hackers to inject unauthorized configuration into nginx, potentially leading to running malicious code and disclosing sensitive information in the context of the controller. Users of ingress-nginx are vulnerable to this threat, especially if the default installation settings are used. To mitigate the risk, it is recommended to update the ingress-nginx software to the latest version that addresses this vulnerability.",
    "software": [
      "ingress-nginx"
    ]
  },
  {
    "cve_id": "CVE-2025-1974",
    "description": "A security issue was discovered in Kubernetes where under certain conditions, an unauthenticated attacker with access to the pod network can achieve arbitrary code execution in the context of the ingress-nginx controller. This can lead to disclosure of Secrets accessible to the controller. (Note that in the default installation, the controller can access all Secrets cluster-wide.)",
    "summary": "This security vulnerability in Kubernetes allows attackers to execute code and potentially access sensitive information. It affects users who have not properly secured their Kubernetes installations. To protect against this threat, users should ensure that their Kubernetes configurations are properly secured, and consider restricting access to Secrets for the controller.",
    "software": [
      "Kubernetes",
      "ingress-nginx controller"
    ]
  },
  {
    "cve_id": "CVE-2025-24513",
    "description": "A security issue was discovered in  ingress-nginx https://github.com/kubernetes/ingress-nginx  where attacker-provided data are included in a filename by the ingress-nginx Admission Controller feature, resulting in directory traversal within the container. This could result in denial of service, or when combined with other vulnerabilities, limited disclosure of Secret objects from the cluster.",
    "summary": "The security issue in ingress-nginx allows attackers to access files in a container by manipulating filenames, potentially causing denial of service or exposing sensitive information. Users of ingress-nginx should update to the latest version to patch this vulnerability.",
    "software": [
      "ingress-nginx Admission Controller feature"
    ]
  },
  {
    "cve_id": "CVE-2025-24514",
    "description": "A security issue was discovered in  ingress-nginx https://github.com/kubernetes/ingress-nginx  where the `auth-url` Ingress annotation can be used to inject configuration into nginx. This can lead to arbitrary code execution in the context of the ingress-nginx controller, and disclosure of Secrets accessible to the controller. (Note that in the default installation, the controller can access all Secrets cluster-wide.)",
    "summary": "This security issue in the ingress-nginx software allows attackers to inject code into the controller, potentially leading to arbitrary code execution and disclosure of sensitive information like Secrets. This affects users of ingress-nginx and action should be taken to update the software to the latest version to patch this vulnerability and prevent potential attacks.",
    "software": [
      "ingress-nginx"
    ]
  },
  {
    "cve_id": "CVE-2025-2717",
    "description": "A vulnerability, which was classified as critical, has been found in D-Link DIR-823X 240126/240802. This issue affects the function sub_41710C of the file /goform/diag_nslookup of the component HTTP POST Request Handler. The manipulation of the argument target_addr leads to os command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The D-Link DIR-823X 240126/240802 device has a critical vulnerability that allows remote attackers to execute malicious commands on the system. Users of this device should be aware of the threat and update their firmware as soon as possible to protect against potential attacks.",
    "software": [
      "D-Link DIR-823X"
    ]
  },
  {
    "cve_id": "CVE-2025-2720",
    "description": "A vulnerability was found in GNOME libgsf up to 1.14.53 and classified as problematic. Affected by this issue is the function gsf_base64_encode_simple. The manipulation of the argument size leads to use of uninitialized variable. The attack needs to be approached locally. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in GNOME libgsf up to version 1.14.53 allows attackers to manipulate a function argument, leading to the use of uninitialized variables. This can be exploited locally. Users of GNOME libgsf should update to a fixed version. The vendor was notified but did not respond.",
    "software": [
      "GNOME libgsf"
    ]
  },
  {
    "cve_id": "CVE-2025-2721",
    "description": "A vulnerability was found in GNOME libgsf up to 1.14.53. It has been classified as critical. This affects the function gsf_base64_encode_simple. The manipulation of the argument size_t leads to heap-based buffer overflow. An attack has to be approached locally. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A critical vulnerability was discovered in GNOME libgsf up to version 1.14.53, which allows for a heap-based buffer overflow. This vulnerability affects anyone using this library and could be exploited by a local attacker. Users should update to the latest version of GNOME libgsf to protect against potential attacks. The vendor has been made aware of the issue but has not responded.",
    "software": [
      "GNOME libgsf"
    ]
  },
  {
    "cve_id": "CVE-2025-2722",
    "description": "A vulnerability was found in GNOME libgsf up to 1.14.53. It has been declared as critical. This vulnerability affects the function gsf_prop_settings_collect_va. The manipulation of the argument n_alloced_params leads to heap-based buffer overflow. Local access is required to approach this attack. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in GNOME libgsf up to version 1.14.53 can be exploited by attackers with local access to cause a heap-based buffer overflow, leading to potential security issues. Users should update to the latest version of the software to protect against this threat. The vendor has not responded to the disclosure of this vulnerability.",
    "software": [
      "GNOME libgsf"
    ]
  },
  {
    "cve_id": "CVE-2025-2723",
    "description": "A vulnerability was found in GNOME libgsf up to 1.14.53. It has been rated as critical. This issue affects the function gsf_property_settings_collec. The manipulation of the argument n_alloced_params leads to heap-based buffer overflow. Attacking locally is a requirement. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The CVE is a critical vulnerability found in GNOME libgsf up to version 1.14.53. The threat is a heap-based buffer overflow that can be exploited by manipulating a certain function. It only affects users who have local access to the system. The vendor has been notified but has not responded. Users should be cautious and monitor for any potential exploitation of this vulnerability.",
    "software": [
      "GNOME libgsf"
    ]
  },
  {
    "cve_id": "CVE-2025-2724",
    "description": "A vulnerability classified as problematic has been found in GNOME libgsf up to 1.14.53. Affected is the function sorting_key_copy. The manipulation of the argument Name leads to out-of-bounds read. It is possible to launch the attack on the local host. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A security flaw has been found in GNOME libgsf up to version 1.14.53, which could allow an attacker to carry out an out-of-bounds read attack by manipulating the argument Name in the function sorting_key_copy. This vulnerability can be exploited on the local host. The vendor has been notified but has not responded. Users should update to a patched version of GNOME libgsf as soon as possible to protect against this threat.",
    "software": [
      "GNOME libgsf"
    ]
  },
  {
    "cve_id": "CVE-2025-2725",
    "description": "A vulnerability classified as critical was found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. Affected by this vulnerability is an unknown functionality of the file /api/login/auth of the component HTTP POST Request Handler. The manipulation leads to command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This critical vulnerability affects several H3C products, allowing attackers to remotely execute commands by manipulating a specific file. It is important for users of these products to take immediate action by updating to a secure version to protect against potential attacks. The vendor has been informed but has not responded to address the issue.",
    "software": [
      "H3C Magic NX15",
      "Magic NX30 Pro",
      "Magic NX400",
      "Magic R3010",
      "Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2025-2726",
    "description": "A vulnerability, which was classified as critical, has been found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. Affected by this issue is some unknown functionality of the file /api/esps of the component HTTP POST Request Handler. The manipulation leads to command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This critical vulnerability affects several H3C devices, allowing for remote attackers to execute commands on the system. Users of H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010, and Magic BE18000 up to V100R014 should take immediate action to patch their systems. The vendor has been informed but has not responded, so users should take steps to protect their devices themselves.",
    "software": [
      "H3C Magic NX15",
      "Magic NX30 Pro",
      "Magic NX400",
      "Magic R3010",
      "Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2025-2727",
    "description": "A vulnerability, which was classified as critical, was found in H3C Magic NX30 Pro up to V100R007. This affects an unknown part of the file /api/wizard/getNetworkStatus of the component HTTP POST Request Handler. The manipulation leads to command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The H3C Magic NX30 Pro device is affected by a critical vulnerability that allows remote attackers to execute commands on the system through a manipulation of a specific file. This could lead to serious security breaches. The vendor has been informed about the issue but has not responded. Users of this device should be aware of the vulnerability and take appropriate precautions, such as restricting access to the affected component or applying any available patches or updates to mitigate the risk of exploitation.",
    "software": [
      "H3C Magic NX30 Pro"
    ]
  },
  {
    "cve_id": "CVE-2025-2728",
    "description": "A vulnerability has been found in H3C Magic NX30 Pro and Magic NX400 up to V100R014 and classified as critical. This vulnerability affects unknown code of the file /api/wizard/getNetworkConf. The manipulation leads to command injection. The attack can be initiated remotely. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This CVE is a critical vulnerability found in H3C Magic NX30 Pro and Magic NX400 devices. It allows attackers to remotely inject commands into the system, potentially leading to unauthorized access or control. Users of these devices should take immediate action to secure their systems and implement any patches or updates provided by the vendor to address the vulnerability.",
    "software": [
      "H3C Magic NX30 Pro",
      "Magic NX400"
    ]
  },
  {
    "cve_id": "CVE-2025-2729",
    "description": "A vulnerability was found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014 and classified as critical. This issue affects some unknown processing of the file /api/wizard/networkSetup of the component HTTP POST Request Handler. The manipulation leads to command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "The CVE is a critical vulnerability found in several H3C products, which can be exploited remotely through command injection in the HTTP POST Request Handler component. This vulnerability could potentially affect users of the affected products. To protect against potential attacks, users should update their systems to a version that addresses this vulnerability as soon as possible. It is important to note that the vendor did not respond to the disclosure of this vulnerability.",
    "software": [
      "H3C Magic NX15",
      "Magic NX30 Pro",
      "Magic NX400",
      "Magic R3010",
      "Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2025-2730",
    "description": "A vulnerability was found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. It has been classified as critical. Affected is an unknown function of the file /api/wizard/getssidname of the component HTTP POST Request Handler. The manipulation leads to command injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability affects several H3C Magic routers and can allow remote attackers to execute commands on the device. It is considered critical and the exploit has been made public, meaning it could be used by malicious actors. Users of these routers should update to the latest firmware version as soon as possible to protect against this threat. The vendor has been informed but has not responded to the disclosure.",
    "software": [
      "H3C Magic NX15",
      "Magic NX30 Pro",
      "Magic NX400",
      "Magic R3010",
      "Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2025-2731",
    "description": "A vulnerability was found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file /api/wizard/getDualbandSync of the component HTTP POST Request Handler. The manipulation leads to command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This CVE involves a critical vulnerability found in certain H3C devices, which allows for remote command injection. This vulnerability affects users of H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. To protect against this threat, users should update their devices with any patches or security measures provided by the vendor.",
    "software": [
      "H3C Magic NX15",
      "Magic NX30 Pro",
      "Magic NX400",
      "Magic R3010",
      "Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2025-2732",
    "description": "A vulnerability was found in H3C Magic NX15, Magic NX30 Pro, Magic NX400, Magic R3010 and Magic BE18000 up to V100R014. It has been rated as critical. Affected by this issue is some unknown functionality of the file /api/wizard/getWifiNeighbour of the component HTTP POST Request Handler. The manipulation leads to command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This CVE relates to a critical vulnerability found in various H3C Magic devices, which could allow for remote command injection through manipulation of a certain file. This vulnerability could potentially affect users of these devices. To protect against potential attacks, users should update their devices to the latest version as soon as a patch is made available. It is important to be proactive in securing these devices to prevent unauthorized access or control.",
    "software": [
      "H3C Magic NX15",
      "Magic NX30 Pro",
      "Magic NX400",
      "Magic R3010",
      "Magic BE18000"
    ]
  },
  {
    "cve_id": "CVE-2024-10206",
    "description": "A Server-Side Request Forgery vulnerability in the APROL Web Portal used in B&R APROL <4.4-00P5 may allow an unauthenticated network-based attacker to force the web server to request arbitrary URLs.",
    "summary": "This vulnerability in the APROL Web Portal allows attackers to trick the web server into making requests to arbitrary URLs without authentication. This could potentially lead to sensitive information being exposed or the server being compromised. Users of B&R APROL version <4.4-00P5 should update to the latest version to patch the vulnerability and prevent potential attacks.",
    "software": [
      "APROL Web Portal",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-10207",
    "description": "A Server-Side Request Forgery vulnerability in the APROL Web Portal used in B&R APROL <4.4-00P5 may allow an authenticated network-based attacker to force the web server to request arbitrary URLs.",
    "summary": "This vulnerability in the APROL Web Portal could be exploited by a hacker to make the web server request any URL, potentially leading to unauthorized access to sensitive information or further attacks. Users of B&R APROL <4.4-00P5 should update to the latest version or follow mitigation steps provided by the vendor to protect against this threat.",
    "software": [
      "APROL Web Portal",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-10208",
    "description": "An Improper Neutralization of Input During Web Page Generation vulnerability in the APROL Web Portal used in B&R APROL <4.4-00P5 may allow an authenticated network-based attacker to insert malicious code which is then executed in the context of the user’s browser session.",
    "summary": "This vulnerability in the APROL Web Portal software can be exploited by an attacker who is logged in to the network. They can insert malicious code that will run in the user's web browser. Users of B&R APROL <4.4-00P5 should update to a patched version to protect against this threat.",
    "software": [
      "APROL Web Portal",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-10209",
    "description": "An Incorrect Permission Assignment for Critical Resource vulnerability in the file system used in B&R APROL <4.4-01 may allow an authenticated local attacker to read and alter the configuration of another engineering or runtime user.",
    "summary": "This vulnerability in the B&R APROL file system could allow a local attacker to access and change the configuration of a different user. Users of B&R APROL systems should update to version 4.4-01 or newer to protect against this threat.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-45480",
    "description": "An improper control of generation of code ('Code Injection') vulnerability in the AprolCreateReport component of B&R APROL <4.4-00P5 may allow an unauthenticated network-based attacker to read files from the local system.",
    "summary": "This vulnerability in B&R APROL software could allow a hacker to read files from the system without proper authentication. Users of APROL version <4.4-00P5 should update their software to the latest version to protect against this threat.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-45481",
    "description": "An Incomplete Filtering of Special Elements vulnerability in scripts using the SSH server on B&R APROL <4.4-00P5 may allow an authenticated local attacker to authenticate as another legitimate user.",
    "summary": "This vulnerability in B&R APROL software may allow a local attacker with certain privileges to impersonate another user on the system. Users of B&R APROL software versions before <4.4-00P5 should update to the latest version to patch this issue and prevent unauthorized access.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-45482",
    "description": "An Inclusion of Functionality from Untrusted Control Sphere vulnerability in the SSH server on B&R APROL <4.4-00P1 may allow an authenticated local attacker from a trusted remote server to execute malicious commands.",
    "summary": "This vulnerability in the SSH server on B&R APROL <4.4-00P1 allows a local attacker who has access to a trusted remote server to run harmful commands. Users of B&R APROL <4.4-00P1 should update their software to the latest version to prevent unauthorized commands from being executed.",
    "software": [
      "SSH server",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-45483",
    "description": "A Missing Authentication for Critical Function vulnerability in the GRUB configuration used B&R APROL <4.4-01 may allow an unauthenticated physical attacker to alter the boot configuration of the operating system.",
    "summary": "This vulnerability in the GRUB configuration of B&R APROL software could be exploited by a physical attacker to change the boot configuration of the system without authentication. This could potentially lead to unauthorized access or control of the system. Users of B&R APROL software should update to version 4.4-01 or newer to patch this vulnerability and prevent unauthorized changes to the boot configuration.",
    "software": [
      "GRUB",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-45484",
    "description": "An Allocation of Resources Without Limits or Throttling vulnerability in the operating system network configuration used in B&R APROL <4.4-00P5 may allow an unauthenticated adjacent attacker to per-form Denial-of-Service (DoS) attacks against the product.",
    "summary": "A vulnerability in the B&R APROL operating system network configuration may allow a nearby attacker to launch a Denial-of-Service attack, which could disrupt the product's functionality. Users of B&R APROL <4.4-00P5 should update to the latest version to mitigate this threat.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-8313",
    "description": "An Exposure of Sensitive System Information to an Unauthorized Control Sphere and Initialization of a Resource with an Insecure Default vulnerability in the SNMP component of B&R APROL <4.4-00P5 may allow an unauthenticated adjacent-based attacker to read and alter configuration using SNMP.",
    "summary": "This vulnerability in the SNMP component of B&R APROL <4.4-00P5 allows hackers who are nearby to access and modify the system's configuration without authentication. This could lead to unauthorized changes being made to the system. Users should apply the latest updates and patches from the vendor to mitigate this risk.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-8314",
    "description": "An Incorrect Implementation of Authentication Algorithm and Exposure of Data Element to Wrong Ses-sion vulnerability in the session handling used in B&R APROL <4.4-00P5 may allow an authenticated network attacker to take over a currently active user session without login credentials.",
    "summary": "CVE-2020-24767 is a vulnerability in the session handling of B&R APROL <4.4-00P5 software, which could allow a network attacker to take control of a user session without needing login credentials. This vulnerability may affect users of B&R APROL <4.4-00P5. To mitigate this threat, users should update to the latest version of the software as soon as possible.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-8315",
    "description": "An Improper Handling of Insufficient Permissions or Privileges vulnerability in scripts used in B&R APROL <4.4-00P5 may allow an authenticated local attacker to read credential information.",
    "summary": "This vulnerability in B&R APROL software could allow a local attacker with limited permissions to access sensitive credential information. Users should update to version 4.4-00P5 to mitigate this risk.",
    "software": [
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2025-2733",
    "description": "A vulnerability classified as critical has been found in mannaandpoem OpenManus up to 2025.3.13. This affects an unknown part of the file app/tool/python_execute.py of the component Prompt Handler. The manipulation leads to os command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A critical vulnerability has been found in OpenManus software up to version 2025.3.13, specifically in the Prompt Handler component's python_execute.py file. This vulnerability could allow for remote attackers to inject and run malicious commands on the system. The exploit has been made public, and the vendor has not responded to the disclosure. Users should update to the latest version of OpenManus as soon as possible to mitigate this threat.",
    "software": [
      "mannaandpoem OpenManus",
      "Prompt Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2734",
    "description": "A vulnerability, which was classified as critical, was found in PHPGurukul Old Age Home Management System 1.0. Affected is an unknown function of the file /admin/aboutus.php. The manipulation of the argument pagetitle leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Old Age Home Management System 1.0 has a critical vulnerability that can be exploited through SQL injection via the /admin/aboutus.php file. This vulnerability can allow remote attackers to attack the system. To protect against this, users should update the software or implement security measures to prevent SQL injection attacks.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2735",
    "description": "A vulnerability has been found in PHPGurukul Old Age Home Management System 1.0 and classified as critical. Affected by this vulnerability is an unknown functionality of the file /admin/add-services.php. The manipulation of the argument sertitle leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "A critical vulnerability in PHPGurukul Old Age Home Management System 1.0 allows for remote attackers to launch a SQL injection attack through the file /admin/add-services.php. This could potentially affect anyone using this software. Users should update to a patched version as soon as possible to mitigate this threat.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2736",
    "description": "A vulnerability was found in PHPGurukul Old Age Home Management System 1.0 and classified as critical. Affected by this issue is some unknown functionality of the file /admin/bwdates-report-details.php. The manipulation of the argument fromdate leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. Other parameters might be affected as well.",
    "summary": "This is a critical vulnerability found in the PHPGurukul Old Age Home Management System 1.0 that could allow an attacker to execute SQL injection through the /admin/bwdates-report-details.php file. This can be exploited remotely and could affect other parts of the system. To prevent this, users should apply the necessary security updates provided by the developer.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2024-10105",
    "description": "The Job Postings WordPress plugin before 2.7.11 does not sanitise and escape some of its settings, which could allow high privilege users such as contributor to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Job Postings WordPress plugin has a security flaw in versions before 2.7.11 that allows high privilege users to conduct Stored Cross-Site Scripting attacks, even when certain permissions are restricted. This vulnerability could affect WordPress sites using this plugin, particularly in multisite setups. Users should update to the latest version of the plugin (2.7.11) to mitigate this risk.",
    "software": [
      "Job Postings WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10210",
    "description": "An External Control of File Name or Path vulnerability in the APROL Web Portal used in B&R APROL <4.4-005P may allow an authenticated network-based attacker to access data from the file system.",
    "summary": "This vulnerability in the APROL Web Portal software could allow an attacker who has access to the network to view files on the system. This could potentially affect anyone using APROL version <4.4-005P. Users should update their software to the latest version to protect against this vulnerability.",
    "software": [
      "APROL Web Portal",
      "B&R APROL"
    ]
  },
  {
    "cve_id": "CVE-2024-10472",
    "description": "The Stylish Price List  WordPress plugin before 7.1.12 does not sanitise and escape some of its settings, which could allow high privilege users such as contributor to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Stylish Price List WordPress plugin before version 7.1.12 is vulnerable to a Stored Cross-Site Scripting attack, which could be exploited by high privilege users like contributors. This could potentially allow an attacker to inject malicious code into a website and compromise user data. Users of this plugin should update to version 7.1.12 or higher to protect against this vulnerability.",
    "software": [
      "Stylish Price List",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-10554",
    "description": "The WordPress WP-Advanced-Search WordPress plugin before 3.3.9.3 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the WP-Advanced-Search WordPress plugin allows high privilege users to execute malicious code on a website, even if certain security measures are in place. This threat is applicable to websites that use this specific plugin and could potentially affect all users. To protect against this vulnerability, users should update the plugin to version 3.3.9.3 or higher.",
    "software": [
      "WordPress",
      "WP-Advanced-Search WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10560",
    "description": "The Form Maker by 10Web  WordPress plugin before 1.15.30 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Form Maker plugin for WordPress is vulnerable to a Stored Cross-Site Scripting attack, which could be exploited by high privilege users like admins, even if certain permissions are restricted. Users of this plugin should update to version 1.15.30 or later to protect against this threat.",
    "software": [
      "Form Maker by 10Web"
    ]
  },
  {
    "cve_id": "CVE-2024-10565",
    "description": "The Slider by 10Web  WordPress plugin before 1.2.62 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Slider by 10Web WordPress plugin before version 1.2.62 is vulnerable to Stored Cross-Site Scripting attacks. This means that high privilege users, like admins, could inject malicious code into the plugin's settings. This could affect WordPress websites where this plugin is installed, especially in a multisite setup. To prevent this vulnerability, users are advised to update the plugin to version 1.2.62 or newer.",
    "software": [
      "Slider by 10Web WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10566",
    "description": "The Slider by 10Web  WordPress plugin before 1.2.62 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Slider by 10Web WordPress plugin before version 1.2.62 is vulnerable to Stored Cross-Site Scripting attacks, which can be exploited by high privilege users like admins. This could potentially affect WordPress websites using this plugin, especially in multisite setups. Users should update to version 1.2.62 or later to protect against this vulnerability.",
    "software": [
      "Slider by 10Web WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10638",
    "description": "The Product Labels For Woocommerce (Sale Badges) WordPress plugin before 1.5.11 does not sanitize and escape a parameter before using it in a SQL statement, allowing admins to perform SQL injection attacks",
    "summary": "The Product Labels For Woocommerce WordPress plugin has a vulnerability that can be exploited by attackers to perform SQL injection attacks. This could affect anyone using the plugin before version 1.5.11. Users should update to the latest version of the plugin to protect against this threat.",
    "software": [
      "Product Labels For Woocommerce (Sale Badges) WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10679",
    "description": "The Quiz and Survey Master (QSM)  WordPress plugin before 9.2.1 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Quiz and Survey Master (QSM) WordPress plugin before version 9.2.1 is vulnerable to Stored Cross-Site Scripting attacks. This means that high privilege users, like admins, could inject malicious code into the site, potentially leading to further security breaches. Users of this plugin should update to version 9.2.1 or later to protect against this vulnerability.",
    "software": [
      "Quiz and Survey Master (QSM) WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-10703",
    "description": "The Registrations for the Events Calendar  WordPress plugin before 2.13.4 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This security vulnerability in the Registrations for the Events Calendar WordPress plugin allows high privilege users to execute harmful code on a website, potentially impacting all users of the plugin. Users should update to version 2.13.4 or higher to protect against this threat.",
    "software": [
      "Registrations for the Events Calendar",
      "WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-11272",
    "description": "The Contact Form & SMTP Plugin for WordPress by PirateForms WordPress plugin before 2.6.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This security vulnerability in the Contact Form & SMTP Plugin for WordPress allows high privilege users to perform Stored Cross-Site Scripting attacks, potentially compromising the website. Users of this plugin should update to version 2.6.0 or later to protect against this threat.",
    "software": [
      "Contact Form & SMTP Plugin",
      "PirateForms WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-11273",
    "description": "The Contact Form & SMTP Plugin for WordPress by PirateForms WordPress plugin before 2.6.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the Contact Form & SMTP Plugin for WordPress allows high privilege users to carry out Stored Cross-Site Scripting attacks. This affects users of the plugin, particularly those with admin privileges. To protect against this threat, users should update the plugin to version 2.6.0 or later.",
    "software": [
      "Contact Form & SMTP Plugin",
      "PirateForms WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-11503",
    "description": "The WP Tabs  WordPress plugin before 2.2.7 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "This vulnerability in the WP Tabs WordPress plugin allows high privilege users, such as admins, to execute malicious code through Stored Cross-Site Scripting attacks. This can affect WordPress websites using the plugin before version 2.2.7. Users should update to the latest version of the plugin to protect against this threat.",
    "software": [
      "WP Tabs WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-12109",
    "description": "The Product Labels For Woocommerce (Sale Badges) WordPress plugin before 1.5.9 does not sanitize and escape a parameter before using it in a SQL statement, allowing admins to perform SQL injection attacks",
    "summary": ". \n\nThis vulnerability in the Product Labels for WooCommerce WordPress plugin allows malicious admins to carry out SQL injection attacks on the affected websites. This could potentially lead to unauthorized access to sensitive information or manipulation of the website's database. \n\nUsers of the Product Labels for WooCommerce plugin should update to version 1.5.9 or later to ensure they are protected against this vulnerability. Additionally, they should also regularly monitor their website for any suspicious activity.",
    "software": [
      "Product Labels For Woocommerce (Sale Badges) WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-12682",
    "description": "The Smart Maintenance Mode WordPress plugin before 1.5.2 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Smart Maintenance Mode WordPress plugin has a security vulnerability that could allow high privilege users, like admin, to perform XSS attacks. This could affect websites using the plugin, especially in multisite setups. Users should update to version 1.5.2 or higher to protect against this threat.",
    "software": [
      "Smart Maintenance Mode",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-12769",
    "description": "The Simple Banner  WordPress plugin before 3.0.4 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "A vulnerability has been found in the Simple Banner WordPress plugin before version 3.0.4. This vulnerability allows high privilege users, like admins, to execute Stored Cross-Site Scripting attacks. This could affect users of the plugin, particularly in multisite setups. To protect against this threat, users should update to version 3.0.4 of the plugin.",
    "software": [
      "Simple Banner"
    ]
  },
  {
    "cve_id": "CVE-2024-13118",
    "description": "The IP Based Login WordPress plugin before 2.4.1 does not have CSRF checks in some places, which could allow attackers to make logged in users delete all logs via a CSRF attack",
    "summary": "The IP Based Login WordPress plugin version before 2.4.1 is vulnerable to a CSRF attack, which could allow attackers to make logged in users delete all logs. This vulnerability affects users of the plugin who have not updated to version 2.4.1. To mitigate this threat, users should update their plugin to the latest version available.",
    "software": [
      "IP Based Login WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13122",
    "description": "The AFI  WordPress plugin before 1.100.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The AFI WordPress plugin before version 1.100.0 is vulnerable to Stored Cross-Site Scripting attacks, allowing high privilege users to exploit the plugin even when certain security measures are in place. This could affect users of the plugin, particularly in a multisite setup. To protect against this vulnerability, users should update the plugin to version 1.100.0 or later.",
    "software": [
      "AFI WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13123",
    "description": "The AFI  WordPress plugin before 1.100.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The AFI WordPress plugin version before 1.100.0 has a security vulnerability that could allow high privilege users, like admins, to execute Stored Cross-Site Scripting attacks, even if certain permissions are disabled. This could affect users of the plugin, particularly on multisite setups. To mitigate this threat, users should update to version 1.100.0 or higher to prevent unauthorized script execution.",
    "software": [
      "AFI WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13617",
    "description": "The aoa-downloadable WordPress plugin through 0.1.0 doesn't validate a parameter in its download function, allowing unauthenticated attackers to download arbitrary files from the server",
    "summary": "This vulnerability in the aoa-downloadable WordPress plugin allows hackers to download any file from the server without needing to log in. This affects anyone using the vulnerable plugin. To protect against this threat, users should update their plugin to version 0.1.1 or higher.",
    "software": [
      "aoa-downloadable",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-13618",
    "description": "The aoa-downloadable WordPress plugin through 0.1.0 lacks authorization and authentication for requests to its download.php endpoint, allowing unauthenticated visitors to make requests to arbitrary URLs.",
    "summary": "The aoa-downloadable WordPress plugin version 0.1.0 has a security vulnerability that allows unauthorized users to access and download files from arbitrary URLs. This vulnerability can affect anyone using this plugin on their WordPress website. Users should immediately update to a patched version of the plugin to prevent unauthorized access to sensitive files.",
    "software": [
      "aoa-downloadable",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-13863",
    "description": "The Stylish Google Sheet Reader 4.0  WordPress plugin before 4.1 does not sanitise and escape a parameter before outputting it back in the page, leading to a Reflected Cross-Site Scripting which could be used against high privilege users such as admin",
    "summary": "The Stylish Google Sheet Reader 4.0 WordPress plugin is vulnerable to Reflected Cross-Site Scripting, which can be used to attack high privilege users like admins. Users of this plugin should update to version 4.1 to protect against this vulnerability.",
    "software": [
      "Stylish Google Sheet Reader",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2024-44903",
    "description": "SQL Injection can occur in the SirsiDynix Horizon Information Portal (IPAC20) through 3.25_9382; however, a patch is available from the vendor. This is in ipac.jsp in a SELECT WHERE statement, in a part of the uri= variable in the second part of the full= inner variable.",
    "summary": "A vulnerability in the SirsiDynix Horizon Information Portal could allow attackers to execute SQL injection attacks. This issue affects users of IPAC20 version 3.25_9382. To mitigate this threat, users should apply the patch provided by the vendor.",
    "software": [
      "SirsiDynix Horizon Information Portal (IPAC20)"
    ]
  },
  {
    "cve_id": "CVE-2024-9770",
    "description": "The WP-Recall  WordPress plugin before 16.26.12 does not sanitize and escape a parameter before using it in a SQL statement, allowing admins to perform SQL injection attacks",
    "summary": "This vulnerability in the WP-Recall WordPress plugin allows attackers to inject malicious SQL code, potentially giving them unauthorized access to the website's database. This affects websites that have the plugin installed and have not updated to version 16.26.12. Website administrators should update the plugin to the latest version to protect against potential attacks.",
    "software": [
      "WP-Recall"
    ]
  },
  {
    "cve_id": "CVE-2025-0717",
    "description": "To exploit the vulnerability, it is necessary:",
    "summary": "This Common Vulnerabilities and Exposures (CVE) describes a security flaw that allows attackers to execute malicious code on a device by tricking a user into opening a specially-crafted file or visiting a malicious website. This vulnerability affects users of a specific software or system. Users should apply the latest security updates and be cautious when opening files or clicking on links from unknown sources to protect against this threat.",
    "software": [
      "Google Chrome",
      "Microsoft Edge"
    ]
  },
  {
    "cve_id": "CVE-2025-0845",
    "description": "The DesignThemes Core Features plugin for WordPress is vulnerable to Stored Cross-Site Scripting via shortcodes in versions up to, and including, 4.8 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers with contributor-level and above permissions to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The DesignThemes Core Features plugin for WordPress can be exploited by attackers to inject harmful scripts into web pages, potentially affecting anyone using this plugin up to version 4.8. Users should update the plugin to version 4.9 or higher to protect against this vulnerability and ensure their website's security.",
    "software": [
      "DesignThemes Core Features plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1452",
    "description": "The Favorites WordPress plugin before 2.3.5 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup).",
    "summary": "The Favorites WordPress plugin version before 2.3.5 is vulnerable to Stored Cross-Site Scripting attacks. This could allow high privilege users, such as admin, to execute malicious scripts on the website. Users of this plugin, especially those in a multi-site setup, should update to version 2.3.5 to protect against this threat.",
    "software": [
      "Favorites WordPress plugin"
    ]
  },
  {
    "cve_id": "CVE-2025-1798",
    "description": "The  does not sanitise and escape some parameters when outputting them back in a page, allowing unauthenticated users the ability to perform stored Cross-Site Scripting attacks.",
    "summary": "This vulnerability allows hackers to insert malicious code into a website and trick users into executing harmful actions. It affects any user who accesses the compromised website. To protect against this, website developers should properly sanitize and escape all input to prevent these attacks.",
    "software": [
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-27809",
    "description": "Mbed TLS before 2.28.10 and 3.x before 3.6.3, on the client side, accepts servers that have trusted certificates for arbitrary hostnames unless the TLS client application calls mbedtls_ssl_set_hostname.",
    "summary": "This vulnerability in Mbed TLS can allow attackers to use trusted certificates for any hostname on the client side, potentially leading to man-in-the-middle attacks. This affects users of Mbed TLS versions before 2.28.10 and 3.x before 3.6.3. Users should update to the latest version and ensure that their TLS client application calls mbedtls_ssl_set_hostname to properly validate hostnames.",
    "software": [
      "Mbed TLS"
    ]
  },
  {
    "cve_id": "CVE-2025-27810",
    "description": "Mbed TLS before 2.28.10 and 3.x before 3.6.3, in some cases of failed memory allocation or hardware errors, uses uninitialized stack memory to compose the TLS Finished message, potentially leading to authentication bypasses such as replays.",
    "summary": "This CVE, affecting Mbed TLS versions before 2.28.10 and 3.x before 3.6.3, can result in an authentication bypass due to the use of uninitialized stack memory when composing the TLS Finished message. This vulnerability could be exploited by attackers to replay authentications. Users of Mbed TLS should update to version 2.28.10 or 3.6.3 to mitigate the risk of exploitation.",
    "software": [
      "Mbed TLS"
    ]
  },
  {
    "cve_id": "CVE-2025-2224",
    "description": "The Directorist: AI-Powered Business Directory Plugin with Classified Ads Listings plugin for WordPress is vulnerable to unauthorized access  and modification of data due to a missing capability check on the 'parse_query' function in all versions up to, and including, 8.2. This makes it possible for unauthenticated attackers to update the post_status of any post to 'publish'.",
    "summary": "The CVE is a vulnerability in the Directorist plugin for WordPress which allows unauthorized users to access and modify data by exploiting a missing capability check. This can potentially lead to unauthorized changes in post statuses. Users of the affected plugin are advised to update to version 8.3 or higher to fix this security issue.",
    "software": [
      "Directorist: AI-Powered Business Directory Plugin with Classified Ads Listings"
    ]
  },
  {
    "cve_id": "CVE-2025-2737",
    "description": "A vulnerability was found in PHPGurukul Old Age Home Management System 1.0. It has been classified as critical. This affects an unknown part of the file /admin/contactus.php. The manipulation of the argument pagetitle leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in PHPGurukul Old Age Home Management System 1.0 allows for SQL injection through manipulation of a specific argument in the file /admin/contactus.php. This can be exploited remotely, posing a critical threat. Users of this system should update to a patched version to prevent potential attacks leveraging this vulnerability.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2738",
    "description": "A vulnerability was found in PHPGurukul Old Age Home Management System 1.0. It has been declared as critical. This vulnerability affects unknown code of the file /admin/manage-scdetails.php. The manipulation of the argument namesc leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The vulnerability in PHPGurukul Old Age Home Management System 1.0 allows for remote attackers to manipulate arguments and conduct SQL injection attacks through the file /admin/manage-scdetails.php. This can lead to unauthorized access and manipulation of the system's database. To mitigate this threat, users should update the software to a patched version or apply security measures recommended by the software vendor.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2739",
    "description": "A vulnerability was found in PHPGurukul Old Age Home Management System 1.0. It has been rated as critical. This issue affects some unknown processing of the file /admin/manage-services.php. The manipulation of the argument sertitle leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Old Age Home Management System 1.0 has a critical vulnerability that allows for SQL injection through the file /admin/manage-services.php. This vulnerability can be exploited remotely, and the details have been made public which increases the risk of attacks. Users of this system should take immediate action to implement a fix or patch to protect against potential attacks.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2024-12623",
    "description": "The DICOM Support plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's 'dcm' shortcode in all versions up to, and including, 0.10.6 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "This vulnerability in the DICOM Support plugin for WordPress allows authenticated attackers with contributor-level access or higher to inject harmful web scripts into pages, potentially putting users at risk. Users should update the plugin to version 0.10.7 or higher to prevent exploitation.",
    "software": [
      "DICOM Support plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-1320",
    "description": "The teachPress plugin for WordPress is vulnerable to Cross-Site Request Forgery in all versions up to, and including, 9.0.9. This is due to missing or incorrect nonce validation on the import.php page. This makes it possible for unauthenticated attackers to delete imports via a forged request granted they can trick a site administrator into performing an action such as clicking on a link.",
    "summary": "This vulnerability in the teachPress plugin for WordPress allows attackers to delete imports on a website by tricking an administrator into clicking on a link. This affects all versions of the plugin up to 9.0.9. To address this issue, users should update the plugin to the latest version as soon as possible and be cautious when clicking on links from unknown sources.",
    "software": [
      "teachPress plugin",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2252",
    "description": "The Easy Digital Downloads – eCommerce Payments and Subscriptions made easy plugin for WordPress is vulnerable to Sensitive Information Exposure in all versions up to, and including, 3.3.6.1 via the edd_ajax_get_download_title() function. This makes it possible for unauthenticated attackers to extract private post titles of downloads. The impact here is minimal.",
    "summary": "This vulnerability in the Easy Digital Downloads plugin for WordPress allows attackers to view private download titles without authentication. The impact is minimal, but users should update to version 3.3.7 to patch the issue.",
    "software": [
      "Easy Digital Downloads",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2740",
    "description": "A vulnerability classified as critical has been found in PHPGurukul Old Age Home Management System 1.0. Affected is an unknown function of the file /admin/eligibility.php. The manipulation of the argument pagetitle leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The PHPGurukul Old Age Home Management System 1.0 has a critical vulnerability that allows attackers to execute a SQL injection attack through the /admin/eligibility.php file. This vulnerability can be exploited remotely, and it has been made public, increasing the risk of attacks. Users of this system should immediately update to a patched version to protect against potential security breaches.",
    "software": [
      "PHPGurukul Old Age Home Management System"
    ]
  },
  {
    "cve_id": "CVE-2025-2742",
    "description": "A vulnerability classified as critical was found in zhijiantianya ruoyi-vue-pro 2.4.1. This vulnerability affects unknown code of the file /admin-api/mp/material/upload-permanent of the component Material Upload Interface. The manipulation of the argument File leads to path traversal. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "A critical vulnerability has been found in the zhijiantianya ruoyi-vue-pro 2.4.1 software. This vulnerability allows for remote attackers to manipulate files and potentially gain unauthorized access to a system through path traversal. Users of this component Material Upload Interface are at risk. It is recommended to update to a secure version of the software, as the vendor has not responded to the disclosure of this exploit.",
    "software": [
      "zhijiantianya ruoyi-vue-pro"
    ]
  },
  {
    "cve_id": "CVE-2025-2743",
    "description": "A vulnerability, which was classified as problematic, has been found in zhijiantianya ruoyi-vue-pro 2.4.1. This issue affects some unknown processing of the file /admin-api/mp/material/upload-temporary of the component Material Upload Interface. The manipulation of the argument File leads to path traversal. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in the component Material Upload Interface of zhijiantianya ruoyi-vue-pro 2.4.1 allows attackers to remotely manipulate files and potentially gain unauthorized access to sensitive data. This threat impacts users of the affected component. To mitigate the risk, users should refrain from using the component and consider implementing alternative security measures until a patch or fix is provided by the vendor.",
    "software": [
      "zhijiantianya ruoyi-vue-pro"
    ]
  },
  {
    "cve_id": "CVE-2025-2744",
    "description": "A vulnerability, which was classified as critical, was found in zhijiantianya ruoyi-vue-pro 2.4.1. Affected is an unknown function of the file /admin-api/mp/material/upload-news-image of the component Material Upload Interface. The manipulation of the argument File leads to path traversal. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.",
    "summary": "This vulnerability in zhijiantianya ruoyi-vue-pro 2.4.1 allows attackers to manipulate files and potentially gain access to sensitive information through remote attacks. It affects users of this component's Material Upload Interface. To protect against this threat, users should be cautious of any unknown files being uploaded and consider updating to a patched version of the software if available. The vendor has been informed of the issue but has not responded.",
    "software": [
      "zhijiantianya ruoyi-vue-pro"
    ]
  },
  {
    "cve_id": "CVE-2025-2750",
    "description": "A vulnerability, which was classified as critical, was found in Open Asset Import Library Assimp 5.4.3. This affects the function Assimp::CSMImporter::InternReadFile of the file code/AssetLib/CSM/CSMLoader.cpp of the component CSM File Handler. The manipulation leads to out-of-bounds write. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability found in Open Asset Import Library Assimp 5.4.3 allows for remote attackers to initiate an out-of-bounds write attack through a specific function in the code. This affects users of the CSM File Handler component. To protect against this threat, users should update to the latest version of Assimp as soon as possible.",
    "software": [
      "Open Asset Import Library Assimp"
    ]
  },
  {
    "cve_id": "CVE-2025-2751",
    "description": "A vulnerability has been found in Open Asset Import Library Assimp 5.4.3 and classified as problematic. This vulnerability affects the function Assimp::CSMImporter::InternReadFile of the file code/AssetLib/CSM/CSMLoader.cpp of the component CSM File Handler. The manipulation of the argument na leads to out-of-bounds read. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "The Open Asset Import Library Assimp 5.4.3 has a vulnerability that allows for out-of-bounds read due to manipulation of a specific argument. This vulnerability in the CSM File Handler component can be exploited remotely, putting users at risk. It is recommended to update to a secure version and take precautions to prevent any potential attacks.",
    "software": [
      "Open Asset Import Library Assimp"
    ]
  },
  {
    "cve_id": "CVE-2025-2752",
    "description": "A vulnerability was found in Open Asset Import Library Assimp 5.4.3 and classified as problematic. This issue affects the function fast_atoreal_move in the library include/assimp/fast_atof.h of the component CSM File Handler. The manipulation leads to out-of-bounds read. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "A vulnerability was found in Open Asset Import Library Assimp version 5.4.3 that allows for out-of-bounds read, which can be exploited remotely. This affects users of the CSM File Handler component. It is recommended to update to a secure version of the library to prevent potential attacks.",
    "software": [
      "Open Asset Import Library Assimp",
      "CSM File Handler"
    ]
  },
  {
    "cve_id": "CVE-2024-13690",
    "description": "The WP Church Donation plugin for WordPress is vulnerable to Stored Cross-Site Scripting via several donation form submission parameters in all versions up to, and including, 1.7 due to insufficient input sanitization and output escaping. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The WP Church Donation plugin for WordPress is vulnerable to a type of cyber attack called Stored Cross-Site Scripting, which allows malicious actors to inject harmful code into donation forms. This affects all versions up to 1.7 of the plugin. Website administrators using this plugin should update to the latest version as soon as possible to protect against potential attacks.",
    "software": [
      "WP Church Donation plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13710",
    "description": "The Estatebud – Properties & Listings plugin for WordPress is vulnerable to Cross-Site Request Forgery in all versions up to, and including, 5.5.0. This is due to missing or incorrect nonce validation on the 'estatebud_settings' page. This makes it possible for unauthenticated attackers to update the plugin's settings via a forged request granted they can trick a site administrator into performing an action such as clicking on a link.",
    "summary": "The Estatebud - Properties & Listings plugin for WordPress is at risk of a security threat called Cross-Site Request Forgery, making it vulnerable to unauthorized changes by attackers. This affects all versions up to 5.5.0. Site administrators should update the plugin to version 5.5.1 or later to fix this vulnerability and prevent exploitation by unauthenticated attackers.",
    "software": [
      "Estatebud – Properties & Listings plugin"
    ]
  },
  {
    "cve_id": "CVE-2024-13731",
    "description": "The Alert Box Block – Display notice/alerts in the front end. plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's Alert Box block in all versions up to, and including, 1.1.2 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "summary": "The Alert Box Block plugin for WordPress is at risk of a Stored Cross-Site Scripting vulnerability, which allows authenticated attackers with contributor-level access or higher to inject harmful scripts into web pages. This can affect anyone using versions up to 1.1.2 of the plugin. Users should update to the latest version of the plugin to protect against this threat.",
    "software": [
      "Alert Box Block"
    ]
  },
  {
    "cve_id": "CVE-2025-2319",
    "description": "The EZ SQL Reports Shortcode Widget and DB Backup plugin for WordPress is vulnerable to Cross-Site Request Forgery in versions 4.11.13 to 5.25.08. This is due to missing or incorrect nonce validation on the 'ELISQLREPORTS_menu' function. This makes it possible for unauthenticated attackers to execute code on the server via a forged request granted they can trick a site administrator into performing an action such as clicking on a link. Version 5.25.10 adds a nonce check, which makes this vulnerability exploitable by admins only.",
    "summary": "The EZ SQL Reports Shortcode Widget and DB Backup plugin for WordPress is at risk of Cross-Site Request Forgery, allowing attackers to execute code on the server if they can trick a site administrator into performing an action. Users of versions 4.11.13 to 5.25.08 are affected. To mitigate this threat, users should update to version 5.25.10 which includes a nonce check, making the vulnerability exploitable only by admins.",
    "software": [
      "EZ SQL Reports Shortcode Widget",
      "DB Backup plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2510",
    "description": "The Frndzk Expandable Bottom Bar plugin for WordPress is vulnerable to Stored Cross-Site Scripting via 'text' parameter in all versions up to, and including, 1.0 due to insufficient input sanitization and output escaping. This makes it possible for authenticated attackers, with administrator-level permissions and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page. This only affects multi-site installations and installations where unfiltered_html has been disabled.",
    "summary": "The Frndzk Expandable Bottom Bar plugin for WordPress is at risk of a Stored Cross-Site Scripting attack, which allows attackers with administrator-level permissions to inject harmful scripts into web pages that can be executed by users visiting those pages. This vulnerability affects multi-site installations and installations that have disabled unfiltered_html. Users should update to version 1.1 or newer to protect against this threat.",
    "software": [
      "Frndzk Expandable Bottom Bar",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2559",
    "description": "A flaw was found in Keycloak. When the configuration uses JWT tokens for authentication, the tokens are cached until expiration. If a client uses JWT tokens with an excessively long expiration time, for example, 24 or 48 hours, the cache can grow indefinitely, leading to an OutOfMemoryError. This issue could result in a denial of service condition, preventing legitimate users from accessing the system.",
    "summary": "The Keycloak security system has a vulnerability where if an attacker uses JWT tokens with a very long expiration time, it can cause the system to run out of memory and stop legitimate users from accessing it. Users of Keycloak should update their systems to address this issue and prevent potential denial of service attacks.",
    "software": [
      "Keycloak"
    ]
  },
  {
    "cve_id": "CVE-2025-2753",
    "description": "A vulnerability was found in Open Asset Import Library Assimp 5.4.3. It has been classified as critical. Affected is the function SceneCombiner::MergeScenes of the file code/AssetLib/LWS/LWSLoader.cpp of the component LWS File Handler. The manipulation leads to out-of-bounds read. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in Open Asset Import Library Assimp 5.4.3 could allow for a remote attacker to access information beyond its intended boundaries. This could potentially impact users of this specific component, the LWS File Handler. To protect against this threat, users should update to the latest version of the software or apply any relevant patches as soon as possible.",
    "software": [
      "Open Asset Import Library Assimp"
    ]
  },
  {
    "cve_id": "CVE-2025-2754",
    "description": "A vulnerability was found in Open Asset Import Library Assimp 5.4.3. It has been declared as critical. Affected by this vulnerability is the function Assimp::AC3DImporter::ConvertObjectSection of the file code/AssetLib/AC/ACLoader.cpp of the component AC3D File Handler. The manipulation of the argument it leads to heap-based buffer overflow. The attack can be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in Open Asset Import Library Assimp 5.4.3 could allow hackers to launch a remote attack, leading to a heap-based buffer overflow. This could affect anyone using the AC3D File Handler component. It is critical to update to a version that fixes this vulnerability to prevent potential attacks.",
    "software": [
      "Open Asset Import Library Assimp",
      "AC3DImporter",
      "ACLoader.cpp",
      "AC3D File Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2755",
    "description": "A vulnerability was found in Open Asset Import Library Assimp 5.4.3. It has been rated as critical. Affected by this issue is the function Assimp::AC3DImporter::ConvertObjectSection of the file code/AssetLib/AC/ACLoader.cpp of the component AC3D File Handler. The manipulation of the argument src.entries leads to out-of-bounds read. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This vulnerability in Open Asset Import Library Assimp 5.4.3 can be exploited by attackers to read data from a program's memory, which can lead to a remote attack. It affects users of this specific version of the library. Users should update to a patched version of the software to protect against potential attacks.",
    "software": [
      "Open Asset Import Library Assimp",
      "AC3DImporter",
      "ACLoader.cpp",
      "AC3D File Handler"
    ]
  },
  {
    "cve_id": "CVE-2024-53678",
    "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Apache VCL. Users can modify form data submitted when requesting a new Block Allocation such that a SELECT SQL statement is modified. The data returned by the SELECT statement is not viewable by the attacker.\n\nThis issue affects all versions of Apache VCL from 2.2 through 2.5.1.\n\nUsers are recommended to upgrade to version 2.5.2, which fixes the issue.",
    "summary": "The CVE involves a vulnerability in Apache VCL that allows users to manipulate form data to modify SQL commands, specifically a SELECT statement. This vulnerability affects all versions of Apache VCL from 2.2 through 2.5.1. Users are advised to update to version 2.5.2 to resolve this issue and prevent potential exploitation by attackers.",
    "software": [
      "Apache VCL"
    ]
  },
  {
    "cve_id": "CVE-2024-53679",
    "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Apache VCL in the User Lookup form. A user with sufficient rights to be able to view this part of the site can craft a URL or be tricked in to clicking a URL that will give a specified user elevated rights.\n\n\n\nThis issue affects all versions of Apache VCL through 2.5.1.\n\n\n\nUsers are recommended to upgrade to version 2.5.2, which fixes the issue.",
    "summary": "The Apache VCL software has a vulnerability that could allow a user to gain elevated rights by manipulating a URL. This affects all versions up to 2.5.1. To protect against this threat, users should upgrade to version 2.5.2, which resolves the issue.",
    "software": [
      "Apache VCL"
    ]
  },
  {
    "cve_id": "CVE-2025-2542",
    "description": "The Your Simple SVG Support plugin for WordPress is vulnerable to Stored Cross-Site Scripting via SVG File uploads in all versions up to, and including, 1.0.1 due to insufficient input sanitization and output escaping. This makes it possible for authenticated attackers, with Author-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses the SVG file.",
    "summary": "This vulnerability in the Your Simple SVG Support plugin for WordPress allows attackers with a certain level of access to inject harmful scripts into websites using SVG files. This can affect anyone using this plugin up to version 1.0.1. To protect against this threat, users should update the plugin to the latest version and avoid uploading SVG files from untrusted sources.",
    "software": [
      "Your Simple SVG Support plugin for WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2635",
    "description": "The Digital License Manager plugin for WordPress is vulnerable to Reflected Cross-Site Scripting due to the use of remove_query_arg() function without appropriate escaping on the URL in all versions up to, and including, 1.7.3. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that execute if they can successfully trick a user into performing an action such as clicking on a link.",
    "summary": "The Digital License Manager plugin for WordPress is at risk of a security vulnerability called Reflected Cross-Site Scripting, where hackers can inject harmful scripts into web pages. This affects all versions up to 1.7.3 and can be exploited by tricking users into clicking on malicious links. To stay safe, users should update the plugin to the latest version and be cautious of clicking on unknown links.",
    "software": [
      "Digital License Manager plugin",
      "WordPress"
    ]
  },
  {
    "cve_id": "CVE-2025-2756",
    "description": "A vulnerability classified as critical has been found in Open Asset Import Library Assimp 5.4.3. This affects the function Assimp::AC3DImporter::ConvertObjectSection of the file code/AssetLib/AC/ACLoader.cpp of the component AC3D File Handler. The manipulation of the argument tmp leads to heap-based buffer overflow. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This is a serious vulnerability in Open Asset Import Library Assimp 5.4.3 that could allow attackers to remotely initiate a heap-based buffer overflow by manipulating a specific argument in the code. This could affect users of the AC3D File Handler component. To protect against this threat, users should update to the latest version of the software as soon as possible to prevent potential attacks.",
    "software": [
      "Open Asset Import Library Assimp",
      "AC3DImporter",
      "ACLoader.cpp",
      "AC3D File Handler"
    ]
  },
  {
    "cve_id": "CVE-2025-2757",
    "description": "A vulnerability classified as critical was found in Open Asset Import Library Assimp 5.4.3. This vulnerability affects the function AI_MD5_PARSE_STRING_IN_QUOTATION of the file code/AssetLib/MD5/MD5Parser.cpp of the component MD5 File Handler. The manipulation of the argument data leads to heap-based buffer overflow. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "summary": "This critical vulnerability in Open Asset Import Library Assimp 5.4.3 allows for a remote attacker to potentially trigger a heap-based buffer overflow by manipulating certain data in the MD5 File Handler component. This could affect anyone using this library. To protect against this threat, users are advised to update to a patched version of the software as soon as possible.",
    "software": [
      "Open Asset Import Library Assimp"
    ]
  },
  {
    "cve_id": "CVE-2025-2109",
    "description": "The WP Compress – Instant Performance & Speed Optimization plugin for WordPress is vulnerable to Server-Side Request Forgery in all versions up to, and including, 6.30.15 via the init() function. This makes it possible for unauthenticated attackers to make web requests to arbitrary locations originating from the web application and can be used to query information from internal services.",
    "summary": "This vulnerability in the WP Compress plugin for WordPress allows hackers to make unauthorized requests to different websites through the affected plugin. This can lead to potential attacks on internal services and information disclosure. Users should update the plugin to version 6.30.16 or higher to protect against this threat.",
    "software": [
      "WP Compress - Instant Performance & Speed Optimization plugin for WordPress"
    ]
  }
]